[
  {
    "keyword": "Chicken",
    "title": "Elegant Chicken in Sour Cream",
    "ingredients": "** Package Together **, 2 oz Freeze-Dried Chicken, Or, 4 oz Chicken-Flavored T.V.P., 4 Chicken Bouillon Cube, Or, 1/4 c Chicken Bouillon Granules, 8 oz Pasta, Enriched, 1 ts Dill Weed, ** Package Sepatately **, 1 Env Cream Of Onion Soup Mix, To make 2 1/2 cups, 8 oz Sour Cream Mix, 1/2 c Sliced Almonds, 2 oz Freeze-Dried Peas, 8 c Water",
    "servings": "4 Servings",
    "instructions": "1. Bring 7 cups of water to boiling, add pasta-chicken package, and simmer for 10 minutes, stirring occasionally. Add peas, at the end, for the amount of time recommended on their package. 2. Mix soup mix with 1/2 cup of water. Pour into pot while stirring, and simmer 5-10 minutes more, or until pasta and chicken are tender. 3. Reconstitute sour cream mix with cold water, stir into the pot. Serve sprinkled with almonds on top. Makes about 8 cups.",
    "nutrition": {
      "Calories": 1842.9,
      "Total fat": 105.73,
      "Saturated fat": 34.32,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 312.89,
      "Sodium": 9321.15,
      "Total carbs": 133.13,
      "Fiber": 19.240000000000002,
      "Sugar": 29.179999999999996,
      "Protein": 95.05000000000001
    }
  },
  {
    "keyword": "Chicken",
    "title": "Elegant Chicken Salad",
    "ingredients": "1/4 c Olive oil, 2 Chicken breasts, 3 c Chicken broth or water, 1/4 c Balsamic vinegar, 2 tb Orange juice, 1 tb Dijon mustard, 1/4 c Chives, 2 tb Tarragon chopped, Salt and pepper, 3 c Rice (wild or white)",
    "servings": "6 Servings",
    "instructions": "Poach chicken in broth or water for about 20 minutes. In salad bowl combine vinegar, juice, and mustard. Gradually whisk in oil. Stir in chives and tarragon and season with salt and pepper. Cut chicken into bite sized pieces. Add chicken and rice to dressing. Toss well.",
    "nutrition": {
      "Calories": 1637.6100000000001,
      "Total fat": 66.63000000000001,
      "Saturated fat": 10.519999999999996,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 218.94,
      "Sodium": 3684.0,
      "Total carbs": 155.82,
      "Fiber": 3.44,
      "Sugar": 15.950000000000001,
      "Protein": 95.01
    }
  },
  {
    "keyword": "Chicken",
    "title": "Elegant Rice and Chicken",
    "ingredients": "2 c Minute rice, 2 c Water, 1 Envelope dry onion soup mix, 6 Chicken breasts - boneless & skinless, Flour, Salt, Paprika, 1 cn Cream of mushroom soup, 1/2 lb Fresh mushrooms\\, 1 tb Butter",
    "servings": "1 Servings",
    "instructions": "Bring water to boil, stir in the dry onion soup mix & then add rice. Turn off heat & let stand. Meanwhile, shake chicken in enough flour, salt & paprika to coat. Fry until golden brown. Put cooked rice mixture in large casserole. Arrange cooked chicken breasts on top. Coverf with the mushroom soup. Top with the mushrooms that have been sauteed in the 1 tablespoon butter. Dust with paprika. Bake uncovered in 350 degree oven for 30 minutes until thoroughly heated.",
    "nutrition": {
      "Calories": 2593.5399999999995,
      "Total fat": 62.199999999999996,
      "Saturated fat": 22.08,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 667.72,
      "Sodium": 4083.0299999999997,
      "Total carbs": 226.82999999999998,
      "Fiber": 7.829999999999999,
      "Sugar": 18.87,
      "Protein": 260.63
    }
  },
  {
    "keyword": "Chicken",
    "title": "Emeril's Cheesy Chicken Shortcake",
    "ingredients": "2 tb Butter, 1 lb Chicken breast skinless, boneless and small diced, ESSENCE, 1 c Minced onions, 1 lb Smoked sausage cut into 1/4-inch slices, Salt, Freshly ground black pepper, 1 tb Chopped garlic, 2 c Heavy cream, 1 ds Worcestershire Sauce, 1 ds Crystal Hot Sauce, 1/4 c Chopped green onions, 8 Cheesy Biscuits see recipe, 1/2 c Grated Parmesan Reggiano cheese",
    "servings": "8 Servings",
    "instructions": "In a large saut\u0082 pan, melt one tablespoon of the butter. Season the chicken with Essence. Add the chicken to the melted butter and quickly saut\u0082 for 2 minutes. Add the remaining butter and melt. Add the onions. Season with salt and pepper. Saut\u0082 the onions for 2 minutes. Add the sausage and continue to saut\u0082 for 2 minutes. Add the garlic and cream. Season the mixture with salt, pepper, Worcestershire Sauce and hot sauce. Bring the liquid to a boil and reduce to a simmer. Simmer the mixture for 4 to 6 minutes, stirring occasionally. Add the green onions. To serve, slice the biscuits in half and spoon the chicken mixture over the top. Garnish with parsley and cheese. NOTES : Air date 3/6/98",
    "nutrition": {
      "Calories": 5879.74,
      "Total fat": 460.37999999999994,
      "Saturated fat": 235.10999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1540.0800000000002,
      "Sodium": 9107.25,
      "Total carbs": 166.41,
      "Fiber": 8.190000000000001,
      "Sugar": 50.92,
      "Protein": 267.90999999999997
    }
  },
  {
    "keyword": "Chicken",
    "title": "Emerilized Chicken Cordon Bleu",
    "ingredients": "2 6-ounce chicken breasts cut in half and pounded into thin scallops, 8 Thin slices of prosciutto, 8 Thin slices of Desoto Cheese (2 inches by 2 inches by 1/4 inch), 1 c Flour, 2 Eggs slightly beaten with 2 tablespoons milk, 1 c Herbed bread crumbs, Oil for sauteeing, Salt and pepper, 1 c Smoked tomato butter sauce hot, recipe follows, 2 c Mashed potatoes hot, 2 tb Chiffonade of basil, 2 tb Grated St. John's Cheese, Essence",
    "servings": "1 Servings",
    "instructions": "For the chicken: Season each side of the chicken scallops with salt and pepper. Lay on scallop flat and layer 2 pieces of the prosciutto, 2 pieces of the Desoto cheese and top with a meat scallop. Carefully dredge the chicken in flour. Dip the chicken in the egg mixture, letting any excess drip off. Finally dredge the chicken in the herb crumbs, coating each side completely. In a saute pan, heat the olive oil. When the pan is smoking hot, add the chicken. Saute for 2 to 3 minutes on each side or until golden brown. Remove from the pan and drain on a paper-lined plate. Season with Essence. Spoon the smoked tomato butter sauce in the center and around the edges of the plate. Mound the potatoes in the center of the sauce. Lay the chicken across the potatoes. Garnish with the basil, grated cheese and Essence. Yield: 2 servings",
    "nutrition": {
      "Calories": 1834.33,
      "Total fat": 76.74999999999999,
      "Saturated fat": 24.25,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 572.12,
      "Sodium": 3518.14,
      "Total carbs": 126.65,
      "Fiber": 10.68,
      "Sugar": 13.83,
      "Protein": 149.85999999999999
    }
  },
  {
    "keyword": "Beef",
    "title": "Ellen's Beef Stew",
    "ingredients": "1 3/4 lb Chuck or round, cubed, 1/3 c Flour, 1/4 ts Pepper, 1/2 ts Salt, 3 tb Oil, 1/2 Onion chopped, 1 cl Garlic minced, 2 3/4 c Boiling water, 28 oz Tomatoes canned, 1/2 ts Salt, 1/2 ts Worcestershire, 1 pn Basil, 1 pn Dill, 1 pn Thyme, 4 md Potatoes quartered, 2 Onions quartered, 1 lb Carrots 2 inch pieces, 1 c Peas",
    "servings": "1 Servings",
    "instructions": "Combine flour, pepper, and salt in bag. Add meat and shake til coated. Heat oil in Dutch oven. Brown meat on all sides. Add onion, garlic, water, tomatoes, salt, and worcestershire. Cover, reduce heat to low and simmer 2 hours, until meat begins to get tender. Add potatoes, onions, and carrots. Cook 30-45 mins, until vegetables are done. Add peas. Cook until heated. By Ellen Cleary",
    "nutrition": {
      "Calories": 3415.2599999999998,
      "Total fat": 101.75000000000001,
      "Saturated fat": 25.93,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 785.86,
      "Sodium": 2503.71,
      "Total carbs": 338.47,
      "Fiber": 60.22,
      "Sugar": 66.97,
      "Protein": 309.05999999999995
    }
  },
  {
    "keyword": "Beef",
    "title": "English Beef Pot Pie",
    "ingredients": "2 lb Beef round steak*, 3 tb Flour, 1 ts Salt, 1/4 ts Pepper, 2 Carrots pared & sliced, 3 Poetatoes peeled & sliced, 1 Onion large thinly sliced, 1 cn Whole tomatoes (16.oz), 1 *****BISCUIT TOPPING******",
    "servings": "4 Servings",
    "instructions": "* cut into 1-inch cubes PLace steak cubes in crock-pot. Combine flour, salt and pepper, toss with steak to coat thoroughly. Stir in remaining ingredients except Biscuit Topping and mix thoroughly. Cover and cook on LOW setting for 7 to 10 hours. One hour before serving, remove meat and vegetables from crock-pot and pour into shallow 2-1/2-quart baking dish. Preheat oven to 425 degrees. Cover meat mixture with Biscuit Topping. Bake for 20 to 25 minutes. 4 servings (about 2-1/2 quarts BISCUIT TOPPING: 2 cups flour, 1 teaspoon salt, 3 teaspoons baking powder, 1/4 cup shortening, 1/4 cup milk. Mix dry ingredients. Cut in shortening until mixture resembles coarse cornmeal. Add milk all at one time; stir well. Pat out on floured board; roll out to cover baking dish.",
    "nutrition": {
      "Calories": 2927.8800000000006,
      "Total fat": 168.89000000000001,
      "Saturated fat": 67.18000000000002,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 867.55,
      "Sodium": 1483.6799999999996,
      "Total carbs": 69.2,
      "Fiber": 7.940000000000001,
      "Sugar": 13.78,
      "Protein": 273.2
    }
  },
  {
    "keyword": "Beef",
    "title": "Fried Beef with Watercress Salad(Bo Luc Lac)",
    "ingredients": "1 lb Beef fillet(500g), 5 Cloves garlic crushed, 1/2 ts Black pepper, 1 1/2 ts Granulated sugar, 3 tb Oil, 1 Large onion, 2 tb Vinegar, 2 tb Salad oil, 1 Watercress (as required)",
    "servings": "4 Servings",
    "instructions": "Cut meat into 3/4\" cubes. Mixwith 2 cloves garlic, 1/2 tsp pepper,1/2 tsp sugar and 1 tbsp oil. Let meat stand in marinade for 1 hour. Cut onion lengthwise into very thin strips. Marinate onion in vinegar, 1/4 tsp salt, 1 tsp sugar, 1/4 tsp pepper and 2 tbsp oil. Rinse watercress, drain well and arrange on a platter. Heat 2 tbsp oil over high heat. Add a pinch of sugar and the remaining garlic. Fry until fragrant. Add meat and stir fry for 2 minutes, until just cooked. Top watercress with meat, then onion mixture.",
    "nutrition": {
      "Calories": 1891.6799999999998,
      "Total fat": 144.64000000000001,
      "Saturated fat": 37.3,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 394.63,
      "Sodium": 248.54,
      "Total carbs": 23.340000000000003,
      "Fiber": 2.57,
      "Sugar": 10.48,
      "Protein": 122.02000000000001
    }
  },
  {
    "keyword": "Beef",
    "title": "Fried Crispy Shredded Beef",
    "ingredients": "4 Eggs, 1/2 ts Salt, 100 g (4 oz) cornflour, 450 g (1 lb) topside of beef, cut into very thin strips, 600 ml Vegetable oil, 3 md Carrots, scraped and cut into julienne strips, 2 Spring onions, cut into 2.5 cm sections, 2 Chillies, shredded, 3 Garlic cloves, crushed, 6 ts Sugar, 2 tb Soy sauce, 4 tb Wine vinegar",
    "servings": "1 Servings",
    "instructions": "1. Mix together the eggs, salt and cornflour and toss the beef in this until well coated. Heat the oil in a wok to 180 degree C or 350 degree F, or until a cube of bread browns in 30 seconds, and stir-fry the beef for 1 1/2 minutes or until crispy. remove and drain on paper towels. 2. Reheat the oil and deep-fry the carrots for 1 1/2 minutes. Remove and drain on paper towels. 3. Pour off most of the oil, leaving about 1 1/2 tablespoons in the bottom of the wok. Reheat, then add the spring onions, chillis and garlic. Stir-fry together for about 30 seconds over the heat then add the sugar , soy sauce and vinegar. Return the meat and carrots to the sauce. toss over the heat and serve. TNT: Imran C.",
    "nutrition": {
      "Calories": 6593.970000000001,
      "Total fat": 645.2199999999998,
      "Saturated fat": 77.79,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1135.5,
      "Sodium": 2644.7200000000003,
      "Total carbs": 54.77,
      "Fiber": 6.72,
      "Sugar": 36.17,
      "Protein": 149.23000000000002
    }
  },
  {
    "keyword": "Beef",
    "title": "Good-For-You Beef Stew (4 Points)",
    "ingredients": "1/4 c All-purpose flour, 1 ts Dried thyme, 1/2 ts Salt, 1/2 ts Pepper, 1 lb Round steak (top)all visible fat removed, cut into 1\" cubes, 1 c Pearl onions fresh or frozen, 1/3 c Red wine, 2 Cloves garlic minced, 1 lb All-purpose potatoes about 2, cut into 3/4\" cubes, about 2 cups, 2 c Fat-free beef broth low sodium, 1 1/2 c Baby carrots frozen (10 Oz.), 2 Bay leaves, 1 c Peas frozen, 1 cn Sliced mushrooms drained",
    "servings": "6 servings",
    "instructions": "Combine flour, thyme, salt and pepper. Add meat; toss to coast. Coat large pot with cooking-spray; place over medium-high heat. Add meat; cook, turning occasionally, with any remaining flour mixture until meat is browned on all sides, about 6-8 minutes. Remove meat from pot; keep warm. To same pot add onions, wine and garlic, scraping up any browned bits; cook 3 minutes. Stir in potatoes, broth, carrots, bay leaves and reserved meat. Increase heat to high; bring to a boil. Reduce heat to medium; simmer, stirring occasionally, 20 minutes. Stir in peas and mushrooms; heat through, about 5 minutes. Remove bay leaves before serving. Serves 6. Per Serving: (Magazine Nutritional Info) 229 calories, 23g protein, 3g fat, 43 mg chol, 27g carbs, 510 mg sodium, 4g fiber. WW Points per serving 4",
    "nutrition": {
      "Calories": 1839.8300000000002,
      "Total fat": 43.110000000000014,
      "Saturated fat": 16.07,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 408.23,
      "Sodium": 1406.2399999999998,
      "Total carbs": 184.26,
      "Fiber": 28.250000000000004,
      "Sugar": 33.03,
      "Protein": 170.55000000000004
    }
  },
  {
    "keyword": "Pork",
    "title": "Empanadas of Pork, Prunes and Apples",
    "ingredients": "6 tb Extra virgin olive oil, 2 lb Boneless pork shoulder in 1/4\" cubes, 1 lg Spanish onion In 1/4\" Dice, 6 Cloves garlic thinly sliced, 2 Red Roma apples peeled and cored and cut into 1/4\" half moons, 8 Pitted prunes cut into quarters, 1/4 c Blanched almonds, 1 ts Cinnamon, 1 tb Fresh thyme leaves chopped, 2 c Dry red wine from Penedes, 1 Empanada dough (see basic recipe)",
    "servings": "4 Servings",
    "instructions": "Egg wash: 1 egg beaten with 1 tablespoon water To make filling: In a large 14inch saute pan, heat oil until smoking. Add pork pieces, onion and garlic and cook until pork is browned and onion has softened. Add apples, prunes, almonds, cinnamon and thyme leaves and continue to cook, about 20 minutes. Add red wine, bring to boil, lower heat and simmer 40 minutes. Check for seasoning and allow to cool. Preheat oven to 375 degrees F. Roll out empanada dough to 1/4inch thick and cut into 8inch circles. Place 4 tablespoons pork filling in each circle and then fold to form half moons. Crimp the closed edges with a fork. Brush with egg wash, puncture top with several holes and bake 25 to 30 minutes, until golden brown. Serve immediately.",
    "nutrition": {
      "Calories": 4752.340000000001,
      "Total fat": 319.77000000000004,
      "Saturated fat": 88.25999999999998,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 816.47,
      "Sodium": 1108.42,
      "Total carbs": 158.27,
      "Fiber": 25.59,
      "Sugar": 77.76,
      "Protein": 232.07999999999998
    }
  },
  {
    "keyword": "Pork",
    "title": "Empanaditas (Pork Turnovers)",
    "ingredients": "8 ts Chilled margarine, 3/4 c All-purpose flour, 3 tb Ice water, 2 oz Cooked ground pork, crumbled (OR finely chopped, Cooked ham), 2 oz Monterey Jack or Cheddar cheese, shredded, 1 ts Prepared spicy brown mustard, 1 ds Crushed red pepper, 1 Egg separated, 1 tb Skim milk",
    "servings": "8 Servings",
    "instructions": "Paprika Garnish: red bell pepper strips and cilantro leaves In small bowl, with pastry blender or 2 knives, cut margarine into flour until mixture resembles corn meal; sprinkle with ice water and, using fork, mix to form soft dough. Roll dough between 2 sheets of wax paper to form rectangle about 1/4 inch thick; remove paper and use 2-inch diameter plain or fluted cookie cutter to cut dough into rounds. Roll scraps of dough and continue cutting until all dough has been used (should yield 24 rounds). Combine pork (or ham), cheese, mustard, and red pepper in small bowl and set aside. Preheat oven to 375. Beat egg white lightly and brush an equal amount onto each pastry round. Spoon an equal amount of the meat mixture (about 1/2 rounded teaspoon) onto center of each round; fold pastry over, turnover-fashion, to enclose filling. Press edges of dough together to seal. Transfer turnovers to nonstick cookie sheet. Add milk to egg yolk and beat lightly; brush an equal amount of mixture over each turnover and sprinkle each with a dash of paprika. Bake until turnovers are golden brown, 15 to 20 minutes. Transfer to warmed serving tray; garnish with red pepper strips and cilantro. Chili sauce or salsa can be served as a dipping sauce. Makes 8 servings of 3 turnovers each.",
    "nutrition": {
      "Calories": 1735.2099999999998,
      "Total fat": 136.20999999999998,
      "Saturated fat": 39.55,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 318.01,
      "Sodium": 707.2099999999999,
      "Total carbs": 76.04,
      "Fiber": 3.2299999999999995,
      "Sugar": 1.8800000000000001,
      "Protein": 51.970000000000006
    }
  },
  {
    "keyword": "Pork",
    "title": "Fresh Pork Pot Roast with Dumplings",
    "ingredients": "1/2 Fresh pork leg or shoulder about 5 lbs., 2 ts Salt, 1/2 ts Dried thyme, 1 lg Bay leaf crushed, Dumplings",
    "servings": "6 Servings",
    "instructions": "Trim excess fat from the meat. Rub meat with mixture of salt, thyme and bayleaf. Refrigerate 2 hours. Brown meat in the fat trimmings in heavy deep pan or Dutch oven. Add water to depth of 2\". Cover, and simmer on top of the range until well done (20 to 25 minutes per pound). Add more water if needed. Remove meat from pan; set aside, keeping it warm. Makes 6 to 8 servings. GRAVY: Skim fat from drippings. Measure 3/4 c. drippings into pan; stir in 1/2 cup flour; cook until bubbly. Stir in 4 c. water to make thin gravy; season with salt and pepper; simmer about 5 minutes. DUMPLINGS: sift together 1 1/2 c. sifted flour, 2 tsp. baking powder, 3/4 tsp. salt and 1/8 tsp. ground sage. Cut in 3 tblsp shortening. Combine 1 egg, slightly beaten, and 2/3 c. milk; stir in dry ingredients until all are moistened. Drop by spoonfuls into boiling gravy. Cover; cook 15 minutes without lifting the lid. Serve with sliced meat and gravy.",
    "nutrition": {
      "Calories": 260.49,
      "Total fat": 13.680000000000001,
      "Saturated fat": 4.85,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 64.58,
      "Sodium": 1474.56,
      "Total carbs": 13.07,
      "Fiber": 0.7,
      "Sugar": 0.53,
      "Protein": 20.179999999999996
    }
  },
  {
    "keyword": "Pork",
    "title": "Fresh Rosemary and Honey Mustard Pork Roast",
    "ingredients": "3/4 c Beer, 1/2 c Dijon mustard, 6 tb Honey, 1/4 c Olive oil, 2 tb Chopped garlic, 2 tb Chopped fresh rosemary, 1 Two-pound boneless pork loin roast, 1/2 c Whipping cream",
    "servings": "4 To 6",
    "instructions": "Whisk first 5 ingredients and 1 tbsp of the rosemary together in a large bowl. Add pork and coat well. Let it marinate for three hours, stirring occasionally. Transfer pork to a plate, and reserve marinade. Position pork in a roasting pan and rub the remaining tbsp rosemary on top. Position pan on an middle rack in the oven. Roast until thermometer inserted into center registers 150× F (about 55 minutes), and reserve juices. Let stand 15 minutes before slicing for a moister roast. In a saucepan, add the reserved juices, marinade and cream. Boil this sauce until it thickens and reduces to about 1-1/2 cups (about 10 minutes). Slice the pork and arrange on plates. Spoon some of the sauce over each portion and serve. You can serve with rice and fresh vegetables. Nutritional Analysis Per Slice (8 to a pie): Calories: 445 Protein: 23g Carbohydrate: 22g Fat: 27g Cholesterol: 103mg Sodium: 210mg",
    "nutrition": {
      "Calories": 3191.3199999999997,
      "Total fat": 181.54000000000002,
      "Saturated fat": 61.099999999999994,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 860.62,
      "Sodium": 3707.5399999999995,
      "Total carbs": 127.54,
      "Fiber": 6.13,
      "Sugar": 108.74000000000001,
      "Protein": 250.40999999999997
    }
  },
  {
    "keyword": "Fish",
    "title": "Elegant and Easy Gourmet Gefilte Fish Pate",
    "ingredients": "--dwigans fwds07a---, 3 lb Fish fillets whitefish, and Pike, 1 1/2 lbs each, 4 md Bermuda onions Peeled and diced about 2#, 3 tb Vegetable or canola oil, 4 lg Eggs, 2 c Cold water, 6 tb Matzah meal, 1 tb Salt or to taste, 2 ts Ground white pepper, 2 tb Sugar, 2 lg Carrots peeled, Parsley for garnish",
    "servings": "20 Servings",
    "instructions": "Grind fish fine. Saute onions in oil till soft but not brown. Put the fish, onions, eggs, water, matzah meal, salt, white pepper, and sugar in a electric mixer bowl and beat on medium speed for 15 minutes. Grate the carrots and mix well. Pour the mixture into a gerased 12 cup bundt pan. Smooth the top with a spatula and bake in a preheated 325 degree oven for 1 hour in a larger pan filled with 2 inches water. Cover with alum foil and continue baking for 1 hour or until the center is solid. Cool for 5 minutes and then invert onto a flat serving plate. Refrigerate for several hours or over night. Slice as you would a torte and serve as an appetizer, garnished with parsley and served with red horseradish.",
    "nutrition": {
      "Calories": 4012.65,
      "Total fat": 65.44,
      "Saturated fat": 13.849999999999998,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 2278.11,
      "Sodium": 8500.84,
      "Total carbs": 390.32,
      "Fiber": 46.43000000000001,
      "Sugar": 158.52,
      "Protein": 464.45
    }
  },
  {
    "keyword": "Fish",
    "title": "Elegant Baked Fish",
    "ingredients": "8 Fish fillets, 1 1/2 c Hellmann's® Mayonnaise, 1 tb Creole mustard, 1 tb Lemon juice, 1 tb Tabasco, 1 tb Worcestershire sauce, 2 ts Garlic powder, 3/4 ts Curry powder, Ritz crackers",
    "servings": "8 Servings",
    "instructions": "Mix well and spread over fish fillets. Sprinkle with crumbled Ritz crackers and bake at 400°F for about 20 minutes uncovered. Fish is done when it flakes easily with a fork.",
    "nutrition": {
      "Calories": 3702.85,
      "Total fat": 260.49999999999994,
      "Saturated fat": 42.02,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1334.53,
      "Sodium": 4286.78,
      "Total carbs": 14.65,
      "Fiber": 2.2,
      "Sugar": 4.600000000000001,
      "Protein": 307.08
    }
  },
  {
    "keyword": "Fish",
    "title": "Fried Catfish",
    "ingredients": "2 lb Catfish cleaned and skinned, 1/2 c Sifted flour, Salt and pepper to taste, 1/2 c Yellow cornmeal, 3 tb Bacon fat or Crisco",
    "servings": "1 Servings",
    "instructions": "Wipe the fish with a damp cloth. Mix the flour, salt, pepper and cornmeal. Roll Mr. Catfish in the mixture and fry in hot bacon fat until golden brown on one side. Then turn and brown the other side. total cooking time about 8 to 10 minutes. \"Thank God for catfish\"!",
    "nutrition": {
      "Calories": 2102.52,
      "Total fat": 106.55000000000001,
      "Saturated fat": 29.89,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 635.51,
      "Sodium": 1455.6899999999998,
      "Total carbs": 94.77,
      "Fiber": 6.21,
      "Sugar": 0.56,
      "Protein": 178.72
    }
  },
  {
    "keyword": "Fish",
    "title": "Fried Catfish #1",
    "ingredients": "4 lb Catfish fillets, 1 c Milk for soaking, 1/2 c Flour, 1 1/2 c Cornmeal, Salt & pepper to taste, 2 ts Crab & shrimp seasoning (commercial or see recipe), Oil for deep- or pan-frying",
    "servings": "4 Servings",
    "instructions": "This is the quickest way I know to enjoy the flavor of catfish. Soaking in milk makes the fish mild in taste and tender in texture. You don't necessarily have to deep-fry this one, though that is the most common method used in the South. I like it pan-fried just as well. It is a completely different dish. Cut the fillets into serving pieces of about 4 ounces each. Soak all the fish in the milk for 1 hour. Mix the flour, cornmeal, salt and pepper, and the crab and shrimp seasoning together. Drain the fish and dredge in the cornmeal mixture. Deep-fry in 375ø oil, a few pieces at a time, until golden brown. Keep pieces warm in a 200ø oven until all is complete, or pan-fry on both sides in a bit of oil or butter until the fish is lightly browned and done to your liking. Do not overcook catfish. Traditionally, deep-fried catfish was served with hushpuppies. I am convinced that you also need a great deal of very cold beer with this catfish fry.",
    "nutrition": {
      "Calories": 3951.58,
      "Total fat": 158.33,
      "Saturated fat": 34.29,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1456.47,
      "Sodium": 3994.0399999999995,
      "Total carbs": 200.51000000000002,
      "Fiber": 15.2,
      "Sugar": 13.7,
      "Protein": 407.3299999999999
    }
  },
  {
    "keyword": "Fish",
    "title": "Fried Catfish #2",
    "ingredients": "2 lb Catfish fillets 1/2 inch thick, 1 ts Garlic powder, 2 ts Salt, 1/2 ts Freshly ground black pepper, 2 c Cracker meal or coarsely crushed unsalted crackers, 1 c Vegetable oil",
    "servings": "4 Servings",
    "instructions": "1. Trim the catfish of any skin or membrane. Stir the garlic powder, salt, and pepper together in a small bowl. Sprinkle the mixture over both sides of the fillets. Dredge the fillets in the cracker meal, pressing gently so the meal sticks to both sides of the fillets. Shake off the excess and set the fillets aside. 2. Heat the oil in a large heavy skillet over a medium heat until a little cracker meal sprinkle in the oil gives off a lively sizzle. Slip the fillets into the skillet and fry, turning once, until the fillets are cooked through and golden brown on both sides, about 8 minutes. Remove and drain on paper towels before serving. MASTERCOOK RECIPES LIST SERVER",
    "nutrition": {
      "Calories": 3790.34,
      "Total fat": 311.03999999999996,
      "Saturated fat": 36.56,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 598.74,
      "Sodium": 3028.4599999999996,
      "Total carbs": 69.19,
      "Fiber": 3.05,
      "Sugar": 8.93,
      "Protein": 175.09
    }
  },
  {
    "keyword": "Shrimp",
    "title": "Elegant Shrimp Artichoke Bake",
    "ingredients": "6 1/2 tb Butter, 4 1/2 tb Flour, 3/4 c Milk, 3/4 c Heavy cream, 1/4 c Dry sherry, Paprika, Salt and pepper to taste, 2 cn Artichoke hearts, 1 1/2 lb Shrimp, cleaned and cooked, 1 tb Worcestershire sauce, 1/4 c Parmesan cheese, 1 lb Fresh mushrooms",
    "servings": "1 Servings",
    "instructions": "Preparation : Arrange cut up artichokes (large pieces) on the bottom of a greased 8 x 12 inch baking dish. Put shrimp on top. Next melt 4 1/2 tablespoons butter in saucepan. Add flour and whisk until smooth. Add milk and cream, salt, pepper, sherry and Worcestershire sauce. Set aside. Saute sliced mushrooms for 6 minutes in 2 tablespoons butter. Place on top of shrimp. Pour cream sauce over the top and sprinkle with Parmesan cheese, paprika at the end. Bake at 350 degrees for 30-45 minutes.",
    "nutrition": {
      "Calories": 2599.11,
      "Total fat": 163.82999999999998,
      "Saturated fat": 98.34,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1870.2699999999998,
      "Sodium": 8448.240000000002,
      "Total carbs": 92.92,
      "Fiber": 14.88,
      "Sugar": 28.650000000000002,
      "Protein": 188.96
    }
  },
  {
    "keyword": "Shrimp",
    "title": "Embassy Shrimp",
    "ingredients": "1/4 c Chopped green onion, 2 tb Minced parsley, 2 tb Butter, 1 lb Shrimp, 1 cn (10 3/4 oz) Cheddar cheese, Soup, 3 md Avocados, Lemon juice, Diced toasted almonds, 1/3 c Cognac, 6 Servings long grain & wild, Rice",
    "servings": "1 Servings",
    "instructions": "Saute' green onion & parsley in butter until tender; stir in shrimp & soup. Cook over low heat 10 minutes, stirring occasionally. Meanwhile, peel & halve avocados; sprinkle with lemon juice. Fill avocado shells with shrimp mixture; sprinkle with almonds. Heat cognac; set aflame & pour over shrimp. Serve with hot cooked rice.",
    "nutrition": {
      "Calories": 2198.81,
      "Total fat": 131.41000000000003,
      "Saturated fat": 36.739999999999995,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1053.88,
      "Sodium": 5305.820000000001,
      "Total carbs": 108.36,
      "Fiber": 45.17,
      "Sugar": 5.97,
      "Protein": 130.23
    }
  },
  {
    "keyword": "Shrimp",
    "title": "Emeril's Baked Spiced Shrimp",
    "ingredients": "2 lb Shrimp, the larger the, Better, shells on, 2 tb Emeril's Creole Seasoning",
    "servings": "4 Servings",
    "instructions": "1. Preheat the oven to 350 F. 2. Place the shrimp in a bowl, sprinkle them with the Creole Seasoning, and rub it into the shells and with your hands. Really do this; if you don't rub it in good you'll get an inferior product! 3. Bake the shrimp on a baking sheet for 5 minutes; turn them over and bake for another 5 minutes. Remove from the oven. Serve warm. : Emeril LaGasse in \"Emeril's New New Orleans Cooking\"",
    "nutrition": {
      "Calories": 1267.94,
      "Total fat": 16.889999999999997,
      "Saturated fat": 5.01,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1914.16,
      "Sodium": 15094.59,
      "Total carbs": 51.01,
      "Fiber": 3.54,
      "Sugar": 0.98,
      "Protein": 213.67
    }
  },
  {
    "keyword": "Shrimp",
    "title": "Emeril's Shrimp and Artichoke Salad",
    "ingredients": "4 Whole artichokes cleaned and stem removed, 4 Lemons cut in half, Water to cover, 3/4 c Extra-virgin olive oil, 1/4 c Balsamic vinegar, 1/4 c Chopped fresh mild herbs see *, 2 ts Minced garlic, Salt, Freshly ground black pepper, 4 Dozen peeled and deveined medium shrimp cooked, 4 c Chiffonade baby greens, 2 tb Grated Parmesan cheese, 1 tb Chopped parsley, 1 Sprig fresh thyme",
    "servings": "4 Servings",
    "instructions": "*fresh mild herbs, such as tarragon, basil, parsley, chervil, etc. In a stock pot, add the artichokes and lemons. Cover with water. Season the water with salt and pepper. Bring the liquid to a boil and reduce to a simmer. Submerge the artichokes in the water by laying a small cloth towel over the artichokes in the pan. Continue to cook for 18 minutes or until tender. Remove the artichokes and place in a bowl of ice water for a couple of minutes or until chilled. Drain and pat dry. In a mixing bowl, whisk the oil, vinegar, herbs and garlic together. Whisk until incorporated. Season with salt and pepper. Season the artichokes with salt and pepper. Toss the greens and shrimp lightly with the vinaigrette. Season with salt and pepper. Hero: Mound a quarter of the greens and shrimp in the center of each artichoke. Garnish the artichokes with the cheese, parsley and thyme sprigs. Yields: 4 servings",
    "nutrition": {
      "Calories": 2237.6400000000003,
      "Total fat": 175.23999999999998,
      "Saturated fat": 25.530000000000005,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 20.23,
      "Sodium": 1322.0400000000002,
      "Total carbs": 162.16,
      "Fiber": 74.42999999999999,
      "Sugar": 27.06,
      "Protein": 49.300000000000004
    }
  },
  {
    "keyword": "Shrimp",
    "title": "Emeril's Shrimp Beignets",
    "ingredients": "1 tb Vegetable oil, 1/2 c Chopped onions, Salt, Cayenne, 1/4 c Brunoise red peppers, 1/4 c Brunoise yellow peppers, 2 tb Chopped garlic, 1/2 c Chopped green onions, 1 lb Medium shrimp peeled, deveined and rough chopped, 3 Eggs beaten, 1 1/2 c Milk, 2 ts Baking powder, 3 1/4 c Flour, 1 ds Worcestershire sauce, 1 ds Crystal hot sauce, Solid vegetable shortening for deep-frying, 1 pn Emeril's creole seasoning",
    "servings": "12 Servings",
    "instructions": "Heat the oil in a skillet over medium-high heat. Add the onions. Season with salt and cayenne. Saute for about 2 minutes, or until slightly wilted. Add the peppers and 1 tablespoon garlic and continue to saute for 1 minute. Season the shrimp with Creole Seasoning. Add the shrimp to the pan and saute for 2 minutes. Stir in 1/4 cup of the green onions. Remove and set aside to cool. Make a batter by combining the beaten eggs, milk and baking powder. Season with salt and pepper. Add the flour, 1/4 cup at a time, beating and incorporating until all is used and the batter is smooth. Add the seafood mixture to the batter and fold to mix. Season with salt and cayenne. Heat the shortening to 360 degrees F. Season with a dash of Worcestershire Sauce and hot sauce. Drop the batter, a heaping tablespoon at a time, into the hot oil. When the beignets pop to the surface, roll them around with a slotted spoon in the oil to brown them evenly. Remove and drain on paper towels. Season the beignets with Essence. Serve the beignets with Remoulade Sauce. Yields: 2 dozen.",
    "nutrition": {
      "Calories": 2801.7000000000003,
      "Total fat": 60.790000000000006,
      "Saturated fat": 18.67,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1551.53,
      "Sodium": 9699.230000000001,
      "Total carbs": 371.2,
      "Fiber": 16.45,
      "Sugar": 31.080000000000002,
      "Protein": 181.29
    }
  },
  {
    "keyword": "Tofu",
    "title": "Golden Tofu Wrap with Warm Asian Slaw",
    "ingredients": "1 tb Peanut oil, 1 lb Low-fat extra-firm tofu OR firm drained and cut into 1-inch cubes, blotted dry, 2 md Garlic cloves minced, 1 sm Jalapeno OR other fresh chile stemmed seeded if desired, minced, 1 1/2 lb Red cabbage shredded as directed, 2 tb Rice wine vinegar, 2 tb Soy sauce, 2 tb Minced fresh cilantro leaves, 4 lg Whole-wheat tortillas (12-inch)",
    "servings": "4 servings",
    "instructions": "INTRO: Golden brown pieces of sauteed tofu are a good foil for a cabbage slaw with Asian seasonings. Serve any extra slaw on the side. For less heat, remove the seeds from the Chile before mincing. 1. Prepare the cabbage. Remove tough outer leaves; quarter. Trim: remove tough white stem/parts. Slice crosswise into very thin strips. 2. Heat 1 tablespoon oil until almost smoking in large nonstick skillet set over medium-high heat. Add tofu and cook, turning pieces every minute or so, until golden brown, about 5 minutes. Transfer tofu to medium bowl. 3. Add garlic and jalapeno to empty skillet and stir-fry over high heat until fragrant, about 20 seconds. Add cabbage and stir-fry until slightly wilted, about 2 minutes. Add vinegar and soy sauce, cover, and cook until cabbage is crisp-tender, about 5 minutes. Stir in cilantro and remove pan from heat. Allow slaw to cool slightly. 4. Meanwhile, heat each tortilla until warm in clean skillet set over medium heat. Lay tortillas flat on work surface. Spread about 3/4 cup slaw down center of each and top with several pieces of tofu. Roll up, tucking sides toward center to form bundle. Slice each roll in half and serve immediately. PER SERVING: 200 calories, 25 percent from fat. 14g protein, 6g fat, 32g carbs, 6g fiber, 672 mg sodium. Good source vitamin C. mc by kitpath 4/27/99",
    "nutrition": {
      "Calories": 1255.2600000000002,
      "Total fat": 54.45,
      "Saturated fat": 14.579999999999998,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 2807.15,
      "Total carbs": 136.33,
      "Fiber": 39.82,
      "Sugar": 32.989999999999995,
      "Protein": 75.54000000000002
    }
  },
  {
    "keyword": "Tofu",
    "title": "Green Peppers And Tofu Sauteed with Miso",
    "ingredients": "3 1/2 tb Red barley, or Hatcho miso, 3 ts Honey, 7 oz Deep-fried tofu *, 1 1/2 ts Minced garlic, 1 lg Onion thinly sliced, 1/2 c Stock or water, 2 ts Sake or white wine, 2 tb Oil, 5 Green peppers **",
    "servings": "2 Servings",
    "instructions": "* Cut into 1/2-inch strips ** Cut lengthwise into sixths Combine the first five ingredients in a saucepan and bring to a boil. Cover and simmer for 5 minutes, then remove from heat. Heat a wok or skillet and coat with the oil. Add garlic and saute for 30 seconds. Increase heat to high, add green peppers and onion, and saute for 3 minutes more. Add deep-fried tofu and any remaining cooking broth, then cook, stirring constantly, for 1 minute. Serve hot or clod.",
    "nutrition": {
      "Calories": 1889.6499999999999,
      "Total fat": 72.0,
      "Saturated fat": 8.4,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 3.6,
      "Sodium": 879.4000000000001,
      "Total carbs": 158.12999999999997,
      "Fiber": 18.35,
      "Sugar": 84.27000000000001,
      "Protein": 52.15000000000001
    }
  },
  {
    "keyword": "Tofu",
    "title": "Mediterranean Tofu Casserole",
    "ingredients": "1 pk Cauldron Original Tofu, 4 oz Aubergine cut into 1/2in/1cm dice, 4 tb Olive oil, 4 oz Onion chopped, 2 ts Garlic crushed, 1/2 Mild green chilli finely chopped, 15 oz Tinned tomatoes chopped, 12 fl White wine, 12 fl Light vegetable stock or water, 1 tb Tomato pur\u0082e, 2 oz Uncooked pasta (e.g. shells), 4 oz Fennel cut into 1/2inch/1cm dice, 4 oz Cauliflower broken into small florets, 4 oz Courgettes cut into 1/2inch/1cm dice, 2 oz Broad beans, 2 oz Pitted black olives quartered, 2 tb Mixed chopped fresh basil and thyme (or 1tsp/5ml dried mixed herbs), Salt",
    "servings": "4 servings",
    "instructions": "1. Drain tofu, cut into 36 pieces. In a non-stick pan, fry tofu and aubergine gently in the oil, until evenly browned. Remove from pan. 2. Add onion to the same pan and cook gently until softened. Add garlic and chilli and cook for a further minute. 3. Add remaining ingredients, and the cooked tofu and aubergine. Simmer gently until pasta and vegetables are just cooked (about 7 minutes). Season to taste.",
    "nutrition": {
      "Calories": 2747.54,
      "Total fat": 70.60000000000001,
      "Saturated fat": 10.629999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 11378.749999999998,
      "Total carbs": 186.45,
      "Fiber": 28.009999999999994,
      "Sugar": 64.41,
      "Protein": 39.97
    }
  },
  {
    "keyword": "Tofu",
    "title": "Hot and Sour Garlic Chive Soup with Tofu",
    "ingredients": "2 md Carrots sliced, 1/4 c Fresh garlic chives minced, 3 Fresh lovage or celery leaves, 3 Romaine lettuce or Swiss chard leaves torn into pieces, 4 Dried cloud ear or shiitake mushrooms, 1 6 inch piece dried arame, dulse, or tombu seaweed, (package), 1 sm Fresh or dried hot red pepper, 2 tb Rice wine vinegar, 1 qt Water, 1 c Dry white wine, 1 ts Dark sesame oil, 1/2 lb Firm tofu cut into 1/2-inch, Pieces, 2 tb Rice or barley miso sauce, Garlic chive leaves for garnish, Garlic chive flowers for garnish",
    "servings": "4 Servings",
    "instructions": "In a large heavy pot, combine all the ingredients above the line. Bring to a boil, then cover, lower the heat to medium-low, and simmer for 30 minutes. Remove the mushrooms and slice thinly, discarding the tough portions. Strain the broth and return it to the pan. Add the tofu and mushrooms and simmer for 5 minutes. Dissolve the miso in a small amount of the broth, stir it into the soup, then immediately remove the pot from the heat. Garnish with minced garlic chive leaves and serve at once. flavored vegetable broth. Strain the broth and return mushrooms to pot. = Then add tofu, Chinese chives, and agar (a thickener made from seaweed).=20 Quick soup: check the import section of the grocery. Buy 1 envelop= (or box) Japanese Miso with Mushroom. Make according to package directions.= Taste and add red pepper flakes and a little rice vinegar to taste. Add= tofu and heat through. The packaged soup contains the agar to thicken the= broth. Do add Chinese chive. (I've used society garlic - well cleaned.)",
    "nutrition": {
      "Calories": 978.0700000000002,
      "Total fat": 34.25000000000001,
      "Saturated fat": 4.940000000000001,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.34,
      "Sodium": 949.0900000000001,
      "Total carbs": 101.12999999999998,
      "Fiber": 21.909999999999997,
      "Sugar": 20.910000000000004,
      "Protein": 38.08
    }
  },
  {
    "keyword": "Tofu",
    "title": "Chicken, Tofu, and Vegetable Stir-Fry",
    "ingredients": "1 tb Vegetable oil, 1/2 lb Skinned and boned chicken breasts cut in bite size pcs, 1 c Sliced carrot 1/2 inch thick, 2 c Cubed zucchini, 1 1/4 c Quartered mushrooms, 1 c Cubed red bell pepper 3/4 inch cubes, 1/2 lb Firm tofu drained, cut into 1 inch cubes, 2/3 c Oyster sauce, 6 c Hot cooked rice",
    "servings": "6 Servings",
    "instructions": "1. Heat oil in a large nonstick skillet over medium-high heat. Add chicken; stir-fry 3 minutes or until browned. Add carrot; stir-fry 3 minutes. Gently stir in tofu and oyster sauce; cook until thoroughly heated. Serve over rice. Yield: 6 servings (serving size: 1 cup stir-fry and 1 cup rice). Points: 7; Exchanges 1 lean meat, 3 1/2 starch, 1 vegetable. Per serving: CAL 348 (13 % from fat); PRO 16.9 g; FAT 5 g (SAT 0.8 g); CARB 59.2 g; FIB 2.8 g; CHOL 22 mg; IRON 4.8 mg; SOD 854 mg; CALC 78 mg.",
    "nutrition": {
      "Calories": 2570.8,
      "Total fat": 47.09,
      "Saturated fat": 8.840000000000002,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 385.55,
      "Sodium": 5731.31,
      "Total carbs": 329.78000000000003,
      "Fiber": 19.54,
      "Sugar": 22.29,
      "Protein": 200.64
    }
  },
  {
    "keyword": "Egg",
    "title": "Ella's Vegetable and Meat Egg Rolls",
    "ingredients": "1 lb Ground beef, 3 Stalks celery chopped, 5 Green onions chopped, 1 cn Bean sprouts washed and drained, 1 cn Waterchestnuts chopped, 2 tb Oil, 1 ts Salt, 2 tb Sugar, 1/4 c Soy sauce, 2 ts Cornstarch, 1 tb Cold water, 7 Egg roll wrappers cut in half, Mustard, Ketchup",
    "servings": "14 Servings",
    "instructions": "Fry ground beef, drain, set aside for now. Heat wok, add oil, heat until hot, but not smoking, put celery, onions, bean sprouts and waterchestnuts. fry 2 minutes. Add salt, sugar, and soy sauce, cook 1 minute more. Add ground beef and mix well. Mix cornstarch and water well. Add to mixture in wok. set aside and cool. When cool add to egg roll wrappers, wrapping diagonaly then fry in deep fat for 3 to 5 minutes. Serve with a mixture of mustard and ketchup. Did egg rolls in this. Use 7 egg roll wrappers and cut in half and this will make 15 egg rolls. NOTES : Very good.",
    "nutrition": {
      "Calories": 2534.28,
      "Total fat": 111.12,
      "Saturated fat": 32.290000000000006,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 423.86,
      "Sodium": 6107.249999999999,
      "Total carbs": 222.24,
      "Fiber": 13.290000000000001,
      "Sugar": 42.839999999999996,
      "Protein": 156.48
    }
  },
  {
    "keyword": "Egg",
    "title": "Emeril's Beggar Purses Wrapped in a Truffle Crepe",
    "ingredients": "1 1/2 c Milk, 1 c Truffle flour, 2 Eggs, Salt to taste, Freshly-ground white pepper to taste, 2 tb Olive oil, 12 Quail eggs, 12 lg Fresh scallops cleaned, 1 c Truffle Mashed Potatoes hot, see * Note, 12 Whole Chives, 1 Recipe Truffle Salsify Relish, 1 Recipe Spinach And Black Truffle Reduction hot, see * Note, Chopped fresh parsley for garnish",
    "servings": "4 Servings",
    "instructions": "* Note: See the \"Truffle Mashed Potatoes\", \"Truffle Salsify Relish\", and \"Spinach And Black Truffle Reduction\" recipes which are included in this collection. For the crepes: In a mixing bowl, combine the milk, truffle flour, and eggs together. Whisk until smooth. Season the batter with salt and white pepper. Heat a lightly-greased 6-inch pan. Remove from the heat and add 2 tablespoons of the batter. Lift and tilt the pan to spread the batter evenly. Return to the heat; brown on one side only. Flip the crepe, remove from the pan onto parchment paper. Crack the quail eggs into individual ramekins. In a non-stick pan, heat 1 tablespoon of olive oil. When the oil is hot, carefully slide the ramekins with the quail eggs, into the pan. Season the eggs with salt and pepper. Fry the eggs for about 1 minute and remove from the pan and set aside. Season the scallops with salt and pepper. In a large saute pan, heat 1 tablespoon of olive oil. When the oil is hot, add the scallops and sear for 2 to 3 minutes on each side. Remove the scallops and set aside. Place the scallops in the center of each crepe. Place a tablespoon of the Truffle Mashed Potatoes on top of the scallops. Lay a fried quail egg on top of the mashed potatoes. Pull the edges of the crepe together and tie with a long chive, forming a purse-like shape. To serve, spoon the Spinach And Black Truffle Reduction sauce in the center of four plates. Place three scallop purees in the center of the sauce. Spoon the Truffle Salsify Relish around the scallops. Garnish with parsley. This recipe yields 4 main course servings or 12 appetizer servings. Comments: The original recipe title as listed is \"Emeril's Beggar Purses Consisting Of Seared Scallops, Truffle Mash, And Fried Quail Eggs Wrapped In A Truffle Crepe\".",
    "nutrition": {
      "Calories": 4122.03,
      "Total fat": 221.76999999999995,
      "Saturated fat": 101.43000000000002,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1614.6399999999999,
      "Sodium": 3371.4399999999996,
      "Total carbs": 404.66,
      "Fiber": 28.86,
      "Sugar": 211.35000000000002,
      "Protein": 128.0
    }
  },
  {
    "keyword": "Egg",
    "title": "Emeril's Crab Meat Deviled Eggs",
    "ingredients": "1 Dozen hard boiled eggs shelled and cut into half, 1/4 c Mayonnaise, 1/2 lb Lump crab meat shelled and picked for cartilage, 1 ts Minced garlic, 1 tb Minced capers, 2 tb Caper juice, Salt, Freshly ground white pepper, 1 tb Finely chopped fresh parsley leaves",
    "servings": "1 Servings",
    "instructions": "Remove the yolks from the whites and place in a mixing bowl. Using the back of a fork, break the yolks into small pieces. Add the mayonnaise, crab meat, garlic, capers and caper juice. Mix well. Season the mixture with salt and pepper. Spoon the mixture into the white halves. Chill the eggs completely and garnish with parsley. Yields: 2 dozen eggs What else could Emeril Lagasse cook up for Easter besides some delicious eggs?",
    "nutrition": {
      "Calories": 2388.83,
      "Total fat": 189.38,
      "Saturated fat": 39.49000000000001,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 2527.42,
      "Sodium": 4023.94,
      "Total carbs": 42.93,
      "Fiber": 1.8800000000000003,
      "Sugar": 36.53,
      "Protein": 119.08000000000001
    }
  },
  {
    "keyword": "Egg",
    "title": "English Muffin W/ham Egg",
    "ingredients": "6 1/4 lb HAM SECTIONED CURED, 6 1/4 lb CHEESE AMER/SLICE, 100 EGGS SHELL, 100 BREAD ENG MFFN 12OZ #95",
    "servings": "100 Servings",
    "instructions": "YIELD: 100 PORTIONS (6 PANS) EACH PORTION: 1 SANDWICH PAN SIZE: 18 BY 26-INCH SHEET PAN TEMPERATURE: 375 F. OVEN 325 F. GRIDDLE 1. GRILL HAM UNTIL LIGHLY BROWNED. USE IN STEP 4. 2. PLACE ENGLISH MUFFIN HALVES ON SHEET PANS IN ROWS, 5 BY 7 ; TOAST 6 TO 8 MINUTES IN OVEN. SET ASIDE FOR USE IN STEP 6. 3. BREAK ONE EGG AT A TIME IN SMALL BOWL; POUR ON GREASED GRIDDLE. FRY 2 MINUTES; TURN. 4. PLACE I SLICE HAM ON EGG. 5. PLACE 1 SLICE CHEESE ON HAM. CONTINUE TO COOK UNTIL CHEESE MELTS. 6. PLACE I CHEESE AND HAM TOPPED FRIED EGG ON BOTTOM HALF OF EACH SPLIT MUFFIN. TOP WITH SECOND HALF OF MUFFIN. SERVE IMMEDIATELY. NOTE: 1. IN STEP 2, ONE RECIPE ENGLISH MUFFINS (RECIPE NO. D-21) MAY BE USED. SERVING SIZE: 1 SANDWICH",
    "nutrition": {
      "Calories": 30423.68,
      "Total fat": 1661.95,
      "Saturated fat": 738.5199999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 23220.97,
      "Sodium": 67520.73000000001,
      "Total carbs": 1619.23,
      "Fiber": 80.19,
      "Sugar": 227.18,
      "Protein": 2167.8799999999997
    }
  },
  {
    "keyword": "Egg",
    "title": "Fresh Mushrooms with Eggplant and Tomato",
    "ingredients": "1 lb Eggplant, Salt, 3 tb Olive oil, 1 md Onion, chopped, 1 lg Celery stalk, chopped, 2 md Firm mushrooms, chopped, 1 1/2 ts Garlic, chopped, 1 lg Tomato, chopped, 2 tb Breadcrumbs, 1 tb Tomato paste, 5 tb Fresh parsley, chopped, 1 ts Basil, Fresh lemon juice, 30 md Whole mushrooms",
    "servings": "6 Servings",
    "instructions": "Cut eggplant in half lengthwise. Make crisscross patterns in the pulp & sprinkle with salt. Let stand for 3o minutes. Rinse thoroughly & drain well, drying with paper towels. Peel & coarsely chop. Heat 2 tb oil in a skillet over a medium heat. Cook eggplant till softened. Let cool. Heat remining oil & cook onion, celery, choped mushrooms & garlic for 4 minutes. Add tomatoes & return eggplant to skillet. Stir in breadcrumbs, tomato paste & 3 tb parsley. Add basil. Continue to cook for 4 minutes. Just before serving, wipe mushrooms with cloth dampened in lemon juice. Carefully remove the stems. Fill each cap with some of the eggplant mixture. Sprinkle with remaining parsley & serve. You can serve the mushrooms hot by baking briefly until watm & then sprinkling with parsley. Joel Rapp, \"Mother Earth's Vegetarian Feasts\"",
    "nutrition": {
      "Calories": 828.1999999999999,
      "Total fat": 45.4,
      "Saturated fat": 6.399999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 757.6000000000001,
      "Total carbs": 107.75,
      "Fiber": 25.960000000000008,
      "Sugar": 40.89,
      "Protein": 18.95
    }
  },
  {
    "keyword": "Cheese",
    "title": "Elizebeth's Cheese Biscuits",
    "ingredients": "2 c Unbleached all-purpose flour, 1/3 c Nonfat dry milk powder, 3 tb Grated white cheddar cheese (preferably raw milk), 2 1/2 tb Wheat germ, 2 tb Grated mozzarella cheese, 2 tb Grated Emmenthal cheese, 1 tb Baking powder, 1 ts Salt, 1/2 c (1 cup) well-chilled butter, cut into 8 pieces, 1 c Cold water",
    "servings": "20 Servings",
    "instructions": "Makes about 20 Preheat oven to 350 F. Lightly butter 2 baking sheets. Combine all ingredients except butter and water in large bowl of heavy-duty electric mixer. Using paddle attachment, cut in butter until mixture resembles coarse meal. Slowly pour in water, beating until dough just comes together. Turn out onto lightly floured surface and pat to 3/4-inch thickness. Cut into 2 1/2 inch squares using floured knife. Arrange on prepared sheets, spacing 1 inch apart. Bake until light brown, about 15 minutes. Serve immediately. (Dough can also be made by hand.) Bon Appetit",
    "nutrition": {
      "Calories": 2888.31,
      "Total fat": 204.44,
      "Saturated fat": 126.52,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 541.3199999999999,
      "Sodium": 3983.55,
      "Total carbs": 217.39999999999998,
      "Fiber": 9.15,
      "Sugar": 13.0,
      "Protein": 51.739999999999995
    }
  },
  {
    "keyword": "Cheese",
    "title": "Ellen's Cheese Cake",
    "ingredients": "1 1/2 c Graham cracker crumbs, 2 tb Sugar, 1/2 Stick butter, melted, 1 lb Cream cheese, softened, 1 c Sugar, 5 Eggs, separated, 1 pt Sour cream, 1 ts Vanilla, 1/2 ts Lemon extract",
    "servings": "1 Servings",
    "instructions": "CRUST: Mix together crumbs, sugar, and butter. Press into a 9\" spring pan FILLING: Cream together cream cheese and sugar. Add 1 egg yolk at a time, then add sour cream and extracts. Beat egg whites stiffly and fold into mixture. Bake in a 325 degree pre-heated oven for 1 hour. Turn oven off and leave cake in the oven another hour. Open oven door and leave cake in oven a half hour longer. Remove from oven and cool.",
    "nutrition": {
      "Calories": 3857.1500000000005,
      "Total fat": 242.71,
      "Saturated fat": 131.98,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1516.69,
      "Sodium": 2779.8,
      "Total carbs": 360.78,
      "Fiber": 4.67,
      "Sugar": 278.82,
      "Protein": 69.26
    }
  },
  {
    "keyword": "Cheese",
    "title": "Elote Con Crema (Fresh Corn With Cream, Chiles, and Cheese",
    "ingredients": "1/4 c Butter, 1/2 md Onion finely chopped, 1 Clove garlic peeled and chopped, 5 Chiles Poblanos roasted and peeled, 4 c Corn (see note), 1/4 lb Mild Cheddar cheese in small cubes, 1 ts Salt, Thick sour cream see recipe",
    "servings": "6 Servings",
    "instructions": "Elote Con Crema (Fresh Corn With Cream, Chiles, & Cheese) Again, there are so many variations of corn-chile-cream dishes that is is hard to know just which recipe to choose. For a change, the chiles could be left whole, stuffed with corn and cheese, and cooked in cream. But this combination is delicious any way. This is a very rich dish, and is very good served as a separate course with hot tortillas. It is best eaten right after it's cooked, as the cheese gets tough when reheated. Preheat the oven to 350 degrees F. Melt the butter and cook the onion and garlic, without browning, until they are soft. Cut the chiles into rajas (strips), add them to the pan, and cook them, covered, 8 minutes. Add the corn, heese, and salt to the chile mixture. Cover tightly with foil or a lid and let it bake for 20 minutes for frozen corn. If you use fresh corn, cook for 40 minutes, adding the cheese after the first 20 minutes of cooking time. Serve the vegetables hot, with the sour cream.",
    "nutrition": {
      "Calories": 1589.0800000000002,
      "Total fat": 96.28999999999999,
      "Saturated fat": 53.08,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 241.41,
      "Sodium": 1720.6899999999998,
      "Total carbs": 157.68,
      "Fiber": 19.490000000000002,
      "Sugar": 43.76,
      "Protein": 52.61
    }
  },
  {
    "keyword": "Cheese",
    "title": "Emerald Cheese Dreams",
    "ingredients": "1 pk (8 oz) cream cheese at room temperature, 1/4 c Sweet butter at room temperature, 1/4 c Creme' de menthe, 1/2 c Shelled pistachios chopped",
    "servings": "1 Servings",
    "instructions": "comment: an unusal but delicious appetizer very rich! Blend the cheese and butter well. Blend in the creme de menthe until smooth. . chill well in refrigerator. Roll mixture into tiny balls and roll into the chopped pistachioes.Place in the tiny colored paper candy cups and chill well. servings depend on how large the balls are.",
    "nutrition": {
      "Calories": 761.87,
      "Total fat": 56.56,
      "Saturated fat": 35.07,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 151.35999999999999,
      "Sodium": 462.48,
      "Total carbs": 29.78,
      "Fiber": 0.07,
      "Sugar": 29.130000000000003,
      "Protein": 2.4099999999999997
    }
  },
  {
    "keyword": "Cheese",
    "title": "Emeril's Cigars with Corn and Cheese Queso Sauce",
    "ingredients": "Vegetable oil for frying, 2 tb Olive oil, 1 1/2 lb Beef tenderloin trimmed and cut into thin strips, Salt, Cayenne, 1 c Chopped onions, 1 c Chopped tomatoes peeled and seeded, 2 tb Plus 1 teaspoon chopped garlic, 18 sm Flour tortillas, 2 ts Emeril's Creole Seasoning see recipe, 1 Recipe Corn and Cheese Queso Sauce see recipe, 1 c Guacamole, 1 c Salsa",
    "servings": "1 Servings",
    "instructions": "Preheat the vegetable oil to 360 degrees F in a large pan. In a large saut\u0082 pan, heat the olive oil. Season the beef with salt and cayenne. Sear the beef for 1 to 2 minutes. Add the onions and saut\u0082 for 2 minutes. Add the garlic and tomatoes. Season with salt and cayenne. Saut\u0082 for 1 minute. Remove from the heat. Season with salt and pepper. Spoon a couple of tablespoons of the filling in the center of each tortilla. Spread the filling evenly in the center of each tortilla. Roll up each tortilla tightly and secure with toothpicks, making each into a flautta. Fry the flauttas in batches until golden brown, about 3 minutes. Remove the flauttas from the oil and drain on a paper-lined plate. Season the flauttas with Emeril's Creole Seasoning. Continue frying until all the flauttas are fried. To assemble into a hero, spoon the queso on the bottom of a large platter. Arrange the flauttas over the sauce. Garnish with the guacamole and salsa. Yields: 6 servings. Air date on GMA 1/23/98",
    "nutrition": {
      "Calories": 6397.73,
      "Total fat": 322.98999999999995,
      "Saturated fat": 100.1,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 626.8000000000001,
      "Sodium": 15813.090000000002,
      "Total carbs": 604.59,
      "Fiber": 61.28,
      "Sugar": 41.17,
      "Protein": 270.05999999999995
    }
  },
  {
    "keyword": "Tomato",
    "title": "Endive with Tomato Rosettes",
    "ingredients": "6 Medium-sized heads belgiam e, 1 8-oz. package cream cheese (, 3 tb Milk, 2 oz Dried tomatoes, in oil (chop, Basil leaves or watercress s, Flower for garnish",
    "servings": "1 Servings",
    "instructions": "Calories per serving: 30 Fat grams per serving: 3 Approx. Cook Time: Cholesterol per serving: 7 ABOUT 30 MINUTES BEFORE SERVING OR EARLY IN DAY: Separate leaves from heads of Belgiam endive (you should be able to get 6 pretty leaves from each endive). Reserve small leaves and centers for salad another day. Rinse leaves under running cold water; pat dry with paper towels. In small bowl, with mixer at medium speed, beat cream cheese until smooth. Gradually beat in milk until blended. With spoon, stir in chopped dried tomatoes. Spoon cream-cheese filling into decorating bag with large rosette tube. Place a basil leaf or small watercress sprig on each endive leaf. Pipe some filling onto basil on wide end of each endive leaf. Arrange endive leaves on platter; garnish platter with flower. Cover and refrigerate until ready to serve. MAKES 3 DOZEN HORS D'OEUVRES",
    "nutrition": {
      "Calories": 954.51,
      "Total fat": 93.16,
      "Saturated fat": 47.36,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 232.73,
      "Sodium": 750.45,
      "Total carbs": 17.380000000000003,
      "Fiber": 0.8600000000000001,
      "Sugar": 12.4,
      "Protein": 16.759999999999998
    }
  },
  {
    "keyword": "Tomato",
    "title": "English Muffin W/ham, Tomatoes and Pesto",
    "ingredients": "1 Stick butter, 8 oz Cream cheese, 1 Clove garlic minced, 6 English muffins halved, 12 sl Deli baked ham cut to fit muffin halves, 12 sl Tomato, 4 tb PESTO:, 4 c Fresh basil leaves washed and stripped from stems, 4 Cloves garlic, 1/4 c Olive oil, 1/4 c Pine nuts, 1 c Freshly grated Parmesan cheese",
    "servings": "6 Servings",
    "instructions": "Place the muffin halves on a baking sheet. Spead each with a portion of the cheese mixture. Then top each muffin with a slice of ham and a slice of tomato. Spread pesto on top of each tomato, using about 1 tsp. per tomato. Place a dollop of the cream cheese mixture on top of that and bake at 400 degrees for about 20 mintes or unil the cheese has melted and is slightly browned. Pesto: Blend until a paste forms...you may have to shove it down with a spatula several times in the blender container. A food processor does not do this as well as a blender! Freeze and cut into 1\" cubes any left over pesto and serve with pasta. MASTERCOOK RECIPES LIST SERVER",
    "nutrition": {
      "Calories": 5636.920000000001,
      "Total fat": 352.07,
      "Saturated fat": 141.07999999999998,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1236.1200000000001,
      "Sodium": 15076.189999999999,
      "Total carbs": 320.46000000000004,
      "Fiber": 31.67,
      "Sugar": 95.52,
      "Protein": 320.3
    }
  },
  {
    "keyword": "Tomato",
    "title": "English Muffin with Ham, Tomatoes, and Pesto",
    "ingredients": "1 Stick Butter, 8 oz Cream Cheese, 1 Clove Garlic, minced, 6 English Muffins halved, 12 sl Deli Baked Ham, Cut To Fit Muffin Halves, 12 sl Tomato, 4 tb Pesto * see recipe below",
    "servings": "1 Servings",
    "instructions": "Remove butter and cream cheese from fridge and allow to soften. Cream together until fluffy. Blend in minced garlic. Place the muffin halves on a baking sheet. Spead each with a portion of the cheese mixture. Then top each muffin with a slice of ham and a slice of tomato. Spread pesto on top of each tomato, using about 1 tsp. per tomato. Place a dollop of the cream cheese mixture on top of that and bake at 400 degrees for about 20 mintes or unil the cheese has melted and is slightly browned. *Pesto: 4 cups fresh basil leaves, washed and stripped from stems 4 cloves of garlic 1/4 c olive oil 1/4 c pine nuts 1 cup freshly grated parmesan cheese. Blend until a paste forms...you may have to shove it down with a spatula several times in the blender container. A food processor does not do this as well as a blender! Freeze and cut into 1\" cubes any left over pesto and serve with pasta.",
    "nutrition": {
      "Calories": 4782.750000000001,
      "Total fat": 272.76,
      "Saturated fat": 122.53999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1158.72,
      "Sodium": 13824.899999999998,
      "Total carbs": 305.38000000000005,
      "Fiber": 29.37,
      "Sugar": 97.80999999999999,
      "Protein": 291.92
    }
  },
  {
    "keyword": "Tomato",
    "title": "Fresh Mozzarella Tomato Salad",
    "ingredients": "1 lb Fresh Mozzarella 2 balls, 2 Beefsteak Tomatoes, 1 Red Onion, 1 c Basil Leaves Loosely Packed, 1/3 c Extra Virgin Olive Oil, Salt And Pepper",
    "servings": "4 Servings",
    "instructions": "Cut each ball of mozzarella into 6 slices. Cut each tomato slice into 6 slices. Thinly slice the red onion and separate into rings. Shred the basil leaves. Alternate slices of tomato and basil on a serving platter. Scatter the onion rings and basil over them. Drizzle the olive oil over the salad. Season with salt and pepper to taste and serve.",
    "nutrition": {
      "Calories": 1849.34,
      "Total fat": 154.66,
      "Saturated fat": 58.379999999999995,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 290.71,
      "Sodium": 2630.0099999999993,
      "Total carbs": 32.82,
      "Fiber": 6.290000000000001,
      "Sugar": 17.91,
      "Protein": 87.14
    }
  },
  {
    "keyword": "Tomato",
    "title": "Fresh Mushrooms with Eggplant and Tomato",
    "ingredients": "1 lb Eggplant, Salt, 3 tb Olive oil, 1 md Onion, chopped, 1 lg Celery stalk, chopped, 2 md Firm mushrooms, chopped, 1 1/2 ts Garlic, chopped, 1 lg Tomato, chopped, 2 tb Breadcrumbs, 1 tb Tomato paste, 5 tb Fresh parsley, chopped, 1 ts Basil, Fresh lemon juice, 30 md Whole mushrooms",
    "servings": "6 Servings",
    "instructions": "Cut eggplant in half lengthwise. Make crisscross patterns in the pulp & sprinkle with salt. Let stand for 3o minutes. Rinse thoroughly & drain well, drying with paper towels. Peel & coarsely chop. Heat 2 tb oil in a skillet over a medium heat. Cook eggplant till softened. Let cool. Heat remining oil & cook onion, celery, choped mushrooms & garlic for 4 minutes. Add tomatoes & return eggplant to skillet. Stir in breadcrumbs, tomato paste & 3 tb parsley. Add basil. Continue to cook for 4 minutes. Just before serving, wipe mushrooms with cloth dampened in lemon juice. Carefully remove the stems. Fill each cap with some of the eggplant mixture. Sprinkle with remaining parsley & serve. You can serve the mushrooms hot by baking briefly until watm & then sprinkling with parsley. Joel Rapp, \"Mother Earth's Vegetarian Feasts\"",
    "nutrition": {
      "Calories": 828.1999999999999,
      "Total fat": 45.4,
      "Saturated fat": 6.399999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 757.6000000000001,
      "Total carbs": 107.75,
      "Fiber": 25.960000000000008,
      "Sugar": 40.89,
      "Protein": 18.95
    }
  },
  {
    "keyword": "Onion",
    "title": "Electronic Gourmet's French Onion Soup",
    "ingredients": "1 1/2 lb Yellow Onions, thinly sliced, (about 5 cups), 3 tb Butter, 1 tb Oil, 1 ts Salt, 1/4 ts Sugar, 3 tb Flour, 8 c Boiling Brown Stock, 1/2 c Dry White Wine or Vermouth, 3 tb Cognac, Rounds of Hard Toasted Bread, 2 c Swiss Cheese, grated",
    "servings": "6 Servings",
    "instructions": "1) Cook the onions slowly with the butter and oil in a covered saucepan for 15 minutes. 2) Uncover, raise the heat to moderate and stir in the salt and sugar. Cook for 30 to 40 minutes stirring frequently until the onions have turned and even, deep golden brown. 3) Sprinkle in the flour and stir 3 minutes. 4) Off heat, blend in the boiling liquid. Note that instead of brown stock you may use canned beef bouillon (same quantity). Or, and equal part of boiling water plus stock or bouillon. 5) Add the wine and season to taste. Simmer partially covered for 30 to 40 minutes or more, skimming occasionally. Correct Seasoning. 6) Set aside uncovered until ready to serve, then reheat to simmer. 7) Just before serving, stir in the cognac. Pour into french onion soup bowls over the rounds of bread. Cover with cheese. Bake at 350 F until cheese melts.",
    "nutrition": {
      "Calories": 3956.2999999999993,
      "Total fat": 286.51,
      "Saturated fat": 160.6,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 738.77,
      "Sodium": 5292.660000000001,
      "Total carbs": 178.46,
      "Fiber": 10.8,
      "Sugar": 68.55,
      "Protein": 128.68
    }
  },
  {
    "keyword": "Onion",
    "title": "Emeril's Onion Soup",
    "ingredients": "3 tb Unsalted butter, 4 c Yellow julienned, Salt, Freshly ground black pepper, 1 tb Chopped garlic, 1 ds Dry sherry, 1 ds Worcestershire sauce, 8 c Beef stock, 8 sl Toasted french bread (about 1-inch thick), 2 c Duck rillette recipe follows, 8 sl Gruyere cheese, 2 ts Chopped fresh parsley leaves",
    "servings": "8 Servings",
    "instructions": "Preheat the oven to 400 degrees F. In a large saucepan, over medium-heat, melt the butter. Add the onions. Season with salt and pepper. Sauté the onions until slightly caramelized, about 8 to 10 minutes. Add the garlic, sherry, Worcestershire sauce and stock. Season with salt and pepper. Bring the liquid to a boil and reduce to a simmer. Cook the soup for 15 minutes. Ladle the soup into oven-proof deep bowls. Spread the each piece of bread with 1/4 cup of the rillette. Float the croutons on top of the soup. Cover each crouton with a piece of cheese. Sprinkle the cheese with parsley. Place the bowls on a sheet pan and place in the oven. Bake until the cheese is bubbly and golden, about 6 to 8 minutes. Remove from the oven and serve. Yield: 8 servings",
    "nutrition": {
      "Calories": 5839.18,
      "Total fat": 400.09,
      "Saturated fat": 213.85,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1277.15,
      "Sodium": 418187.52,
      "Total carbs": 176.52,
      "Fiber": 8.04,
      "Sugar": 23.959999999999997,
      "Protein": 379.54
    }
  },
  {
    "keyword": "Onion",
    "title": "Endive, Beet and Red-Onion Salad",
    "ingredients": "1/2 lb Raw Beets, trimmed, 3 Heads of Belgian Endives, md, 1 Red onion, 1 tb Dijon Mustard, 1 tb Red Wine Vinegar, 3 tb Vegetable oil, 4 tb Finely Chopped Parsley",
    "servings": "4 Servings",
    "instructions": "Place the beets in a saucepan and add water to cover with salt. Bring to a boil until the beets are tender, about 30 minutes, depending on the size or age of the beets. Drain and let cool. Remove the skins and slice the beets. Trim off the bottom of the endives and cut them into 1 1/2 inch strips. Drop the pieces into cold water. Drain and pat dry. Peel and slice the onion. Combine the mustard, vinegar, salt and pepper in a salad bowl. Add the oil and blend well with a wire whisk. Add the beets, endive, onion and parsley. Toss well and serve. Serves 4. From The Gazette 90/12/12.",
    "nutrition": {
      "Calories": 543.5600000000001,
      "Total fat": 42.099999999999994,
      "Saturated fat": 3.21,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 597.6700000000001,
      "Total carbs": 39.489999999999995,
      "Fiber": 13.719999999999999,
      "Sugar": 20.05,
      "Protein": 7.4
    }
  },
  {
    "keyword": "Onion",
    "title": "Fresh Sweet Onion Rings with Basil",
    "ingredients": "1 lg Walla Walla Sweet Onion, 1/2 c Seasoned Rice Vinegar, or, 1/2 c Rice Vinegar with, 1 ts Sugar, 1 tb Fresh Basil, chopped, 1/8 ts Dried Crushed Red Pepper, Flakes, 1 c Small Ice Cubes, Salt",
    "servings": "6 Servings",
    "instructions": "Cut the onion crosswise into 1/4\" thick slices, seperate into rings. In a bowl, combine the onion rings, vinegar, basil, chili lfakes and ice; cover and chill 10-15 minutes, stirring occasionally. The ice will begin to melt, diluting the vinegar to an appropriate level. Serve, adding salt to taste. Calories: 23, Protein: 1g, Fat: .09g, Cholesterol: 5.5mg, Sodium: 1.83mg",
    "nutrition": {
      "Calories": 166.45000000000002,
      "Total fat": 0.32,
      "Saturated fat": 0.01,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 621.91,
      "Total carbs": 29.48,
      "Fiber": 3.08,
      "Sugar": 20.940000000000005,
      "Protein": 2.76
    }
  },
  {
    "keyword": "Onion",
    "title": "Fresh Tomato, Bacon and Onion Fettucine",
    "ingredients": "4 oz Uncooked fettuccine, 3 Slices bacon, 1/4 c Chopped onion, 1 c (1 medium) chopped tomato, 1 tb Chopped fresh basil OR, 1/2 ts Dried basil leaves",
    "servings": "2 Servings",
    "instructions": "Cook fettuccine to desired doneness as directed on package. Drain, keep warm. Meanwhile, cook bacon in medium skillet until crisp; remove bacon and drain on paper towels. Reserve 1 Tbsp. drippings in skillet. Add onion; cook until crisp-tender. Crumble bacon; add to onion with tomato and basil. Cook just until heated. Immediately toss with cooked fettuccine. 4 side dish servings; 2 main dish servings.",
    "nutrition": {
      "Calories": 639.9799999999999,
      "Total fat": 14.29,
      "Saturated fat": 4.52,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 34.16,
      "Sodium": 597.9000000000001,
      "Total carbs": 98.03000000000002,
      "Fiber": 6.47,
      "Sugar": 10.1,
      "Protein": 28.89
    }
  },
  {
    "keyword": "Garlic",
    "title": "Electronic Gourmet's Garlic and Herb Salad Dr",
    "ingredients": "2 cl Garlic, peeled and crushed, 1 ts Tarragon, 1 ts Marjoram, 1 ts Powdered Mustard, 1/2 ts Salt, 1/4 ts Pepper, 1/2 c Olive Oil, 4 tb Red Wine Vinegar",
    "servings": "1 Jar",
    "instructions": "1) Shake all ingredients in a small jar with a tight fitting lid. Let stand at room temperature for at least 1 hour. The longer the better. 2) Shake again and use to dress any crisp green salad. Hint: ~---- Store in jar and refrigerate 4-5 days. Always shake before using.",
    "nutrition": {
      "Calories": 986.4000000000001,
      "Total fat": 108.39,
      "Saturated fat": 14.97,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 355.55,
      "Total carbs": 4.06,
      "Fiber": 0.85,
      "Sugar": 0.13,
      "Protein": 1.1400000000000001
    }
  },
  {
    "keyword": "Garlic",
    "title": "Electronic Gourmet's Garlic Bread",
    "ingredients": "1/4 lb Butter, soften to room temp., 1 cl Garlic, peeled and crushed, Loaf French Bread, 18\" long",
    "servings": "1 Loaf",
    "instructions": "1) Blend garlic with butter and let stand at room temperature 1 hour. 2) About 1/2 hour before serving, preheat oven to 375 F. 3) Meanwhile, slice bread 1 inch thick, cutting to but not through the bottom and holding knife at a slight angle. 4) Spread both sides of each slice with garlic butter and wrap loaf snugly in heavy foil. Place on a baking sheet and warm 20-25 minutes. 5) Unwrap and serve in a long napkin wrapped bread basket, or break into chunks and serve in a round napkin wrapped basket. Variations: =========== Herbed Garlic Bread: Mix 1 ts minced parsely and 1/4 ts each of thyme and oregano or marjoram into garlic butter and proceed as above. Cheese Garlic Bread: Mix 1 tb grated parmesan, 1/4 ts salt, 1/8 ts pepper and 1/4 ts each of savory and oregano or thyme into garlic butter and proceed as above. Curry or Chili Garlic Bread: Mix 1 to 2 ts curry or chili powder into garlic butter and proceed as above. Hints: ====== You can freeze before baking. On serving day open foil and bake at 350 F for 15 minutes. You can also use a microwave.",
    "nutrition": {
      "Calories": 2095.9300000000003,
      "Total fat": 103.37,
      "Saturated fat": 60.74,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 243.81,
      "Sodium": 3559.06,
      "Total carbs": 244.9,
      "Fiber": 10.4,
      "Sugar": 21.810000000000002,
      "Protein": 51.68
    }
  },
  {
    "keyword": "Garlic",
    "title": "Electronic Gourmet's Garlic Soup",
    "ingredients": "6 oz Olive Oil, 2 cl Garlic, peeled and crushed, 4 c Water, 2 tb Salt, 1 tb Monosodium Glutamate, 4 c Chicken Stock, 8 sl Fresh White Bread, 8 x Eggs",
    "servings": "8 Servings",
    "instructions": "1) Put the oil and garlic into a very heavy large pot. Saute until almost golden brown in colour. Add the water, salt, monosodium glutamate and stock. 2) Simmer for 3 hours. Check the seasoning. 3) To serve: Place a slice of bread in each soup bowl. Put a ladle of the hot soup in the bowl and immediately, on top of the bread, break an egg. The egg will congeal and the bread will go to the bottom of the bowl. Note: Can be made a day ahead and refrigerated. To serve, follow step 3.",
    "nutrition": {
      "Calories": 3213.32,
      "Total fat": 229.49,
      "Saturated fat": 41.129999999999995,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1516.8,
      "Sodium": 16115.029999999999,
      "Total carbs": 184.24,
      "Fiber": 8.08,
      "Sugar": 33.4,
      "Protein": 100.86000000000001
    }
  },
  {
    "keyword": "Garlic",
    "title": "Emeril's Roasted Garlic",
    "ingredients": "4 Whole garlic bulbs, 1 ts Olive oil, 2 ts Salt, 1 ts Essence",
    "servings": "4 Bulbs",
    "instructions": "Preheat oven to 400 degrees. Combine garlic, olive oil, salt, pepper and Essence together on a sheet of aluminium foil. Fold the edges of the foil together to form a tent and roast until tender, for about 40 minutes. It will keep 2-3 days with a little olive oil in the refrigerator. Squeeze the cloves out of the bulb and make a paste.",
    "nutrition": {
      "Calories": 137.22,
      "Total fat": 13.56,
      "Saturated fat": 1.87,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 1165.05,
      "Total carbs": 3.97,
      "Fiber": 0.25,
      "Sugar": 0.12,
      "Protein": 0.76
    }
  },
  {
    "keyword": "Garlic",
    "title": "Fresh Herb and Garlic Bread",
    "ingredients": "1 Clove garlic, 1/4 c Packed fresh herb leaves, i.e. parsley, basil, thyme, oregano, etc., 1 Stick unsalted butter, softened, Salt and freshly ground pepper, Cayenne, 1 Loaf italian or french bread",
    "servings": "1 Servings",
    "instructions": "In a food processor combine the garlic, herbs, butter, salt, pepper and cayenne to taste and process until smooth. Alternately, finely chop together the garlic and the herbs and then in a bowl mix together with the butter, salt, pepper and cayenne. Preheat oven to 350 degrees F. Cut the bread every 1 1/2-inches along the entire length of the loaf. Spread each side of a slice with the butter mixture. Wrap loaf in aluminum foil and bake for 15 to 20 minutes or until heated through. Unwrap bread, bake for 5 minutes to brown top. Serve bread warm. Yield: 4 servings",
    "nutrition": {
      "Calories": 2123.8,
      "Total fat": 103.88000000000002,
      "Saturated fat": 59.76,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 242.95,
      "Sodium": 3154.69,
      "Total carbs": 250.81,
      "Fiber": 13.219999999999999,
      "Sugar": 22.37,
      "Protein": 53.620000000000005
    }
  },
  {
    "keyword": "Mushroom",
    "title": "Elegant Mushroom and Olive Salad",
    "ingredients": "Bibb Lettuce, Romaine Lettuce, 1 c Black Olives, pitted, 1/2 lb Fresh Mushrooms, 4 oz Roquefort Cheese, or less if desired, Juice Of 1 Lemon, 1 tb Olive Oil, Salt And Cracked Pepper, to taste",
    "servings": "8 Servings",
    "instructions": "Break up enough lettuce into bite-sized pieces to make 2 quarts. Slice the olives and mushrooms. Crumble the cheese and toss lightly. Add lemon juice and olive oil. Do *not* substitute other oils. Add salt and cracked pepper to taste, and toss again.",
    "nutrition": {
      "Calories": 788.5099999999999,
      "Total fat": 64.17999999999999,
      "Saturated fat": 25.84,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 102.06,
      "Sodium": 3636.0999999999995,
      "Total carbs": 30.569999999999997,
      "Fiber": 11.99,
      "Sugar": 7.6499999999999995,
      "Protein": 32.050000000000004
    }
  },
  {
    "keyword": "Mushroom",
    "title": "Elegant Mushroom Soup",
    "ingredients": "1 1/2 lb Mushrooms -- sliced 1/4\", Thick, 2 qt Chicken Broth -- College, Inn, 2 Cubes, 2 qt Heavy Cream -- 18%, 4 tb Butter, 1 ts Thyme -- ground, 3 tb Cornstarch -- or less, to, Thicken, Chicken Bouillon",
    "servings": "8 Servings",
    "instructions": "* NOTE: Use 1 1/2 pounds or MORE of ripe mushrooms. The darker mushroom (older) adds a stronger flavor to the soup, that's what I usually use. I've made this with the regular white, as well as portabello mushrooms - a blend tastes fine, but the portobello tends to overpower slightly. 1. Melt butter in pot. Add sliced mushrooms, and saute gently until liquid is completely cooked out. Do not brown mushrooms. 2. Add at least 2 quarts chicken broth (reserve 1/3 cup), thyme, and bouillon. Bring to a full boil, and simmer, uncovered, until broth is reduced by 75%. Taste should be extremely strong (it will be diluted with the cream). Note: The reduction can take quite a while. 3. Mix cornstarch with reserved broth, and add to soup. Allow mixture to get very thick. 4. Gently add 2 quarts (or more) heavy cream. Blend, and bring to a gentle simmer. Taste, and adjust seasoning if needed. Thin with milk or cream if flavor is too strong, or soup is too thick. : Jocie Moravec",
    "nutrition": {
      "Calories": 927.6999999999999,
      "Total fat": 72.10000000000001,
      "Saturated fat": 43.440000000000005,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 199.64,
      "Sodium": 2722.0699999999997,
      "Total carbs": 62.300000000000004,
      "Fiber": 15.3,
      "Sugar": 20.18,
      "Protein": 20.549999999999997
    }
  },
  {
    "keyword": "Mushroom",
    "title": "Elegant Mushrooms with Noodles",
    "ingredients": "1 lb Fresh mushrooms sliced, 4 tb Butter (no substitute!), 8 oz Noodles, 1/2 c Whipping cream, 1/2 c Parmesan cheese, 1/2 c Gruyere cheese, Salt and pepper to taste",
    "servings": "6 Servings",
    "instructions": "Saute mushrooms in butter. Cook noodles; drain. Add mushrooms, cream, cheeses, salt and pepper. Toss and serve immediately. Garnish with minced fresh parsley. This is a nice alternative for potatoes or rice. MRS W.E. NELSON (LYNNE) ATLANTA, GA",
    "nutrition": {
      "Calories": 1735.74,
      "Total fat": 125.29,
      "Saturated fat": 75.6,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 361.64,
      "Sodium": 1944.3100000000002,
      "Total carbs": 103.95,
      "Fiber": 14.13,
      "Sugar": 15.649999999999999,
      "Protein": 57.57
    }
  },
  {
    "keyword": "Mushroom",
    "title": "Empress Mushrooms",
    "ingredients": "16 md Mushrooms, 1 sm Onion, chopped, 1 lg Garlic, clove, chopped, 1/2 c Oil, olive, 6 oz Prosciutto, OR, 1 lg Ham, slice, 2 ts Parsley, 2 ts Marjoram, Salt, Pepper, 1 c Wine, white, Bread crumbs, Cheese, Parmigiano, grated",
    "servings": "4 Servings",
    "instructions": "Clean the mushrooms thoroughly and remove and chop up their stems. Saute onions and garlic in 1/4 cup of olive oil until transparent. Add chopped mushrooms stems, chopped prosciutto, parsley, marjoram, salt and pepper. Saute for about 2 minutes, then add wine. Add bread crumbs until mixture is consistency of mush. Coat mushroom tops with remaining olive oil. Stuff each mushroom with a tablespoon of the mixture, then sprinkle with Parmigiano cheese and bake at 375 F for 3 - 7 minutes, depending on the size of the mushrooms. ",
    "nutrition": {
      "Calories": 2022.4,
      "Total fat": 142.49,
      "Saturated fat": 27.490000000000006,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 236.64000000000001,
      "Sodium": 6973.950000000001,
      "Total carbs": 53.4,
      "Fiber": 8.19,
      "Sugar": 14.660000000000002,
      "Protein": 94.94000000000001
    }
  },
  {
    "keyword": "Mushroom",
    "title": "Fresh Homemade Pasta with Wild Mushrooms",
    "ingredients": "2 tb Extra virgin olive oil, 2 tb Chopped shallots, 1 tb Chopped garlic, 1/4 ts Red pepper flakes, 2 oz Dried porcini mushrooms, washed and rehydrated, 1/2 lb Cremini mushrooms, cleaned and sliced, Salt and freshly ground pepper to taste, 1/2 c Heavy cream, 6 qt Water, (up to 8), 2 tb Salt, 1 lb Pasta, such as fettucine, 2 tb Shredded fresh basil leaves, 3 tb Pine nuts, toasted, 1/4 c Freshly grated Parmesan cheese",
    "servings": "4 Servings",
    "instructions": "In a saute pan, heat the olive oil over medium heat. Add the shallots, garlic, red pepper and quickly saute being careful to avoid browning or burning. Add the mushrooms, season with salt and pepper and saute together for 5 minutes. Add the cream, reduce the heat to prevent the cream from scorching and cook for several minutes while the pasta cooks. Bring the water to a rolling boil in a large pot and add the salt. Add the pasta to the boiling water. To the mushrooms, add the basil, pine nuts and Parmesan cheese. The pasta will cook in several minutes after returning to the boil. Add the cooked pasta to the sauce and serve.",
    "nutrition": {
      "Calories": 1721.8700000000001,
      "Total fat": 98.53000000000002,
      "Saturated fat": 36.8,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 154.22,
      "Sodium": 13504.340000000002,
      "Total carbs": 169.13,
      "Fiber": 12.79,
      "Sugar": 13.9,
      "Protein": 47.71
    }
  },
  {
    "keyword": "Spinach",
    "title": "Elegant Spinach and Artichoke Casserole",
    "ingredients": "2 pk Frozen chopped spinach, 2 Jars, Artichokes, 1 1/2 c Grated cheddar cheese, 1/2 ts Savory, 1/2 ts Thyme, 1 Onion -- grated, 1/3 c Chopped fresh parsley, 5 Eggs -- well beaten, Salt, pepper and garlic salt, To taste, (6 1/2 oz) marinated",
    "servings": "6 Servings",
    "instructions": "Cook spinach according to package directions, drain. Chop artichokes and put in bottom of 2 quart dish with marinade. Mix everything else together except for 1/2 cup cheese and put in dish over artichokes. Sprinkle with remaining cheese. Bake at 350 for 35 minutes. : DLGREAT",
    "nutrition": {
      "Calories": 1268.7399999999998,
      "Total fat": 81.98999999999998,
      "Saturated fat": 40.18000000000001,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1097.81,
      "Sodium": 2724.83,
      "Total carbs": 55.589999999999996,
      "Fiber": 20.97,
      "Sugar": 9.53,
      "Protein": 84.69
    }
  },
  {
    "keyword": "Spinach",
    "title": "Emily's Spinach Salad",
    "ingredients": "2/3 c Vegetable oil, 1/4 c Red wine vinegar, 2 ts Lemon juice, 2 ts Soy sauce, 1 ts Sugar, 1 ts Mustard, dry, 1/2 ts Curry powder, 1/2 ts Salt, 1/2 ts Seasoned pepper, 1/4 ts Garlic powder, 1 pk Spinach, fresh, (10oz) torn into bite-size pcs, 5 Bacon strips, cooked & crumbled, 2 Eggs, hard cooked sliced",
    "servings": "6 Servings",
    "instructions": "Combine first 10 ingredients in a jar; cover tightly and shake until well mixed; set aside. Place spinach in a large salad bowl. Just before serving, pour dressing over spinach and toss gently. Garnish with crumbled bacon and egg slices.",
    "nutrition": {
      "Calories": 1645.8100000000002,
      "Total fat": 164.81999999999996,
      "Saturated fat": 17.08,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 396.75,
      "Sodium": 2801.0899999999997,
      "Total carbs": 16.55,
      "Fiber": 5.74,
      "Sugar": 5.72,
      "Protein": 29.64
    }
  },
  {
    "keyword": "Spinach",
    "title": "Empress Spinach Salad",
    "ingredients": "1 1/2 lb Fresh spinach uncooked, 2 Pimientos drained & diced, 2 sl Bacon crisp-cooked, finely chopped, reserve bacon fat for dressing, 2 Eggs, hard-cooked & chopped, 1/4 c Olive oil, 3 tb Wine vinegar, 1 pn Salt, 1 pn Pepper, fresh ground, 1 Garlic clove mashed, 3 Anchovy filets - minced or mashed, 1/2 Lemon, juice of",
    "servings": "6 Servings",
    "instructions": "Wash spinach carefully several times to get rid of all sand. Or buy pre-washed & trimmed fresh spinach, give it a quick wash, and dry well. place spinach in a bowl, add pimientos, bacons & eggs. Combine oil & vinegar in second bowl. Add salt, pepper, garlic, anchovies & lemon juice. Mix well. When ready to serve, discard bits of garlic; pour dressing & warm bacon grease together and stir until blended. Pour over spinach, toss well and serve.",
    "nutrition": {
      "Calories": 1508.64,
      "Total fat": 117.25999999999998,
      "Saturated fat": 24.520000000000003,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 499.30999999999995,
      "Sodium": 2564.88,
      "Total carbs": 47.629999999999995,
      "Fiber": 16.959999999999997,
      "Sugar": 5.47,
      "Protein": 68.7
    }
  },
  {
    "keyword": "Spinach",
    "title": "Fresh Spinach",
    "ingredients": "10 oz Pk fresh spinach",
    "servings": "2 Servings",
    "instructions": "1. Wash spinach and remove any bruised leaves or thick stems. Shake excess water off leaves. 2. Place spinach in a 2-quart, heat-resistant, non-metallic casserole. 3. Heat, tightly covered, in Microwave Oven 5 minutes. Stir after 2 minutes. 4. Drain excess water and season to taste.",
    "nutrition": {
      "Calories": 65.21,
      "Total fat": 1.11,
      "Saturated fat": 0.18,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 223.97,
      "Total carbs": 10.29,
      "Fiber": 6.24,
      "Sugar": 1.19,
      "Protein": 8.11
    }
  },
  {
    "keyword": "Spinach",
    "title": "Fresh Spinach and Fruit Salad, Pk",
    "ingredients": "5 c Fresh spinach washed and trimmed, 5 c Greens field, mixed, 1 c Strawberries cut in half, winter, 1 c Oranges in summer, 1 Granny Smith apple cored and sliced, 1/4 c Orange juice, 1/2 c Cranberries dried, or, 1/2 c Blueberries or, 1/2 c Cherries, 1/2 md Red onion thinly sliced, 1/2 c Monterey jack cheese shredded, 1/2 c Hosin honey mustard vinagarette, 1/4 c Nuts or seeds optional",
    "servings": "10 Servings",
    "instructions": "1. Toss the sliced apples in orange juice to coat to prevent browning. You may use any variety of greens available to you. 2. The sweet-tart taste of this salad dressing compliments the bitterness of the spinach and field greens. 3.The dressing will adhere better to dry greens.",
    "nutrition": {
      "Calories": 1932.0899999999997,
      "Total fat": 100.13999999999999,
      "Saturated fat": 21.28,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 85.09,
      "Sodium": 1608.2400000000002,
      "Total carbs": 236.57,
      "Fiber": 60.81999999999999,
      "Sugar": 136.47999999999996,
      "Protein": 56.669999999999995
    }
  },
  {
    "keyword": "Broccoli",
    "title": "Elizabeth Burris' Broccoli Salad",
    "ingredients": "1 1/2 lb Broccoli, 1/2 Red onion chopped, 1 c Sunflower seeds, 1/2 c Raisins, 1 c Sliced fresh mushrooms, 1 c Mayonnaise, 2 tb Red wine vinegar, 1/4 c Sugar (optional), 1/2 lb Bacon cooked crisp & crumbled",
    "servings": "6 Servings",
    "instructions": "CLEAN AND CUT the whole broccoli into small pieces. Use all of the broccoli except the end chunks. Mix together the broccoli, onion, sunflower seeds, raisins and mushrooms. Make the dressing by mixing the mayonnaise, vinegar and sugar. Twenty minutes before serving, toss the salad. Toss with the bacon and the dressing.",
    "nutrition": {
      "Calories": 4162.94,
      "Total fat": 321.87,
      "Saturated fat": 61.260000000000005,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 317.1,
      "Sodium": 13352.909999999998,
      "Total carbs": 218.08000000000004,
      "Fiber": 42.46999999999999,
      "Sugar": 118.38,
      "Protein": 128.83
    }
  },
  {
    "keyword": "Broccoli",
    "title": "Gratin of Broccoli And Ricotta",
    "ingredients": "1 Head broccoli trimmed into flowerets, 2 tb Butter, 2 tb Grated parmesan, 200 g Ricotta, 4 Eggs, Salt and pepper to taste, 1/2 c Milk or cream",
    "servings": "1 servings",
    "instructions": "1. Cook broccoli either by steaming or in the microwave until just tender. If flowerets are large, cut into smaller pieces and set aside in a bowl to cool. Generously butter a six-cup souffle dish and line the bottom with Glad Bake if you want to unmould the gratin. Pre-heat the oven to 180deg.C. 2. Place remaining ingredients in a food processor and process until well mixed. Pour over broccoli and mix together gently to prevent broccoli breaking up. 3. Spoon mixture into prepared souffle dish and place the dish in a baking tray. Pour boiling water into tray until if comes halfway up the sides of the souffle dish. Bake in the oven for about 30 minutes, or until the mixture has set and is light golden on top. Per serving: 636 Calories (kcal); 43g Total Fat; (56% calories from fat); 40g Protein; 34g Carbohydrate; 810mg Cholesterol; 620mg Sodium Food Exchanges: 0 Grain(Starch); 3 Lean Meat; 6 Vegetable; 0 Fruit; 6 1/2 Fat; 0 Other Carbohydrates",
    "nutrition": {
      "Calories": 1105.68,
      "Total fat": 75.69999999999999,
      "Saturated fat": 41.089999999999996,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 920.14,
      "Sodium": 1380.4699999999998,
      "Total carbs": 46.8,
      "Fiber": 12.31,
      "Sugar": 13.589999999999998,
      "Protein": 65.08
    }
  },
  {
    "keyword": "Broccoli",
    "title": "Mellagu Broccoli Mezhakku Purattiyathu",
    "ingredients": "800 g Broccoli, Salt to taste, 3 tb Coconut oil (45 ml.), 1 ts Mustard seeds (5 g.), 1 ts Urad dal washed and pat dried (5 g.), 4 Whole red chillies cut into pieces, 60 g Shallots (Madras or red onions), sliced, 200 g Tomatoes chopped, 10 g Coriander powder, 1/2 ts Turmeric powder (2 g.), 100 g Tender raw cashewnuts, 12 g Black pepper powder (freshly roasted and pounded), 24 Curry leaves, 45 g Sun dried tomatoes cut into strips",
    "servings": "4 servings",
    "instructions": "REMOVE the stems of the broccoli and cut into flowerets. Reserve in salted lukewarm water for five minutes. Drain and blanch in salted boiling water for two minutes. Drain and refresh in iced water and drain again. Peel the tender cashewnuts, halve and soak them in water for 10 minutes. Drain. Heat oil in a pan and season with mustard seeds. When they splutter, add urad dal. Stir until light golden. Add red chillies and stir until they begin to change colour. Add shallots and saut\u0082 until translucent and glossy. Add the chopped tomatoes and stir-fry until the oil floats on top. Dissolve coriander powder and turmeric powder in two tbsp. water and add to the pan. Stir until the moisture evaporates. Add the cashewnuts and stir for a minute. Add curry leaves and broccoli, toss (or stir) for four minutes. Remove from heat, sprinkle pepper powder and adjust the seasoning. Remove to a flat dish. Garnish with sun dried tomatoes and serve with Malabari paratha or as an accompaniment. NOTES : (Broccoli With Tomatoes)",
    "nutrition": {
      "Calories": 1486.55,
      "Total fat": 70.22,
      "Saturated fat": 38.42,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 46.0,
      "Sodium": 2234.6600000000003,
      "Total carbs": 174.33999999999997,
      "Fiber": 56.31999999999999,
      "Sugar": 46.53,
      "Protein": 68.74
    }
  },
  {
    "keyword": "Broccoli",
    "title": "Microwaved Bean, Broccoli And Tomato Chowder (Aicr)",
    "ingredients": "2 md Onions chopped, 1 c Vegetable broth, 16 oz Canned tomatoes, 2 c Broccoli, 16 oz Cooked kidney beans red or white, rinsed and drained, 1/2 ts Dried basil, 1 ds Hot pepper sauce, Salt and black pepper",
    "servings": "4 servings",
    "instructions": "For a quick supper, try this easy soup, adding other favorite vegetables you might have on hand, like zucchini, green beans or spinach. 1) Salt and pepper In large bowl, combine onions and cup of the stock; cover and microwave at High power for 3 minutes. Add tomatoes, remaining stock, 1 cup water and raw broccoli; cover and microwave at High power for 5 minutes. Add beans, basil and hot pepper sauce; cover and microwave at High power for 3 minutes or until heated through. Season with salt and pepper to taste.",
    "nutrition": {
      "Calories": 860.88,
      "Total fat": 5.289999999999999,
      "Saturated fat": 0.9000000000000001,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 2032.6600000000003,
      "Total carbs": 164.6,
      "Fiber": 51.3,
      "Sugar": 27.580000000000002,
      "Protein": 53.75
    }
  },
  {
    "keyword": "Broccoli",
    "title": "Chicken with Broccoli and Cashews",
    "ingredients": "1 tb Cornstarch, 1/3 c Sherry or dry red wine, 1/3 c Soy sauce, 1/2 c Chicken broth, 1 1/2 ts Sesame oil, 3 tb Vegetable oil, (or peanut oil), 3 Boneless chicken breasts,, Skinned, cut into strips, 1/3 c Cashews, 1/2 c Broccoli florets, 7 oz Can bamboo shoots,, Drained and sliced, 6 Green onions,, Sliced diagonally",
    "servings": "4 Servings",
    "instructions": "Blend the cornstarch with the sherry and broth; set aside. Heat the sesame oil and vegetable oil in wok or heavy skillet, stir fry the chicken and cashews until the chicken is golden and the cashews are lightly browned. Add the broccoli, bamboo shoots and the green onions and stir fry for 3-4 minutes, til broccoli is cooked. Pour the cornstarch mix into the wok and stir until the sauce boils for a minute, stirring constantly to coat. Julie Michigan, USA",
    "nutrition": {
      "Calories": 1739.5199999999998,
      "Total fat": 97.44999999999999,
      "Saturated fat": 14.14,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 308.49,
      "Sodium": 6194.8099999999995,
      "Total carbs": 54.28,
      "Fiber": 9.87,
      "Sugar": 12.229999999999999,
      "Protein": 133.9
    }
  },
  {
    "keyword": "Avocado",
    "title": "Fresh Tomato and Avocado Salsa",
    "ingredients": "2 lg Tomatoes, chopped, 1 Jalapeno chili, seeded and finely chopped, 2 tb Sliced green onions, 2 tb Chopped fresh cilantro, 2 tb Balsamic vinegar, 1/4 ts Salt, 1 sm Avocado, diced",
    "servings": "1 Servings",
    "instructions": "Mix all ingredients. Cover and refrigerate 1 to 2 hours to blend flavors. Just before serving, stir in avocado. Serve at room temperature. Makes about 2 1/2 cups salsa.",
    "nutrition": {
      "Calories": 968.78,
      "Total fat": 64.12,
      "Saturated fat": 15.17,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 100.8,
      "Sodium": 2155.15,
      "Total carbs": 63.31,
      "Fiber": 19.59,
      "Sugar": 18.739999999999995,
      "Protein": 42.86999999999999
    }
  },
  {
    "keyword": "Avocado",
    "title": "Goan Spiced Crab Cakes, Pappadums, Avocado And Tamarind",
    "ingredients": "1/4 c Corn oil, 1 Onion diced small, 1 tb Peeled minced fresh ginger, 1/2 tb Minced garlic, 1 ts Coriander seeds ground, 1 ts Cumin seed ground, 1/4 ts Turmeric, 1 Tomato diced small, 1 c Crabmeat carefully picked, 2 md Shrimp minced to fine paste, 2 Limes zested (chopped),, And juiced, 8 Sprigs cilantro washed, 1 tb Chopped chives, 1 Egg beaten, 1 c Panko - (available in Japanese specialty, Stores), Salt to taste, Freshly-ground black pepper to taste, Cayenne to taste, Avocado Salad (see recipe), 4 c Baby greens, 4 Pappadums - (available in Indian specialty, Stores), 1/4 c Tamarind chutney",
    "servings": "4 servings",
    "instructions": "In a large saute pan, heat one tablespoon of the corn oil. Add the onion, ginger and garlic and saute for 5 minutes over medium heat. Add the coriander, cumin, turmeric and the tomato and continue to cook until it turns dry. Remove from the heat and cool down. In a large mixing bowl, combine crabmeat, the cooled onion mixture, shrimp, chopped lime zest and juice, cilantro, chives, beaten egg and 3 tablespoons of the panko. Season with salt, pepper and cayenne. Mix well so that all the ingredients are well incorporated. Test a small quantity by forming a teaspoon of this mix into a small patty and frying it in a pan. Adjust the salt and pepper if necessary. Divide this mixture into 4 equal portions. Form into balls and flatten to form small patties. Put the rest of the panko on a cutting board. Place the patties one at a time in the bread crumbs. Heat a heavy-bottomed skillet large enough to hold the crab cakes on medium heat. Add the oil and fry the crab cakes. When the cakes turn a light golden color, flip them over and cook them on the other side until they are light golden in color. Using a slotted spatula, remove and drain on a paper towel. Take 4 large plates and place the baby greens in the centers and a pappadum on top of the greens. Fill each pappadum with a scoop of Avocado Salad and top with a crab cake. Spoon the tamarind around the plate. This recipe yields 4 servings.",
    "nutrition": {
      "Calories": 1685.4999999999998,
      "Total fat": 80.79,
      "Saturated fat": 11.82,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 329.81,
      "Sodium": 2516.0099999999998,
      "Total carbs": 188.86,
      "Fiber": 50.730000000000004,
      "Sugar": 41.900000000000006,
      "Protein": 74.03000000000002
    }
  },
  {
    "keyword": "Avocado",
    "title": "Michael Richard's Avocado Soup with Snapper Seviche",
    "ingredients": "=== AVOCADO SOUP ===, 1 lg Ripe avocado chopped, 2 c Chicken stock, 2 tb Freshly-squeezed lemon juice, Salt to taste, Tabasco pepper sauce to taste, === SEVICHE ===, 2 tb Freshly-squeezed lime juice, 1 Chile pepper seeded, minced, 1 sm Tomato peeled, seeded,, And diced very small, 1 tb Minced fresh cilantro plus extra, Cilantro sprigs for garnish, 1 tb Minced fresh chives, 1 tb Olive oil, 3/4 lb Fresh white fish fillets sliced 3/16\" strips, (such as red snapper halibut or sea bass)",
    "servings": "4 servings",
    "instructions": "In a blender combine avocado, stock and lemon juice and process for several minutes to a smooth puree; season to taste with salt and Tabasco pepper sauce. Refrigerate, covered, for at least 1 hour until well chilled. In a non-reactive bowl combine lime juice, chile, tomato, cilantro and chives. Slowly whisk in oil; season to taste with salt and Tabasco pepper sauce. Stir fish into marinade, cover and refrigerate for 60 minutes. Remove from refrigerator and let sit 15 minutes at room temperature. To serve, ladle soup into a large shallow soup bowl. Remove fish from marinade with a slotted spoon and mound in center of plate. Garnish with cilantro or dill sprigs and serve immediately. This recipe yields 4 servings.",
    "nutrition": {
      "Calories": 1739.4199999999996,
      "Total fat": 88.07999999999998,
      "Saturated fat": 14.239999999999995,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 475.0,
      "Sodium": 2947.3700000000003,
      "Total carbs": 73.58,
      "Fiber": 31.490000000000002,
      "Sugar": 17.060000000000002,
      "Protein": 170.26
    }
  },
  {
    "keyword": "Avocado",
    "title": "Chicken, Avocado and Bacon Salad with Bl",
    "ingredients": "1 c Mayonnaise, 1/2 c Sour cream, 6 tb Chicken stock, 2 1/2 tb Blue cheese -- in small, Freshly ground black",
    "servings": "1 Servings",
    "instructions": "1/2 cup Fresh lemon juice (divided -- use) 4 cups Poached chicken meat -- still cut into -- approximately 1 1/2 Inch pieces 2 cups Diced -- peeled avocado 1/2 teaspoon Kosher salt 1 Head romaine lettuce -- torn 2 inch pieces 8 Strips bacon -- cooked until broken into 1 inch -- pieces wedges for garnish Put the mayonnaise, sour cream, stock, blue cheese, pepper and half the lemon juice in a bowl and mix well. Toss the chicken and avocado lightly with the salt and the remaining lemon juice. Arrange the romaine in 4 salad bowls. Divide the chicken mixture evenly among the bowls. Sprinkle the bacon pieces on top. Serve with the blue cheese dressing. Garnish with tomato wedges. Makes 4 servings. : ",
    "nutrition": {
      "Calories": 1814.4700000000003,
      "Total fat": 192.52,
      "Saturated fat": 40.71999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 173.33999999999997,
      "Sodium": 1802.68,
      "Total carbs": 9.81,
      "Fiber": 0.0,
      "Sugar": 6.390000000000001,
      "Protein": 11.469999999999999
    }
  },
  {
    "keyword": "Avocado",
    "title": "Chicken, Avocado and Papaya Salad with Passion Fruit Dressi",
    "ingredients": "6 Halves poached boneless, Chicken breasts, 2 Peeled & thinly sliced ripe, Papayas, 2 Peeled & thinly sliced ripe, Avocados, 4 tb Fresh lime juice, Pulp of 1 ripe passionfruit, 1/2 c Vegetable oil, Finely grated peel of 1, Lime, Salt & pepper, 2 3 Tbls. honey, 1/2 c Coarsely chopped pecans",
    "servings": "1 Servings",
    "instructions": "Line 6 salad plates with lettuce. Trim any fat remaining on chicken. Cut chicken into bite sized pieces. Alternate chicken, avocado & papaya on plates. Whisk together lime juice, pulp, oil, peel, salt & pepper & honey. Spoon dressing over each salad. Sprinkle with pecans. Serve immediately.",
    "nutrition": {
      "Calories": 2771.1399999999994,
      "Total fat": 192.35,
      "Saturated fat": 19.620000000000005,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 306.0,
      "Sodium": 658.72,
      "Total carbs": 159.88000000000002,
      "Fiber": 48.03,
      "Sugar": 95.16,
      "Protein": 127.51
    }
  },
  {
    "keyword": "Italian",
    "title": "Fresh Mozzarella, Italian Sausage and Roasted Pepper Calzon",
    "ingredients": "1 Ball of basic pizza dough (enough dough for 1 pizza), 1 tb Olive oil, Salt and white pepper, 1/2 c Thick pesto, 1/2 c Roasted garlic, 1 c Diced Italian sausage, cooked, 1 Red pepper, roasted, peeled, seeded and julienned, 2 tb Chiffonade of basil, 4 sl (1/2-inch) fresh Mozzarella cheese, 1 Egg, beaten, 1 c Spicy tomato sauce, hot, 2 tb Grated Parmigiano-Reggiano cheese, 1 tb Chopped chives, 1 tb Brunoise red peppers",
    "servings": "2 Servings",
    "instructions": "Preheat the oven to 500 degrees. Place the dough out onto a floured surface. Roll the dough out to form a 12-inch circle. Spread the pesto over one half of the dough. Layer the garlic, sausage, peppe rs, and basil, alternately over the pesto. Lay the Mozzarella cheese over the basil. Fold the other side of the dough over the filling and pinch the edges to seal the calzone. Make three slashes acro ss the top of the calzone. Place the calzone on a parchment-lined baking sheet. Brush the calzone with the egg wash. Bake for 20 to 25 minutes or until golden. Spoon the sauce in the center of the pl ate. Slice the calzone in half and place in the center of the sauce. Garnish with the grated cheese, chives and brunoise peppers.",
    "nutrition": {
      "Calories": 3008.66,
      "Total fat": 204.43999999999997,
      "Saturated fat": 66.92999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 369.75,
      "Sodium": 5869.749999999999,
      "Total carbs": 200.98000000000002,
      "Fiber": 14.469999999999999,
      "Sugar": 28.450000000000003,
      "Protein": 95.21999999999998
    }
  },
  {
    "keyword": "Italian",
    "title": "Grandma Demaio's Italian Stew",
    "ingredients": "1 lb Italian sausage or hot dogs, 4 lg Tomatoes peeled and sliced*, 1 lg Green pepper sliced, 2 Zucchini sliced, 2 lg Potatoes sliced, 1 lg Maui onion sliced, 3 Cloves garlic pressed, 2 ts Sweet basil, 1 ts Oregano, 1 ts Parsley, 1 ts Salt, 1/2 ts Pepper",
    "servings": "6 servings",
    "instructions": "* or 2-14oz cans This is a very easy recipe. Simply brown the sausage, add all the veggies and cook for about an hour over a low flame. The stew should simmer, but never reach a hard boil. When Grandma didn't have sausage, she often used hot dogs, which we just loved! My husband's grandmother used to make this stew during the harvest season. She and Grandpa lived on a small farm and all the veggies and herbs were grown on the farm. Grandma also made her own Italian sausage. Although I find this rendition a fair imitation, nothing can compare with Grandma's Stew (can't even remember the correct name for it). Grandma DeMaio's stew was lovingly preparred on top of a wood burning stove! How we all loved it! Per serving: 329 Calories (kcal); 24g Total Fat; (65% calories from fat); 13g Protein; 16g Carbohydrate; 58mg Cholesterol; 921mg Sodium Food Exchanges: 1/2 Grain(Starch); 1 1/2 Lean Meat; 1 1/2 Vegetable; 0 Fruit; 4 Fat; 0 Other Carbohydrates",
    "nutrition": {
      "Calories": 2343.6499999999996,
      "Total fat": 141.49999999999994,
      "Saturated fat": 52.440000000000005,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 286.39,
      "Sodium": 4464.66,
      "Total carbs": 161.04000000000002,
      "Fiber": 23.37,
      "Sugar": 53.34,
      "Protein": 114.50000000000001
    }
  },
  {
    "keyword": "Italian",
    "title": "Microwave Chicken Breasts Italian",
    "ingredients": "2 tb Olive oil, 1 md Onion, 1/2 Green pepper chopped, 1/2 ts Oregano, Salt and pepper to taste, Cayenne pepper to taste, 1/2 Tes capers drained, 1 pn Sugar, 1 1/2 ts Balsamic vinegar, 4 Chicken breasts without skin",
    "servings": "4 servings",
    "instructions": "1. Heat 1 1/2 tablespoons oil in a skillet with onion and pepper. Cook until softened, about 5 minutes. Add oregano, salt, black and cayenne peppers, capers and sugar. Cook as additional 2 minutes. 2. Transfer contents of skillet to a food processor and puree. Add remaining oil and balsamic. Taste and correct seasoning. (Recipe can be done ahead to this point) 3. Place chicken breasts in a microwave-oven proof dish or pie plate large enough to hold them in a single layer. Pour sauce over the chicken, cover the casserole loosely with waxed paper and cook on high power for 4 minutes. Turn the chicken, recover and cook an additional 4 minutes or until the chicken is cooked through but still juicy. Partially rotate the dish after 2, 4 and 6 minutes. Set aside for 2 minutes. 4. Spoon 1 or 2 chicken breasts and sauce onto heated plates. Serve with rice or steamed potatoes. NOTES : My MC II shows 28.4 CFF",
    "nutrition": {
      "Calories": 1134.13,
      "Total fat": 44.81,
      "Saturated fat": 8.709999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 408.0,
      "Sodium": 762.38,
      "Total carbs": 23.4,
      "Fiber": 2.9099999999999997,
      "Sugar": 14.280000000000001,
      "Protein": 151.22
    }
  },
  {
    "keyword": "Italian",
    "title": "Chicken with Italian Herbs and Vegetables",
    "ingredients": "6 Chicken breasts boneless and skinless, 1/2 c White mushrooms sliced 1/8\" thick, 1/2 c Red bell pepper sliced 1/8 \", 1/2 c Green bell pepper sliced 1/8\", 1/2 c Onion sliced 1/8\", 1 Clove fresh garlic finely chopped, 1 ts Oregano dried, 1 ts Basil dried, 1 ts Salt, 1/2 ts Black pepper, Canola oil as needed",
    "servings": "1 Servings",
    "instructions": "Flatten the chicken breasts between 2 sheets of plastic wrap with a mallet or heavy, flat-bottomed saucepan or skillet. Breasts should be a uniform thickness of about 1/2\". Rub the oregano, basil, salt and black pepper into the meat and then brush lightly with canola oil. Brush both sides of the Grilling Machine with oil and allow to pre-heat about 5 minutes. Mix all the vegetables together. Place veggies on the Grilling Machine, spread them out, and cover with the chicken. Grill for 7-8 minutes. Serves 6.",
    "nutrition": {
      "Calories": 1413.2900000000004,
      "Total fat": 40.51,
      "Saturated fat": 8.449999999999998,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 612.0,
      "Sodium": 1121.8999999999999,
      "Total carbs": 22.609999999999996,
      "Fiber": 4.989999999999999,
      "Sugar": 9.37,
      "Protein": 227.71
    }
  },
  {
    "keyword": "Italian",
    "title": "Chicago Italian Beef Sandwiches",
    "ingredients": "2 lb Beef roast, leftover,, Pre-roasted, Roasting pan drippings, 2 tb Fresh oregano, finely, Chopped, OR 2 teaspoon dried, Oregano, crushed, 1 tb Fresh sweet basil,, Finely chopped, OR 1 teaspoon dried, Basil, crushed, 1 ts Whole black peppercorns, 1/2 ts Red pepper, ground (1/2, To 1), 1 tb Fresh parsley, minced, Salt, to taste, 3 cl Garlic, minced, 1 Fresh green pepper seeded, And, sl Into 1/4 inch strips",
    "servings": "8 Servings",
    "instructions": "Thinly slice cooked, roast beef and place in a Dutch oven (or put it back into the same pan in which the beef was roasted). Add enough water to cover. Add remaining ingredients and bring to simmer. After the beef has cooked for awhile, taste and adjust seasonings. Cook about 1 hour. Serve beef only on Italian bread with grilled green peppers and / or giardinera relish. As you serve dip the sandwich in your gravy.",
    "nutrition": {
      "Calories": 2824.7299999999996,
      "Total fat": 175.13000000000002,
      "Saturated fat": 69.31,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1088.62,
      "Sodium": 1046.6299999999999,
      "Total carbs": 20.05,
      "Fiber": 5.37,
      "Sugar": 6.4399999999999995,
      "Protein": 276.68
    }
  },
  {
    "keyword": "Mexican",
    "title": "Enchiladas with Salsa Mexicana",
    "ingredients": "2 c Salsa such as Salsa Mexicana, see recipe, Vegetable oil coohing spray, 1 Red bell pepper seeded and thinly sliced, 1/2 c Thinly sliced onion, 2 c Sliced mushrooms, 1 sm All-purpose potato OR 3/4-cup cut potatoes 1/2\" pieces, 2 Garlic cloves minced, 2 c Packed fresh spinach leaves washed thoroughly and spun dry, 2 tb Chopped cilantro PLUS, 6 Sprigs fresh cilantro for garnish, 1/4 ts Red pepper flakes crushed, 1/2 c Crumbled feta cheese (2-oz), 6 6 in corn tortillas fresh, 8 c Finely shredded romaine lettuce",
    "servings": "6 Servings",
    "instructions": "1. Preheat oven to 350F. Prepare Salsa Mexicana (see recipe) or use a prepared salsa. 2. Lightly spray a 1 2-in. nonstick skillet with vegetable oil cooking spray. Add bell pepper and onion, and cook over medium heat, stirring until softened, about 5 minutes. Add mushrooms, potatoes, garlic and 1/4 cup water and cook, stirring occasionally, until all vegetables are softened, about 10 minutes. Remove the skillet from the heat and stir in spinach, cilantro and red pepper flakes until spinach is wilted. Add feta and stir to blend. 3. Lightly spray an 8-in. square baking pan with vegetable oil. Warm each tortilla in a dry skillet over medium heat, about 1 minute per side. Place 1/3 cup of vegetable mixture in the lower part of each tortilla and roll up. Carefully place enchiladas seam side down in the baking pan, brush lightly with some of the liquid from the salsa, cover with foil and bake for 20 minutes. 4. To serve, divide lettuce among 6 plates. Place enchiladas on top of the lettuce. Top with salsa and garnish with cilantro sprigs. Notes: A nicely spiced entree, these light enchiladas are filled with veggies instead of the typical beef, pork or chicken. A bit of feta cheese is in the wrap for tangy flavor and creaminess. >from Kitpath with a little help from mcbuster 2.0d",
    "nutrition": {
      "Calories": 1401.75,
      "Total fat": 39.22000000000001,
      "Saturated fat": 13.660000000000002,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 66.75,
      "Sodium": 5169.870000000001,
      "Total carbs": 231.80999999999997,
      "Fiber": 53.8,
      "Sugar": 54.940000000000005,
      "Protein": 60.44999999999999
    }
  },
  {
    "keyword": "Mexican",
    "title": "Mcdougall Mexican Zucchini",
    "ingredients": "2 md Zucchini thinly sliced, 1 lg Carrot coarsely grated, 1 md Onion chopped, 2 Stalks Celery chopped, 1/2 md Green Pepper thinly sliced, 2 md Tomatoes sliced, 1 c Mild Green Chili Salsa, 1/4 ts Dried Basil, 1 Clove Garlic crushed, 2 ts Prepared Mustard",
    "servings": "6 servings",
    "instructions": "Prepare vegetables as directed and layer in a casserole dish, all except for the tomatoes. Combine ingredients for the sauce (salsa, basil, garlic and mustard) and pour over the layered vegetables. Place sliced tomatoes over the top. Cover and bake at 325 degrees for 45 minutes. Remove cover and bake for 15 minutes longer. Helpful Hints: Serve with grains such as brown rice or bulgur wheat.",
    "nutrition": {
      "Calories": 272.52000000000004,
      "Total fat": 3.1399999999999997,
      "Saturated fat": 0.51,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 500.68999999999994,
      "Total carbs": 58.699999999999996,
      "Fiber": 14.990000000000002,
      "Sugar": 32.16,
      "Protein": 13.639999999999999
    }
  },
  {
    "keyword": "Mexican",
    "title": "Mexican Bananas Foster",
    "ingredients": "3/4 c Packed light brown sugar, 3/4 c Kahlua or other coffee flavored liquor, 12 tb Unsalted butter cut into tablespoons (1 1/2 sticks), 6 Ripe bananas peeled and cut into 1/2-inch thick rounds, Ground cinnamon to taste, Vanilla ice cream",
    "servings": "1 servings",
    "instructions": "Build a charcoal fire in an outdoor grill and let burn until the coals are covered with white ash. Let the fire burn down to medium-hot (you should be able to hold your hand at grate level for 3 seconds). In a gas grill, preheat to Medium. Tear off six 12-inch squares of aluminum foil. Fold one foil square in half. On the bottom half, place 2 tablespoons brown sugar, 2 tablespoons Kahlua, 2 tablespoons butter, and 1 banana. Sprinkle with a pinch of cinnamon. Fold the foil over to form a packet, crimping the open edges to seal. Repeat with the remaining ingredients. The packets can be prepared up to 1 hour ahead and kept at room temperature. Grill the packets until the sugar, Kahlua, and butter are boiling, 5 to 7 minutes. Open the packets, pour over bowls of ice cream and serve immediately. Yield: 6 servings",
    "nutrition": {
      "Calories": 2730.7300000000005,
      "Total fat": 155.08000000000004,
      "Saturated fat": 95.75,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 424.28,
      "Sodium": 173.81,
      "Total carbs": 323.98999999999995,
      "Fiber": 20.020000000000003,
      "Sugar": 243.29,
      "Protein": 14.280000000000001
    }
  },
  {
    "keyword": "Mexican",
    "title": "Mexican Beef And Bean-Stuffed Peppers",
    "ingredients": "1 1/2 c Fiber One® Cereal, 15 oz Tomato puree, 4 md Bell peppers, 1/2 lb Extra-lean ground beef, 1 md Onion finely chopped -1/2 cup, 8 oz Kidney beans rinsed and drained, 4 oz Chopped green chilies undrained, 2 ts Chili powder, 1/2 ts Ground cumin, Shredded reduced-fat cheddar cheese if desired",
    "servings": "8 Servings",
    "instructions": "1. Heat oven to 350°. Crush cereal.* Mix cereal and tomato puree; let stand 5 minutes. 2. Cut bell peppers lengthwise in half. Remove seeds and membranes. Place peppers, cut sides up, in rectangular baking dish, 13x9x2 inches. 3. Cook beef and onion in 10-inch skillet over medium heat, stirring occasionally, until beef is brown; drain. Stir in cereal mixture and remaining ingredients except cheese. Divide beef mixture evenly among peppers. 4. Cover and bake 40 to 45 minutes or until peppers are tender. Sprinkle each pepper with 1/2 tablespoon cheese; let stand 5 minutes. 8 servings. *Place cereal in plastic bag; crush with rolling pin. Or crush in blender or food processor. Serving Size: 1 Serving. Calories 130 (Calories from fat 35); Fat 4g (Saturated 1 g); Cholesterol 20mg; Sodium 470mg; Carbohydrate 21g (Dietary Fiber 7g); Protein 9g % Dally Value: Vitamin A 26%; Vitamin C 40%; Calcium 4%; Iron 20% Diet Exchanges: 1 starch, 1 lean meat",
    "nutrition": {
      "Calories": 1232.9099999999999,
      "Total fat": 20.6,
      "Saturated fat": 8.37,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 207.79999999999998,
      "Sodium": 874.97,
      "Total carbs": 164.32,
      "Fiber": 35.260000000000005,
      "Sugar": 44.800000000000004,
      "Protein": 112.57000000000001
    }
  },
  {
    "keyword": "Mexican",
    "title": "Mexican Beef Brisket",
    "ingredients": "3 1/2 lb Beef brisket, 1 tb Coarse salt, 2 ts Freshly-ground black pepper, Flour for dredging, 1/2 c Vegetable oil, 3 lg Carrots peeled, and, Cut 2\" lengths, 2 md Onions chopped, 10 Garlic cloves peeled, minced, 3 Dried chipotle or morita chiles, 2 tb Tomato paste, 1 tb Dried oregano, 2 qt Chicken stock or water, 5 Bay leaves, Salt to taste, 4 Scallions white and light green parts, thinly sliced, On the diagonal for garnish",
    "servings": "1 servings",
    "instructions": "Preheat oven to 325 degrees. Sprinkle the brisket with the coarse salt and pepper. Dredge in flour to coat and shake off any excess. In a large Dutch oven heat oil over high heat. Sear the meat until browned on all sides. Set aside. Reduce heat to moderate and add the carrots and onions. Cook, stirring occasionally, until golden brown, 8 to 10 minutes. Add the garlic and saute 2 minutes longer. Return the meat to the pan along with all remaining ingredients except the salt and garnishes. Bring to a boil, cover the pot and transfer to the oven. Bake for 2 1/2 hours, or until the meat slips off a fork when pierced. Lift out the brisket and place on a cutting board. Cover with a damp towel. Pour the broth with vegetables into a tall container and skim off the layer of fat that rises. Remove and discard the bay leaves and chiles. Pour the broth and vegetables into a blender or a food processor fitted with the metal blade. Puree until smooth, add salt to taste and strain. Reheat the sauce. Slice the brisket against the grain and arrange on a platter. Pour the warm sauce over it, sprinkle with sliced scallions and serve. This recipe yields ?? servings.",
    "nutrition": {
      "Calories": 6483.150000000001,
      "Total fat": 410.3999999999999,
      "Saturated fat": 126.22999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1697.23,
      "Sodium": 8524.050000000001,
      "Total carbs": 182.77999999999997,
      "Fiber": 21.27,
      "Sugar": 35.12,
      "Protein": 493.72000000000014
    }
  },
  {
    "keyword": "Chinese",
    "title": "Green Pak Choi (Chinese Cabbage) with Soya Sauce",
    "ingredients": "1 lb Green pak choi, 1 tb Oil, 1 tb Soya sauce, 2 Cloves sliced garlic",
    "servings": "1 servings",
    "instructions": "Wash pak choi and drain well. Heat oil and add the garlic then the pak choi. Stir constantly until the pak choi changes colour. Add the soya sauce to taste. Serve hot.",
    "nutrition": {
      "Calories": 278.62,
      "Total fat": 18.39,
      "Saturated fat": 1.6099999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 2.64,
      "Sodium": 743.3100000000001,
      "Total carbs": 22.52,
      "Fiber": 9.040000000000001,
      "Sugar": 10.69,
      "Protein": 11.299999999999999
    }
  },
  {
    "keyword": "Chinese",
    "title": "Hot and Sour Chinese Soup",
    "ingredients": "Hot & Sour Chinese Soup, 3 c Chicken broth, 1 tb Soy sauce, reduced-, Sodium, 4 Chinese mushrooms,, Dried, soaked for 15, Minutes in boiling, Water, stems removed, No. 219 Yields 2 Servings, 1 Cake soybean curd (tofu),, Cut into 2-inch strips, 1/4 Wide, 1/4 ts White pepper, 2 tb Lemon juice, 2 tb Cornstarch, mixed with, 3 tb Water, cold",
    "servings": "1 Servings",
    "instructions": "and caps cut into fine 1 egg, lightly beaten strips 2 tsps Oriental sesame oil, 1/2 cup bamboo shoots, cut in- or to 2-inch strips, 1/4- 1/4 tsp hot chili oil inch wide scallions, finely 1/4 lb pork, raw, lean, cut ",
    "nutrition": {
      "Calories": 614.7900000000001,
      "Total fat": 22.310000000000002,
      "Saturated fat": 5.5,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 138.78,
      "Sodium": 5739.9,
      "Total carbs": 83.46,
      "Fiber": 4.19,
      "Sugar": 39.11,
      "Protein": 22.14
    }
  },
  {
    "keyword": "Chinese",
    "title": "Chicken with Chinese Mushrooms",
    "ingredients": "1 c Soy sauce or more to taste, 1 ts Chopped fresh ginger, 1/2 ts Baking soda, 1 tb Sesame oil, Salt & pepper to taste, 2 Boneless chicken breasts diced 1-inch pieces, 2 tb Cooking oil, 1 c Onioncoarsely diced, 1/2 c Bamboo shoots, 1/2 c Water chestnuts, 1 c Diced Chinese cabbage, 1 c Coarsely chopped broccoli, 1 c Bean sprouts, 3 lg Chinese Black mushrooms diced, 1 pn (large) sugar, 1 pn (large) five-spice powder, 1 Splash oyster sauce, 1 Splash soy sauce, 1 c Chicken broth, 2 tb Cornstarch, 1/4 c Cold water",
    "servings": "4 Servings",
    "instructions": "Combine 1 cup soy sauce, the ginger, baking soda, sesame oil, & a pinch each of salt & pep- per to make a marinade. Marinate the chicken for 2 hours, drain, & set aside. Preheat a wok over high heat w/ 2 tbs. cooking oil. Add onion & lightly stir-fry. Stir in chicken & then the remaining vegetables. Add sugar, five-spice powder, oyster sauce, & a splash of soy sauce. Add Chicken Broth & bring to boil. Mix corn- starch w/ water to make smooth paste. Slowly pour into Chicken Broth, stirring constantly until stock thickens & becomes clear. Serve. Note: Chinese black mushrooms are available fresh in some larger markets. Otherwise, you can buy them dried. With these, soak to recon- stitute,remove stems, & dice buttons. ORIENT EXPRESS KETCHUM; SUN VALLEY BEVERAGE: TSINGTAO BEER",
    "nutrition": {
      "Calories": 1183.0,
      "Total fat": 53.78000000000001,
      "Saturated fat": 6.699999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 208.98,
      "Sodium": 17549.609999999997,
      "Total carbs": 72.71000000000001,
      "Fiber": 13.110000000000003,
      "Sugar": 17.409999999999997,
      "Protein": 108.23
    }
  },
  {
    "keyword": "Chinese",
    "title": "Chicken with Chinese Vegetables",
    "ingredients": "1 tb Vegetable oil, 4 Skinnless boneless chicken breasts, cut in bite-sized pieces, 1 Onion chopped, 4 Stalks celery chopped, 2 Cloves garlic minced, 1 cn (4.5 oz) mushrooms stems and pieces, 1 cn (28-oz) chop suey vegetables, 1/4 c Soy sauce, 1 cn Chicken broth, Cooked rice or chow mein noodles",
    "servings": "1 Servings",
    "instructions": "Brown chicken in vegetable oil. Add onions, celery and garlic, cook until browned. Drain chop suey vegetables, add to chicken mixture. Drain and add mushrooms. Add soy sauce and chicken broth. Cover, reduce heat, and simmer for about 30 minutes. Serve over cooked rice or chow mein noodles.",
    "nutrition": {
      "Calories": 1571.4700000000003,
      "Total fat": 44.7,
      "Saturated fat": 7.939999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 448.88,
      "Sodium": 5839.0,
      "Total carbs": 100.22999999999999,
      "Fiber": 11.719999999999999,
      "Sugar": 14.249999999999998,
      "Protein": 182.61999999999998
    }
  },
  {
    "keyword": "Chinese",
    "title": "Chinese Barbecue Sauce - Char Sui",
    "ingredients": "1/2 c Sherry, 4 Cloves garlic, 6 tb Soy sauce, 2 ts Plum sauce, 2 tb Black bean paste, 6 tb Hoisin sauce, 2 ts Salt, 1 1/2 ts Chinese 5-spice, 1/2 c Sugar",
    "servings": "13 Servings",
    "instructions": "Mix together well. Heat in double boiler - add cornstarch for thickening.",
    "nutrition": {
      "Calories": 834.61,
      "Total fat": 4.69,
      "Saturated fat": 0.7600000000000001,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 2.88,
      "Sodium": 8908.4,
      "Total carbs": 182.23,
      "Fiber": 6.989999999999999,
      "Sugar": 128.79,
      "Protein": 14.899999999999999
    }
  },
  {
    "keyword": "Indian",
    "title": "Mee Goreng (Fried Noodles Indian-Style)",
    "ingredients": "5 oz Oil noodles or spaghetti, 2 tb Oil, 4 oz Peeled prawns or skinless boned chicken diced meat, 1 sm Onion chopped, 4 oz Cabbage sliced, 1 sm Tomato sliced, 1 4 inch piece celery chopped, 2 Cloves garlic crushed, 1 Chilli crushed, 1/2 Boiled potato diced, 1 Egg beaten, 1 tb Tomato ketchup, 2 tb Soy sauce, 1/4 ts Salt, 1/2 ts Sugar, 4 oz Beansprouts, 1 Lemon juice of, 2 Sprigs coriander chopped, up to 3",
    "servings": "1 servings",
    "instructions": "If using spaghetti, cook it in boiling water until just tender, then drain and toss in a tablespoon of olive oil to stop it sticking together. No need to prepare the oil noodles. Heat the oil in a wok or frying pan and fry the garlic, onion, cabbage, celery, potato and prawns or chicken. Add the noodles and stir fry for 10 minutes more. Make a gap in the centre of the noodles and add the egg. Stir it in to scramble it. Add the chilli, tomato, tomato ketchup, soy sauce, salt and sugar. Stir well. Just before transferring to a plate, add the beansprouts and stir for about 30 seconds. Sprinkle with lemon juice and chopped coriander to serve.",
    "nutrition": {
      "Calories": 3372.4199999999996,
      "Total fat": 238.35000000000002,
      "Saturated fat": 32.64000000000001,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 709.93,
      "Sodium": 5497.379999999999,
      "Total carbs": 169.80000000000004,
      "Fiber": 16.420000000000005,
      "Sugar": 30.340000000000003,
      "Protein": 144.75
    }
  },
  {
    "keyword": "Indian",
    "title": "Chapati with Spicy Potato Filling (Indian)",
    "ingredients": "1 tb Oil, 2 Onions, 1 Dessertspoon ground chillies, 2 Potatoes, mashed, 1 md Carrot, grated, 1 ts Salt, 1 Stalk spring onion, chopped, 1 Sprig coriander leaves, 500 g Wholemeal flour (atta), 1 1/2 c Water, 1/2 ts Salt, 3 tb Ghee",
    "servings": "16 Chapatis",
    "instructions": "Heat oil and lightly brown onions. Add chillies, mashed potatoes, grated carrot, salt and chopped spring onion and coriander leaves. Mix well. Remove from heat and allow to cool. Put wholemeal flour into a mixing bowl with salt. Mix into a firm ball of dough by adding water a little at a time. Spread 1 tablespoon of ghee on the dough and continue kneading. Repeat with another tablespoon of ghee. Lastly spread the last tablespoon of ghee onto the lump of dough and allow to stand for 30 minutes. Divide into small balls of dough. Flatten dough with the palm of your hands. Dip both sides into a little flour. Place chapati on a wooden board and roll out with a rolling pin. Brush with a little ghee and spread 1 tablespoon of spicy potato filling evenly on surface. Fold into half and then fold again to seal filling. Dip again into flour and roll out again into a thin square of chapati. Place chapati onto a flat pan over medium heat and brown both sides. Brush chapati with ghee on both sides while frying. Serve with your favourite curry, dhal or plain yoghurt.",
    "nutrition": {
      "Calories": 2757.4500000000003,
      "Total fat": 82.94,
      "Saturated fat": 30.06,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 102.55,
      "Sodium": 2335.34,
      "Total carbs": 459.37,
      "Fiber": 64.99,
      "Sugar": 21.130000000000003,
      "Protein": 78.56
    }
  },
  {
    "keyword": "Indian",
    "title": "Chipati (Indian Griddle Fried Flat Bread)",
    "ingredients": "3 c Whole wheat flour, 1 ts Salt, 1 c Water, 1 tb Ghee, Yield - 20-24 Chipati",
    "servings": "4 Servings",
    "instructions": "Sift flour and salt together in a bowl. Make a well in the center and add ghee and water. Knead 10 minutes to make a pliable dough, form into a ball, cover and allow to rest at least 1 hour, or over night. Divide dough into 20-24 portions. Roll into 6 inch circles and allow to rest 5 minutes. Heat griddle or cast iron fry pan very hot. Place a chipati on the griddle or fry pan, fry for 1 minute. Flip over and fry for 1 minute.",
    "nutrition": {
      "Calories": 1336.18,
      "Total fat": 21.740000000000002,
      "Saturated fat": 9.48,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 32.78,
      "Sodium": 598.3000000000001,
      "Total carbs": 259.09,
      "Fiber": 38.52,
      "Sugar": 1.48,
      "Protein": 47.6
    }
  },
  {
    "keyword": "Thai",
    "title": "Green Thai Curry",
    "ingredients": "1 1/2 kg Roasting chicken (3lbs), 225 ml Coconut milk (8fl oz), 3 ts Green curry paste, 2 Sprigs tender citrus leaves, 1 ts Salt, 2 tb Fish sauce, 2 tb Finely chopped fresh green chillies seeds removed, 4 tb Finely chopped fresh basil or coriander leaves",
    "servings": "1 servings",
    "instructions": "Divide the chicken into joints. Heat a cupful of coconut ?cream? (scooped off the top of the milk, after it has been left to stand for a while) in a large heavy saucepan, stirring occasionally, until the cream thickens and oil bubbles around. By this time it should be reduced to a quarter of the original amount. Add the curry paste and fry the rich oily cream for about 5 minutes, stirring constantly. The curry paste will smell cooked, and the oil will seperate from it when it is ready. When this happens add the pieces of chicken and cook over a medium low heat, stirring frequently and turning them, for about 15 minutes. The chicken will change colour and have cooked appearance. Add the remaining coconut milk, citrus leaves, salt and fish sauce and stir while the coconut milk comes to the boil. Then turn the heat down and allow to simmer uncovered for about 35 to 40 minutes, or until the chicken is well cooked and tender and the gravy is rich and oily. Stir in the chopped fresh chillies and heabs, simmer for 5 minutes longer and then turn onto a serving dish. Serve with rice. 1/2 Fat; 1/2 Other Carbohydrates",
    "nutrition": {
      "Calories": 4303.54,
      "Total fat": 263.35999999999996,
      "Saturated fat": 100.5,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1354.04,
      "Sodium": 6776.48,
      "Total carbs": 33.089999999999996,
      "Fiber": 2.55,
      "Sugar": 2.6199999999999997,
      "Protein": 431.7
    }
  },
  {
    "keyword": "Thai",
    "title": "Hot and Sour Shrimp Soup (Thai)",
    "ingredients": "1 lb Medium shrimp, 2 Sticks fresh lemongrass OR Dried lemongrass, 4 Kaffir lime leaves (fresh or dried) -OR- Finely grated lemon zest, 1 1/2 qt Chicken stock, 1 tb Fish sauce or salt to taste, 3 tb Fresh lime juice or to taste, 1 ts Thai chili paste (nam prik pow) OR see NOTE, 15 oz Canned straw mushrooms -OR- Fresh mushrooms, 3 Fresh hot green chilies, 3 tb Cilantro",
    "servings": "6 Servings",
    "instructions": "NOTE: The following mixture may be substituted for 1 teaspoon Thai chili paste: 1/4 ts cayenne, 1/4 tsp sugar and 1/2 tsp oil Wash, peel, de-vein shrimp. Save shells. Wash shrimp again, drain, pat dry, cover and refrigerate. If using fresh lemongrass, cut each stick into three 2 inch pieces--starting from rounded bottom end. Discard straw-like top. Lightly crush the 6 pieces. In a pan, combine lemongrass, lime leaves, stock, and shrimp shells. Bring to boil. Lower heat and simmer gently for 20 minutes. Strain stock, then add fish sauce, lime juice, and chili paste. Adjust fish sauce and lime juice to taste. *Add more chili paste for more heat. Drain straw mushrooms and add to stock. (If using fresh mushrooms, quarter them and drop in lightly salted boiling water. Boil 1 minute. Drain and add to stock.) **The soup can be prepared to this point several hours ahead of time and stored in the refrigerator.** Prepare garnish shortly before serving. Cut green chilies into fine rounds. Wash and dry cilantro. Just before serving, heat the soup, when it begins to boil, drop in peeled shrimp. Cook on medium heat for 2 minutes or just until shrimp turn opaque. Garnish with chilies and cilantro leaves. Serve hot.",
    "nutrition": {
      "Calories": 1102.53,
      "Total fat": 17.279999999999998,
      "Saturated fat": 4.2700000000000005,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 968.57,
      "Sodium": 8522.77,
      "Total carbs": 111.94,
      "Fiber": 14.13,
      "Sugar": 16.35,
      "Protein": 136.79999999999998
    }
  },
  {
    "keyword": "Thai",
    "title": "Hot and Sour Shrimp Soup (Thai)",
    "ingredients": "1 lb Medium shrimp, 2 Sticks fresh -or-, 2 tb Dried lemongrass, 4 Fresh or dried kaffir lime leaves -or-, 1 tb Finely grated lemon zest, 1 1/2 qt Chicken stock, 1 tb Fish sauce or salt to taste, 3 tb Fresh lime juice or to taste, 1 ts Thai chili paste(nam prik pow) or substitute 1/4 tsp cayenne, 1/4 tsp sugar, 1/2 tsp oil, 1 cn (15 oz) straw mushrooms -or-, 12 md Fresh mushrooms, 3 Fresh hot green chilies, 3 tb Cilantro",
    "servings": "1 Servings",
    "instructions": "Wash, peel, de-vein shrimp. Save shells. Wash shrimp again, drain, pat dry, cover and refrigerate. If using fresh lemongrass, cut each stick into three 2 inch pieces--starting from rounded bottom end. Discard straw-like top. Lightly crush the 6 pieces. In a pan, combine lemongrass, lime leaves, stock, and shrimp shells. Bring to boil. Lower heat and simmer gently for 20 minutes. Strain stock, then add fish sauce, lime juice, and chili paste. Adjust fish sauce and lime juice to taste. *Add more chili paste for more heat. Drain straw mushrooms and add to stock. (If using fresh mushrooms, quarter them and drop in lightly salted boiling water. Boil 1 minute. Drain and add to stock.) **The soup can be prepared to this point several hours ahead of time and stored in the refrigerator.** Prepare garnish shortly before serving. Cut green chilies into fine rounds. Wash and dry cilantro. Just before serving, heat the soup, when it begins to boil, drop in peeled shrimp. Cook on medium heat for 2 minutes or just until shrimp turn opaque. Garnish with chilies and cilantro leaves. Serve hot.",
    "nutrition": {
      "Calories": 880.07,
      "Total fat": 16.77,
      "Saturated fat": 3.969999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 967.88,
      "Sodium": 7519.750000000002,
      "Total carbs": 58.010000000000005,
      "Fiber": 10.87,
      "Sugar": 18.930000000000003,
      "Protein": 126.72999999999999
    }
  },
  {
    "keyword": "Thai",
    "title": "Bhud Thai (Flat Noodles with Prawn, Chicken And Peanuts)",
    "ingredients": "50 g Dry flat rice noodles, 4 oz Prawns peeled and deveined, 4 oz Chicken, 2 oz Peanuts, 2 Cloves garlic, 2 tb Tamarind pulp, 1 Whole chilli, 3 tb Fish sauce, 4 Floz stock, 1 Egg, 2 oz Beansprouts, 1 Stalk spring onion, 1 tb Sugar, 2 tb Oil, 1 Inch lemongrass",
    "servings": "1 servings",
    "instructions": "Soak the noodles in cold water, being careful not to break them. They will take a long time to soften. Soak the tamarind pulp with 1/2 cup water. Slice the chicken into thin pieces. Crush the garlic and the chilli. Bash the lemongrass and grind the peanuts. Heat the oil and fry the garlic. Add the lemongrass, chicken, prawns. chilli and egg and stir well. Add the noodles and continue to stir. Add the fish sauce, tamarind juice, stock, sugar and spring onion. Lastly add the beansprouts, stir quickly and remove. Garnish with peanuts.",
    "nutrition": {
      "Calories": 2198.78,
      "Total fat": 123.93,
      "Saturated fat": 26.559999999999995,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 661.26,
      "Sodium": 9070.289999999999,
      "Total carbs": 136.37,
      "Fiber": 10.030000000000001,
      "Sugar": 45.129999999999995,
      "Protein": 140.07999999999998
    }
  },
  {
    "keyword": "Thai",
    "title": "Cha Thai (Iced Tea)",
    "ingredients": "Stephen Ceideburg, 3 tb Thai tea (cha thai), 6 oz Boiling water, Sugar or:, Sweetened Condensed Milk to taste, Milk or:, Half-and-Half",
    "servings": "6 Servings",
    "instructions": "1. Place tea in a coffee filter in a drip cone. Preheat carafe with boiling water; discard water. Pour 6 ounces boiling water per serving into cone and let it drip through. Transfer brew to another container, then pour back through filter. Repeat until tea is deep red in color, a total of 4 to 6 times. 2. Sweeten tea to taste with sugar or condensed milk. Fill tall glasses with ice cubes and add tea to fill glasses halfway. Add milk or half-and-half and stir. Variation: The tea may be brewed in a teapot, but it will still need to be filtered through a paper filter or a very fine nylon strainer. Preheat pot with boiling water and allow to steep 6 to 8 minutes before straining.",
    "nutrition": {
      "Calories": 303.8,
      "Total fat": 11.03,
      "Saturated fat": 7.06,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 42.14,
      "Sodium": 185.02,
      "Total carbs": 40.34,
      "Fiber": 0.0,
      "Sugar": 40.75,
      "Protein": 11.9
    }
  },
  {
    "keyword": "Greek",
    "title": "Greek Couscous",
    "ingredients": "1 1/2 c Water, 1 c Couscous, 1/2 ts Dried Oregano, 1 1/2 c Plum Tomatoes Diced, 1 c Cucumber Peeled And Diced, 1/3 c Crumbled Feta Cheese, 1/4 c Ripe Olives Halved, 3 tb Diced Red Onion, 15 1/2 oz Chickpeas Canned, Drained, 1/4 c Water, 3 tb Lemon Juice, 1 1/2 tb Extra-Virgin Olive Oil, 1/4 ts Salt, 1/4 ts Coarsely Ground Pepper",
    "servings": "4 servings",
    "instructions": "Bring 1 1/2 cups water to a boil in a medium saucepan; stir in couscous and oregano. Remove from heat; cover and let stand 5 minutes. Fluff with a fork. Combine couscous, tomatoes, and next 5 ingredients (tomatoes through chickpeas) in a bowl; set aside. Combine 1/4 cup water and remaining ingredients; stir well with a whisk. Pour dressing over couscous mixture, tossing gently to coat.",
    "nutrition": {
      "Calories": 1542.18,
      "Total fat": 47.06,
      "Saturated fat": 12.109999999999998,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 44.06,
      "Sodium": 938.5099999999999,
      "Total carbs": 225.17000000000002,
      "Fiber": 44.04,
      "Sugar": 34.44,
      "Protein": 62.970000000000006
    }
  },
  {
    "keyword": "Greek",
    "title": "Greek Duck with Olives",
    "ingredients": "4 lb Duck cut into 6 pieces, 3 tb Olive oil, 1 Yellow onion peeled and sliced, 2 c Greek Tomato Sauce see * Note, 1/2 c Dry red wine, 1 c Green olives, Salt to taste, Freshly-ground black pepper to taste",
    "servings": "6 servings",
    "instructions": "* Note: See the \"Greek Tomato Sauce\" recipe which is included in this collection. Heat a 6-quart stove-top casserole and add the oil. Brown the duck pieces and remove from the pan. Saute the onion and then add all ingredients to the pot. Cover and bring to a simmer. You may need a bit of water. Simmer until tender, about 1 1/2 hours. Watch that it does not dry out, in which case you must add a bit more water. This recipe serves 6. Comments: This dish is a smash. I tasted it for the first time in a fine restaurant on the outskirts of Athens and the recipe is simple to duplicate. You will have no problem with this one.",
    "nutrition": {
      "Calories": 8856.080000000002,
      "Total fat": 793.84,
      "Saturated fat": 213.85999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1524.07,
      "Sodium": 7516.11,
      "Total carbs": 48.81,
      "Fiber": 16.729999999999997,
      "Sugar": 23.85,
      "Protein": 354.36999999999995
    }
  },
  {
    "keyword": "Greek",
    "title": "Greek Easter Braided Bread",
    "ingredients": "2 pk Active dry yeast - (1/4 oz ea), 2 c Warm milk, 9 c All-purpose flour plus more, 1 1/2 c Sugar, 2 ts Mahlepi see * Note, 1 Stick unsalted butter melted, cooled, Butter for bowl and baking sheet, 6 lg Eggs, 1 tb Orange zest grated, 1 tb Lemon zest grated, 1/2 ts Salt, 4 Hard-boiled eggs dyed red, 1 tb Sesame seeds",
    "servings": "1 servings",
    "instructions": "* Note: A fruity spice available at Greek food stores. In a large bowl, dissolve yeast in milk. Stir in 1 cup flour and 1/2 cup sugar. Cover bowl with plastic wrap, and set aside for 1 hour. Meanwhile, steep mahlepi in 1/2 cup simmering water. Let stand for 5 minutes. Strain, and discard mahlepi. Let cool. Add mahlepi infusion, butter, and five eggs to yeast mixture, and combine thoroughly. Add orange and lemon zest. Sift in flour, sugar, and salt; stir with a wooden spoon until dough is formed. Knead dough in bowl until smooth, about 10 minutes. Form dough into a ball, and transfer to a lightly buttered bowl. Cover, and let rise for 2 hours. Punch dough down, and transfer to a lightly floured surface. Divide dough into six equal pieces. Roll each piece of dough into a rope, about 15-inches long. Tightly braid three ropes together, beginning in the middle. Repeat with remaining three ropes. Tuck a red egg into the first and last plait, using a small piece of dough coiled around each egg to hold in place, if necessary. Place each loaf on a buttered baking sheet, cover loosely with plastic wrap, and set aside to rise for 1 hour. Heat oven to 350 degrees. Beat remaining egg with 1 tablespoon water. Brush bread with egg wash, and sprinkle with sesame seeds. Transfer to oven, and bake until golden, 50 to 60 minutes. Makes 2 large loaves.",
    "nutrition": {
      "Calories": 6628.92,
      "Total fat": 109.48,
      "Saturated fat": 46.03,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1992.63,
      "Sodium": 1319.4900000000002,
      "Total carbs": 1195.3,
      "Fiber": 34.93,
      "Sugar": 331.96000000000004,
      "Protein": 200.29000000000005
    }
  },
  {
    "keyword": "Greek",
    "title": "Greek Fetta Dressing",
    "ingredients": "80 g Mild fetta cheese, 3 tb Plain yoghurt, 1 Lemon juice of, 1 ts Fresh chopped mint, 1 tb Fresh chopped marjoram, 1 ts Fresh chopped oregano, 1 Clove garlic minced, Cracked black pepper",
    "servings": "1 servings",
    "instructions": "Process the fetta, yoghurt and lemon until smooth then fold in the herbs, garlic and pepper. Thin with a little extra lemon juice or water if desired. Per serving: 16 Calories (kcal); trace Total Fat; (4% calories from fat); 1g Protein; 7g Carbohydrate; 0mg Cholesterol; 2mg Sodium Food Exchanges: 0 Grain(Starch); 0 Lean Meat; 0 Vegetable; 1/2 Fruit; 0 Fat; 0 Other Carbohydrates",
    "nutrition": {
      "Calories": 376.35,
      "Total fat": 27.56,
      "Saturated fat": 15.579999999999998,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 81.75,
      "Sodium": 556.7,
      "Total carbs": 11.910000000000002,
      "Fiber": 1.8199999999999998,
      "Sugar": 4.86,
      "Protein": 21.29
    }
  },
  {
    "keyword": "Greek",
    "title": "Greek Grainberry Salad",
    "ingredients": "1 c Spelt berries, 4 c Water, 1/2 c Thinly sliced red onion, 1/2 c Julienned seedless cucumber, 1/2 c Julienned red pepper, 2 tb Minced fresh dill, 1 tb Minced fresh mint, 1/4 c Extra virgin olive oil, 3 tb Fresh lemon juice, 1 Garlic clove minced, 1/2 c Crumbled feta cheese (optional), Salt and white pepper",
    "servings": "6 servings",
    "instructions": "6 servings 1. In a medium saucepan, combine spelt berries and water. Bring to a boil, then reduce heat and simmer for 1 hour, or until just render. Drain well and chill. 2. In a large bowl, combine chilled spelt, onion, cucumber, red pepper, dill, mint, olive oil, lemon juice, and garlic. Fold in feta cheese, if desired. Season to taste with salt and pepper, and refrigerate until served. LACT0/VEGAN PER SERVING: 190 CAL (43% from fat) 5g PROT. 9g FAT. 23g CARB. 62mg SOD. 0mg CHOL, 5g FIBER",
    "nutrition": {
      "Calories": 1089.5700000000002,
      "Total fat": 72.86,
      "Saturated fat": 18.830000000000002,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 66.75,
      "Sodium": 1327.85,
      "Total carbs": 94.54999999999998,
      "Fiber": 16.95,
      "Sugar": 22.560000000000002,
      "Protein": 26.07
    }
  },
  {
    "keyword": "French",
    "title": "Electronic Gourmet's French Dressing",
    "ingredients": "1/4 c Red or White Wine Vinegar, 1/4 ts Salt, 1/8 ts White Pepper, 3/4 c Olive Oil",
    "servings": "1 Cup",
    "instructions": "In a bowl mix vinegar, salt and pepper with a fork. Add oil and mix vigerously until well blended and slightly thickened. Variations: ========== Garlic French Dressing: Drop 1 peeled, bruised clove of garlic into dressing and let stand 2-3 days at room temperature. Remove garlic before using dressing. Sweet French Dressing: Prepare as directed. Then mix in 1/4 c each of orange juice and honey or super fine sugar. Use to dress fruit salads. Hints: ===== For a creamier dressing, beat over ice for 1 to 2 minutes.",
    "nutrition": {
      "Calories": 1443.6799999999998,
      "Total fat": 162.01,
      "Saturated fat": 22.37,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 149.78,
      "Total carbs": 0.22,
      "Fiber": 0.08,
      "Sugar": 0.02,
      "Protein": 0.03
    }
  },
  {
    "keyword": "French",
    "title": "Electronic Gourmet's French Onion Soup",
    "ingredients": "1 1/2 lb Yellow Onions, thinly sliced, (about 5 cups), 3 tb Butter, 1 tb Oil, 1 ts Salt, 1/4 ts Sugar, 3 tb Flour, 8 c Boiling Brown Stock, 1/2 c Dry White Wine or Vermouth, 3 tb Cognac, Rounds of Hard Toasted Bread, 2 c Swiss Cheese, grated",
    "servings": "6 Servings",
    "instructions": "1) Cook the onions slowly with the butter and oil in a covered saucepan for 15 minutes. 2) Uncover, raise the heat to moderate and stir in the salt and sugar. Cook for 30 to 40 minutes stirring frequently until the onions have turned and even, deep golden brown. 3) Sprinkle in the flour and stir 3 minutes. 4) Off heat, blend in the boiling liquid. Note that instead of brown stock you may use canned beef bouillon (same quantity). Or, and equal part of boiling water plus stock or bouillon. 5) Add the wine and season to taste. Simmer partially covered for 30 to 40 minutes or more, skimming occasionally. Correct Seasoning. 6) Set aside uncovered until ready to serve, then reheat to simmer. 7) Just before serving, stir in the cognac. Pour into french onion soup bowls over the rounds of bread. Cover with cheese. Bake at 350 F until cheese melts.",
    "nutrition": {
      "Calories": 3956.2999999999993,
      "Total fat": 286.51,
      "Saturated fat": 160.6,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 738.77,
      "Sodium": 5292.660000000001,
      "Total carbs": 178.46,
      "Fiber": 10.8,
      "Sugar": 68.55,
      "Protein": 128.68
    }
  },
  {
    "keyword": "French",
    "title": "Ella's French Toast with Orange and Triple Sec",
    "ingredients": "Stephen Ceideburg, 3 Eggs, 1/2 c Heavy cream, Grated zest and juice of 1 orange, 1 tb Triple Sec, 1/4 ts Vanilla, 1/4 ts Grated nutmeg, 8 Thick slices of day old white bread, 4 tb Sweet butter, Fruit preserves or maple syrup (optional)",
    "servings": "4 Servings",
    "instructions": "Beat eggs in a large bowl with the cream, orange zest and juice, Triple Sec, vanilla and nutmeg. Soak bread slices in the batter for 15 minutes. Melt the butter in 1 or 2 large saute pans, or on a griddle. Regulate the heat so butter doesn't burn. Saute bread slowly in the bitter. The heat should not be too high, or the bread won't cook through. Saute on both sides until golden brown. Serve with fruit preserves or maple syrup, if desired. PER SERVING: 475 calories, 11 g protein, 44 g carbohydrate, 29 g fat (16 g saturated), 177 mg cholesterol, 484 mg sodium, 1 g fiber.",
    "nutrition": {
      "Calories": 1454.1399999999999,
      "Total fat": 104.84,
      "Saturated fat": 61.72,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 814.94,
      "Sodium": 917.5099999999998,
      "Total carbs": 99.69,
      "Fiber": 4.49,
      "Sugar": 72.01,
      "Protein": 27.150000000000002
    }
  },
  {
    "keyword": "French",
    "title": "English Muffin French Toa",
    "ingredients": "2 1/4 qt WATER, 126 EGGS SHELL, 8 oz MILK DRY NON-FAT L HEAT, 12 1/2 lb BREAD ENG MFFN 12OZ #95, 1 1/2 lb SUGAR GRANULATED 10 LB",
    "servings": "100 Servings",
    "instructions": "TEMPERATURE: 375 F. GRIDDLE 1. PLACE WATER IN MIXER BOWL. 2. COMBINE MILK AND SUGAR; BLEND WELL. ADD TO WATER; STIR UNTIL DISSOLVED. 3. ADD EGGS TO INGREDIENTS IN MIXER BOWL; WHIP UNTIL WELL BLENDED. 4. CUT MUFFINS IN HALF; DIP SPLIT MUFFINS IN BATTER 30 SECONDS. 5. GRILL ON CUT SIDE ABOUT 3 MINUTES; TURN; GRILL ON CRUST SIDE ABOUT 1 1/2 MINUTES. 5. SERVE IMMEDIATELY. NOTE: 1. DEHYDRATED EGG MIX MAY BE USED. OMIT STEPS 1 THRU 3. COMBINE 3 LB 12 OZ (3-NO.3 CYL CN) CANNED DEHYDRATED EGG MIX AND 8 OZ (1 CP) GRANULATED SUGAR IN MIXING BOWL. ADD 2 QT LUKEWARM WATER TO EGG MIXTURE; MIX UNTIL A SMOOTH PASTE IS FORMED. ADD 3 QT LUKEWARM WATER. WHIP UNTIL WELL BLENDED. REFRIGERATE UNTIL READY TO USE. FOLLOW STEPS 4 THRU 6. SERVING SIZE: 2 HALVES",
    "nutrition": {
      "Calories": 27011.93,
      "Total fat": 793.75,
      "Saturated fat": 239.76999999999998,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 23455.52,
      "Sodium": 36872.37,
      "Total carbs": 3571.7799999999997,
      "Fiber": 154.98,
      "Sugar": 1036.76,
      "Protein": 1307.21
    }
  },
  {
    "keyword": "French",
    "title": "Horseradish French Dressing",
    "ingredients": "1 c Ketchup, 1/2 c White vinegar, 1/2 c Vegetable oil, 1/4 c Sugar, 2 ts Salt (up to), 3 tb Horseradish, 1 Clove garlic crushed",
    "servings": "8 Servings",
    "instructions": "In a blender jar, combine all ingredients: blen until well mixed. Keep refrigerated. (This is great on any salad and it's easy and fast). Makes about 2 cups. MEAL-MASTER RECIPES LIST SERVER",
    "nutrition": {
      "Calories": 1460.4099999999999,
      "Total fat": 109.19,
      "Saturated fat": 8.149999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 3677.0600000000004,
      "Total carbs": 126.44999999999999,
      "Fiber": 2.32,
      "Sugar": 108.22999999999999,
      "Protein": 3.3800000000000003
    }
  },
  {
    "keyword": "Japanese",
    "title": "Maxanne's Japanese Okra",
    "ingredients": "3/4 lb Okra, 1 pk Katsuobushi (shaved bonito fish), 1 pn Toogarashi (red pepper flakes), Shoyu (soy sauce) to taste",
    "servings": "4 servings",
    "instructions": "Wash then boil the okra in a saucepan of boiling water until almost tender but still firm. Drain and put in refrigerator to cool. When ready to eat, slice okra into 1/4-inch rings, put in small mixing bowl and then add bonita flakes. Stir and add shoyu to moisten and to taste and add a touch of toogarashi, depending on how spicy you like it. Best eaten with Japanese rice. This recipe yields 4 to 6 appetizer servings. Per serving: 32 Calories (kcal); trace Total Fat; (2% calories from fat); 2g Protein; 6g Carbohydrate; 0mg Cholesterol; 7mg Sodium Food Exchanges: 0 Grain(Starch); 0 Lean Meat; 1 1/2 Vegetable; 0 Fruit; 0 Fat; 0 Other Carbohydrates",
    "nutrition": {
      "Calories": 90.76,
      "Total fat": 0.8599999999999999,
      "Saturated fat": 0.19999999999999998,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 5.32,
      "Sodium": 266.82,
      "Total carbs": 16.81,
      "Fiber": 9.08,
      "Sugar": 8.17,
      "Protein": 8.8
    }
  },
  {
    "keyword": "Japanese",
    "title": "Halibut with Japanese Flavors",
    "ingredients": "Cross TMPJ72B, 2 tb White miso paste, 1 tb Sugar, 1 tb Rice wine or dry sherry, 1 ts Reduced-sodium soy sauce, 1 lb Halibut fillet, skinned and, Into 4 portions, 2 Sheets nori seaweed, cut, Julienne strips, 2 Scallions, trimmed, thinly sliced",
    "servings": "4 Servings",
    "instructions": "Preheat oven to 400 degrees. Prepare 4 parchment or aluminum foil papillotes (as described in previous \"All Wrapped Up\" recipes). In a small bowl, stir together miso paste, sugar, rice wine or sherry and soy sauce until smooth. Place a piece of halibut in the center half of each opened paper heart. Brush the miso mixture over the halibut and top with seawood and scallions. Seal the packages and place them on a baking sheet. Bake for 10 to 12 minutes, or until the packages are puffed. (You may open one package to check that the fish is opaque.) Transfer to plates; let each diner open his or her own package. Serves 4. 195 calories per serving: 4 grams fat, 440 mg sodium and 47 mg cholesterol. COMMENTS: Sheets of nori seaweed are most familiar as suchi wrappers. You can find miso and seaweed in Japanese markets and health food stores. By CWBJ78A NANCY BERRY Time:",
    "nutrition": {
      "Calories": 965.6899999999999,
      "Total fat": 26.070000000000004,
      "Saturated fat": 8.05,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 354.61,
      "Sodium": 3668.2000000000003,
      "Total carbs": 34.99,
      "Fiber": 4.22,
      "Sugar": 17.69,
      "Protein": 135.98000000000002
    }
  },
  {
    "keyword": "Japanese",
    "title": "Chowan Mushi - Japanese Steamed Egg Custard",
    "ingredients": "8 Eggs lightly beaten, 1 ts Salt, 2 tb Dry sherry, 1/2 c Fresh peas cooked, 1/4 lb Shelled shrimp finely chopped",
    "servings": "1 Servings",
    "instructions": "While continuing to beat the eggs, add the salt, sherry, peas, and shrimp. Divide among 4 greased custard cups. Set the custard cups on a rack in a deep saute pan or dutch oven. Cover with a piece of wax paper. Pour boiling water down the sides of the pan to come one quarter of the way up the cups. Cover the pan and simmer so that the custard steams for about 20 minutes, or just until set. Do not boil. Serving Ideas : good with stir-fried vegetables NOTES : If fresh peas are not available use thawed frozen.",
    "nutrition": {
      "Calories": 659.7200000000001,
      "Total fat": 38.31,
      "Saturated fat": 12.559999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1498.55,
      "Sodium": 1381.4899999999998,
      "Total carbs": 17.299999999999997,
      "Fiber": 4.4,
      "Sugar": 6.67,
      "Protein": 55.82
    }
  },
  {
    "keyword": "Japanese",
    "title": "Martha Stewart's Japanese Salad Dressing",
    "ingredients": "3/4 c Red miso, 3 tb Sugar, 3 tb Mirin wine, 2 tb Hot water, 2 ts Light soy sauce, 1/4 ts Sesame oil, 1 tb Toasted sesame seeds, 1/2 Head iceberg lettuce torn, 1 md Carrot thinly sliced",
    "servings": "8 Servings",
    "instructions": "MAKES 1 CUP In a small bowl, combine miso and sugar. Add mirin, water, soy sauce, sesame oil, and sesame seeds. Stir until well blended. Serve over lettuce and carrot slices. Toss to combine.",
    "nutrition": {
      "Calories": 927.7,
      "Total fat": 20.209999999999997,
      "Saturated fat": 3.1999999999999997,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 9881.06,
      "Total carbs": 129.62,
      "Fiber": 17.080000000000002,
      "Sugar": 76.78,
      "Protein": 33.190000000000005
    }
  },
  {
    "keyword": "Japanese",
    "title": "Roasted Japanese Eggplant with Green Herb Sau",
    "ingredients": "6 Japanese eggplants, 6 to 8 inches long, 1 c Fresh cilantro leaves, 1 c Fresh Italian parsley leaves, 1 ts Ground cumin seeds roasted, Zest of 2 lemons, 1/2 c Lemon juice, Black pepper, Salt",
    "servings": "6 Servings",
    "instructions": "Over a grill or gas flame, roast the eggplant until the skin blackens and the flesh is soft. Allow to col and peel carefully with a small sharp knife to remove all the skin, being careful that the eggplants keep their shape. Puree the remaining ingredients in a blender or food processor. Pour the sauce over the eggplants and allow them to marinate in the sauce for at least an hour. From DEEANNE's recipe files",
    "nutrition": {
      "Calories": 1322.75,
      "Total fat": 10.080000000000002,
      "Saturated fat": 1.7500000000000002,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 744.47,
      "Total carbs": 329.86000000000007,
      "Fiber": 96.82,
      "Sugar": 116.4,
      "Protein": 35.72
    }
  },
  {
    "keyword": "Korean",
    "title": "Seasoned Potatoes (Korean)",
    "ingredients": "2 md Potatoes, 2 tb Soy sauce, 2 ts Sugar, 1 ts Minced garlic, 2 ts Sesame seeds, 1 To 2 ts sesame oil, 4 tb Minced scallion",
    "servings": "4 Servings",
    "instructions": "Peel potatoes and slice into match stick pieces, placing in cold water to prevent browning. Drain and place in saucepan with just enough water to barely cover potatoes. Bring to boil and cook just until tender, 3 to 4 minutes. Meanwhile, in bowl, combine soy sauce, sugar, garlic, sesame seeds, sesame oil and scallion. Drain cooked potatoes well and add to soy sauce mixture, tossing well. Serves 4. From the Hayward Daily Review, 9/21/88.",
    "nutrition": {
      "Calories": 944.0100000000001,
      "Total fat": 55.11,
      "Saturated fat": 7.82,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 1797.1299999999999,
      "Total carbs": 100.47000000000001,
      "Fiber": 16.51,
      "Sugar": 13.19,
      "Protein": 21.499999999999996
    }
  },
  {
    "keyword": "Korean",
    "title": "Seasoned Spinach (Korean)",
    "ingredients": "10 Oz fresh small flat-leaf spinach, 2 tb Soy sauce, 1 ts Sugar, 1 1/2 ts Crushed sesame seeds, 1 tb Sesame oil, 1 tb Minced scallion, 1 ts Vinegar (optional), Salt, Red pepper threads (optional)",
    "servings": "2 Servings",
    "instructions": "Both hot and cold vegetables are important in the Korean diet. Here are several recipes adapted from \"Traditional Korean Cooking\" by Han Chung Hea, head of a prestigious cooking institute in Seoul. Remove roots from spinach, if desired. In bowl, combine soy sauce, sugar, sesame seeds, sesame oil, scallion and vinegar. Bring large pot lightly salted water to boil. Add spinach, root ends first, and immerse only until leaves turn bright green. Drain and rinse immediately in cold water. Drain and squeeze out as much water as possible. Place spinach in bowl with soy sauce mixture and toss well. Serve at once, topped with few red pepper threads, if desired. Serves 2. From the Hayward Daily Review, 9/21/88.",
    "nutrition": {
      "Calories": 471.38,
      "Total fat": 34.879999999999995,
      "Saturated fat": 4.92,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 2467.46,
      "Total carbs": 31.57,
      "Fiber": 12.060000000000002,
      "Sugar": 10.24,
      "Protein": 16.32
    }
  },
  {
    "keyword": "Korean",
    "title": "Soonday (Korean Stuffed Sausage)",
    "ingredients": "1 Yard small beef intestine, 2 c Rice, cooked but still firm, 2 Garlic cloves crushed, 1 sl Fresh ginger, 1\", crushed, 1 ts Salt, 1/2 ts Pepper black or white, 1 tb Korean sesame oil, 1 ts Sesame seeds crushed, 5 Scallions chopped, 2 c Beef or pork blood",
    "servings": "6 Servings",
    "instructions": "\"In a number of cultures cooks stuff the small intestine of the cow, sheep or pig and boil, bake or roast it. In Tunisia, this is known as \"merguez\", in Eastern Europe as \"kishke\", in Indonesia, it is the spectacular \"usus\" in coconut milk. The \"soonday\" of Korea is entirely different. It originated in the cold climate of mountainous North Korea where the intestines of the wild mountain pigs were used. Now it's prepared all over the country and brought in large buckets to the public markets of Pusan, Kyongu, Seoul, Taegu and elsewhere. This sausage stuffing is made of rice, seasonings and beef or pork blood (or substitute 8 ounces canned tomato puree). 1. Clean the intestine as received from your butcher once again. Rinse well in cold water, then soak in lightly salted water for 1 hour; this makes the intestine firm and easier to handle. Tie up one end firmly with cotton string. 2. Prepare the stuffing. Mix the cooked rice, garlic, ginger, salt, pepper, sesame oil, sesame seeds, scallions and either blook or tomato puree. Loosely stuff the intestine either by machine or by a funnel -- forcing the stuffing along the entire length. Do not fill too tightly since the intestine may split in cooking when the rice expands. Tie the open end firmly. The intestine may also be stuffed as individual sausages in which case it is cut into the desired lengths, tied, filled and tied again. 3. Place the soonday in a large pan, curling it around like a snail. Cover it with lightly salted water and bring to a boil. Then turn to low and cook uncovered for 3/4 hour. At the end of this time, insert a skewer in the soonday to test for doneness. As when testing a cake, if the skewer is dry and the soonday is firm to pressure, it is done. Cut diagonally into 1/4-inch thick slices and serve warm or at room temperature (warm is better). Serve on festive occasions especially after the harvest of rice, cabbage (or whatever is being grown) with your favorite Korean dip. Serves 6 to 8.",
    "nutrition": {
      "Calories": 2323.7500000000005,
      "Total fat": 117.91999999999999,
      "Saturated fat": 40.81999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 488.15,
      "Sodium": 995.8899999999999,
      "Total carbs": 104.17999999999999,
      "Fiber": 7.57,
      "Sugar": 1.98,
      "Protein": 207.12
    }
  },
  {
    "keyword": "Korean",
    "title": "Bugogi - Korean Beef Dish",
    "ingredients": "1 lb Beef tenderloin, sliced very thin, 2 Cloves fresh garlic, crushed, 2 tb Granulated sugar, 1 tb Sesame oil, Black pepper good sprinkling, Roasted sesame seeds (also a good sprinkling), 1 Green onion, finely chopped, 2 tb Soy sauce, 3 tb Water",
    "servings": "4 Servings",
    "instructions": "In a glass or plastic bowl, mix everything together. Cover and refrigerate for 1-2 days. (You can cook immediately, but of course, it won't taste as good. :-) ) In a skillet, heat a tablespoon of vegetable oil over medium-high to high heat. Cook the beef slices, turning until meat reaches desired degree of doneness (about 1-2 minutes). Serve with rice and green vegetables. NOTES: The recipe says 'serves four,' but then again, I ate a batch of this myself without complaining too much. I guess it depends on how hungry you are and what else you're serving. ;-) I also usually omit the sesame seeds, since neither my SO nor I like them. Hasn't killed me yet. ~-Lance",
    "nutrition": {
      "Calories": 1890.4100000000003,
      "Total fat": 139.61999999999998,
      "Saturated fat": 48.150000000000006,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 385.55,
      "Sodium": 2030.51,
      "Total carbs": 40.269999999999996,
      "Fiber": 6.68,
      "Sugar": 25.67,
      "Protein": 116.76999999999998
    }
  },
  {
    "keyword": "Korean",
    "title": "Bul Kogi (Korean Barbecue)",
    "ingredients": "5 lb Beef short ribs, 2 Cloves garlic crushed, 1/4 c Sesame seed Toasted, crushed, 1 c Green onions finely Chopped, 1 ts Pepper, 1 ts Sesame oil, 2 c Soy sauce, 1 c Sugar, 1/4 c Oil",
    "servings": "4 Servings",
    "instructions": "Place short ribs in bowl. Add garlic, sesame seeds, green onions, pepper, sesame oil, soy sauce, sugar and oil and toss to coat meat well. Cover and let stand at room temperature 2 hours. Barbecue over coals or run under broiler, turning and basting often with marinade until meat is tender.",
    "nutrition": {
      "Calories": 8802.480000000001,
      "Total fat": 600.2600000000001,
      "Saturated fat": 235.86,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 2267.96,
      "Sodium": 29638.7,
      "Total carbs": 243.81,
      "Fiber": 11.75,
      "Sugar": 204.76,
      "Protein": 627.0699999999999
    }
  },
  {
    "keyword": "Mediterranean",
    "title": "Greek Style Lamb with Mediterranean Vegetables And Pesto",
    "ingredients": "2 sm Lamb mini roasts or 4 rib eye fillets or (see above) 8 lamb backstrap fillets, 2 tb Olive oil, 1 Lemon zest of, 2 Cloves garlic minced, 5 Zucchini diced, 1 Red capsicum and 1 yellow capsicum diced, 1 Spanish onion finely chopped, 2 Pontiac potatoes finely diced, skin on, Juice and zest of 1 lemon, 1 c Parsley, 1 bn Basil, 2 Cloves garlic, 1/2 c Pistachio nuts toasted, 1/2 c Parmesan cheese, Olive oil, Salt and pepper to taste",
    "servings": "1 servings",
    "instructions": "Heat the olive oil in a saute pan and add the lemon zest and garlic. Cook for 1 minute to flavour the oil. Add the lamb pieces and sear over high heat until golden. Place in a baking dish and cook at 180c. for 10 minutes. Meanwhile, to the remaining oil in the pan, add the potatoes and onion and saute over high heat for 3 minutes until beginning to colour. Add the diced capsicum, and zucchini and continue cooking for 5 minutes. Add the parsley, juice and zest of lemon and turn heat down to cook slowly until ready to serve. In a food processor, drop all the basil leaves, garlic, nuts and cheese and process until leaves are chopped. With the motor running, pour in a little olive oil until you reach the consistency you like. Do not make the pesto too runny, otherwise it will not hold together on top of the lamb. To serve, mound some vegetables on each plate, remove the lamb from the oven and slice diagonally. Place three or four slices of lamb on the vegetables and top with a good dollop of the basil pesto. Fat; 0 Other Carbohydrates",
    "nutrition": {
      "Calories": 5062.11,
      "Total fat": 329.09999999999985,
      "Saturated fat": 120.76000000000002,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1128.4,
      "Sodium": 2436.7300000000005,
      "Total carbs": 189.29,
      "Fiber": 32.18,
      "Sugar": 66.7,
      "Protein": 345.6999999999998
    }
  },
  {
    "keyword": "Mediterranean",
    "title": "Green Polenta - Mediterranean",
    "ingredients": "12 oz Greens (kale, spinach, rocket, flat leaf parsley), 3 Leeks washed and finely sliced, 3 oz Unsalted butter and 6oz extra butter, 1 ts Soft thyme leaves, 10 oz Polenta flour, 3 1/2 pt Chicken stock, 6 oz Grated fresh parmesan, 6 oz Ripe gorgonzola",
    "servings": "1 servings",
    "instructions": "In a large saucepan cook the leeks in 3oz of the butter until wilted. Add the greens and wilt down. Season. Bring the stock to the boil, lower the heat, reduce to a simmer and slowly add the polenta, stirring with a whisk until completely blended. When thickened, stir in the butter, parmesan, gorgonzola and greens. Season to taste.",
    "nutrition": {
      "Calories": 4406.27,
      "Total fat": 331.07,
      "Saturated fat": 198.78999999999996,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 880.3000000000001,
      "Sodium": 8412.19,
      "Total carbs": 232.18999999999997,
      "Fiber": 27.459999999999997,
      "Sugar": 25.12,
      "Protein": 144.81
    }
  },
  {
    "keyword": "Mediterranean",
    "title": "Mediterranean Baked Chicken Skewers",
    "ingredients": "4 Skinless boneless chicken breast halves, 1 1/4 c Dried figs halved, 1/4 c Dry white wine, 1/4 c Red wine vinegar, 3 tb Extra-virgin olive oil, 1 tb Garlic chopped, 1/4 c Capers chopped fine, 1 2/3 tb Dried oregano leaves, 1/2 ts Red chili pepper flakes, 1/2 ts Salt, 2 Bay leaves, 1/2 c Dark brown sugar packed",
    "servings": "12 servings",
    "instructions": "1. Cut chicken into 1-inch cubes. In a mixing bowl, combine the chicken with the figs, wine, vinegar, oil, garlic, capers, oregano, chili pepper flakes, salt and bay leaves. Cover and let marinate for at least 30 minutes or marinate overnight in a ziptop bag. While the chicken marinates (or 30 minutes before you are ready to bake) soak the bamboo skewers in water to keep them from burning in the oven. 2. Preheat oven to 350 degrees F (175 degrees C). Assemble skewers with a piece of chicken and half a fig. Stand skewers up in a casserole dish; spoon the marinade over the chicken and sprinkle with brown sugar. 3. Bake until the sugar topping turns into a golden brown crust and the chicken is white in color throughout, about 40-50 minutes. Serve while hot. Note: This upbeat chicken preparation gains its flavors from both the marinade and the brown sugar topping. Served in bite sized portions, this is a terrific sweet and savory item for parties. Nutrition: Calories 212 Chol 40 mg. Carb. 25 g Protein 16 g Sodium 244 mg Total fat 6 g (25% cff) Found by Kitpath / MC by J Pellegrino / Sent to mc-recipe and eatlf",
    "nutrition": {
      "Calories": 2058.39,
      "Total fat": 60.14,
      "Saturated fat": 10.929999999999998,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 408.0,
      "Sodium": 1510.8,
      "Total carbs": 218.88000000000002,
      "Fiber": 22.96,
      "Sugar": 177.22,
      "Protein": 157.65
    }
  },
  {
    "keyword": "Mediterranean",
    "title": "Mediterranean Barley Salad",
    "ingredients": "1 c Barley, 3 c Chicken or Vegetable Broth, 1 lg Clove Garlic minced, 3 tb Fresh Parsley chopped, 3 tb Fresh Lemon Juice, 2 tb Olive Oil, 1 tb Freshly grated Lemon Peel, 1/4 ts Salt, 1/8 ts Freshly ground Black Pepper, 1/8 ts Fennel Seed",
    "servings": "6 servings",
    "instructions": "Rinse the barley thoroughly, then place in a medium saucepan with broth over medium heat. Cover and simmer, stirring occasionally, until barley is tender: about 35 minutes. Add the garlic and cook for 5 minutes more. Transfer the barley-garlic mixture to a fine sieve to drain well. Place in a bowl, cover, and chill completely. When it's time to eat, add parsley, lemon juice, olive oil, lemon peel, salt, pepper, and fennel seed. Toss well to combine, and serve.",
    "nutrition": {
      "Calories": 1358.95,
      "Total fat": 81.06000000000002,
      "Saturated fat": 18.8,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 380.7,
      "Sodium": 1112.68,
      "Total carbs": 52.89000000000001,
      "Fiber": 7.349999999999999,
      "Sugar": 3.2199999999999998,
      "Protein": 101.95000000000002
    }
  },
  {
    "keyword": "Mediterranean",
    "title": "Mediterranean Black-Eyed Peas",
    "ingredients": "1 2/3 c Dried black-eyed peas, 1 c Diced fennel bulb, 2 1/2 c Mixed tender leafy greens packed washed stemmed and roughly cut, 1/4 c Extra-virgin olive oil, 3/4 c Chopped onion, 3 Scallions finely chopped, 1 Sprig fresh cilantro stemmed and roughly chopped, 1 c Grated tomatoes, 1 pn Fennel seeds bruised in a mortar, Salt, Freshly ground black pepper",
    "servings": "7 servings",
    "instructions": "Directions: Soak the black-eyed peas according to package directions. Drain and cook in fresh water to cover until almost tender, about 30 minutes. Meanwhile, wash the fennel and the greens and let sit, dripping wet, on a plate. In a 4-quart saucepan over medium heat, warm the olive oil. Add the onion, scallions, and the fennel and cook until soft, golden, and aromatic, for about 10 minutes. Add 1 cup water and continue to cook, stirring often, for 10 minutes. Add the greens to the saucepan along with the tomatoes, fennel seeds, and salt and pepper and cook for another 10 minutes. Drain the black-eyed peas; discard the water. Add the black-eyed peas to the saucepan along with a few tablespoons water, if necessary, to keep everything moist. Simmer another 10 minutes and correct the seasoning. Serve warm or cool. Serves 6 to 8 GMT RECIPES",
    "nutrition": {
      "Calories": 3306.0300000000007,
      "Total fat": 153.40000000000003,
      "Saturated fat": 25.360000000000007,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 260.82,
      "Sodium": 5240.64,
      "Total carbs": 316.60999999999996,
      "Fiber": 46.47,
      "Sugar": 38.779999999999994,
      "Protein": 180.35
    }
  },
  {
    "keyword": "Soup",
    "title": "Electronic Gourmet's French Onion Soup",
    "ingredients": "1 1/2 lb Yellow Onions, thinly sliced, (about 5 cups), 3 tb Butter, 1 tb Oil, 1 ts Salt, 1/4 ts Sugar, 3 tb Flour, 8 c Boiling Brown Stock, 1/2 c Dry White Wine or Vermouth, 3 tb Cognac, Rounds of Hard Toasted Bread, 2 c Swiss Cheese, grated",
    "servings": "6 Servings",
    "instructions": "1) Cook the onions slowly with the butter and oil in a covered saucepan for 15 minutes. 2) Uncover, raise the heat to moderate and stir in the salt and sugar. Cook for 30 to 40 minutes stirring frequently until the onions have turned and even, deep golden brown. 3) Sprinkle in the flour and stir 3 minutes. 4) Off heat, blend in the boiling liquid. Note that instead of brown stock you may use canned beef bouillon (same quantity). Or, and equal part of boiling water plus stock or bouillon. 5) Add the wine and season to taste. Simmer partially covered for 30 to 40 minutes or more, skimming occasionally. Correct Seasoning. 6) Set aside uncovered until ready to serve, then reheat to simmer. 7) Just before serving, stir in the cognac. Pour into french onion soup bowls over the rounds of bread. Cover with cheese. Bake at 350 F until cheese melts.",
    "nutrition": {
      "Calories": 3956.2999999999993,
      "Total fat": 286.51,
      "Saturated fat": 160.6,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 738.77,
      "Sodium": 5292.660000000001,
      "Total carbs": 178.46,
      "Fiber": 10.8,
      "Sugar": 68.55,
      "Protein": 128.68
    }
  },
  {
    "keyword": "Soup",
    "title": "Electronic Gourmet's Garlic Soup",
    "ingredients": "6 oz Olive Oil, 2 cl Garlic, peeled and crushed, 4 c Water, 2 tb Salt, 1 tb Monosodium Glutamate, 4 c Chicken Stock, 8 sl Fresh White Bread, 8 x Eggs",
    "servings": "8 Servings",
    "instructions": "1) Put the oil and garlic into a very heavy large pot. Saute until almost golden brown in colour. Add the water, salt, monosodium glutamate and stock. 2) Simmer for 3 hours. Check the seasoning. 3) To serve: Place a slice of bread in each soup bowl. Put a ladle of the hot soup in the bowl and immediately, on top of the bread, break an egg. The egg will congeal and the bread will go to the bottom of the bowl. Note: Can be made a day ahead and refrigerated. To serve, follow step 3.",
    "nutrition": {
      "Calories": 3213.32,
      "Total fat": 229.49,
      "Saturated fat": 41.129999999999995,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1516.8,
      "Sodium": 16115.029999999999,
      "Total carbs": 184.24,
      "Fiber": 8.08,
      "Sugar": 33.4,
      "Protein": 100.86000000000001
    }
  },
  {
    "keyword": "Soup",
    "title": "Elegant Mushroom Soup",
    "ingredients": "1 1/2 lb Mushrooms -- sliced 1/4\", Thick, 2 qt Chicken Broth -- College, Inn, 2 Cubes, 2 qt Heavy Cream -- 18%, 4 tb Butter, 1 ts Thyme -- ground, 3 tb Cornstarch -- or less, to, Thicken, Chicken Bouillon",
    "servings": "8 Servings",
    "instructions": "* NOTE: Use 1 1/2 pounds or MORE of ripe mushrooms. The darker mushroom (older) adds a stronger flavor to the soup, that's what I usually use. I've made this with the regular white, as well as portabello mushrooms - a blend tastes fine, but the portobello tends to overpower slightly. 1. Melt butter in pot. Add sliced mushrooms, and saute gently until liquid is completely cooked out. Do not brown mushrooms. 2. Add at least 2 quarts chicken broth (reserve 1/3 cup), thyme, and bouillon. Bring to a full boil, and simmer, uncovered, until broth is reduced by 75%. Taste should be extremely strong (it will be diluted with the cream). Note: The reduction can take quite a while. 3. Mix cornstarch with reserved broth, and add to soup. Allow mixture to get very thick. 4. Gently add 2 quarts (or more) heavy cream. Blend, and bring to a gentle simmer. Taste, and adjust seasoning if needed. Thin with milk or cream if flavor is too strong, or soup is too thick. : Jocie Moravec",
    "nutrition": {
      "Calories": 927.6999999999999,
      "Total fat": 72.10000000000001,
      "Saturated fat": 43.440000000000005,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 199.64,
      "Sodium": 2722.0699999999997,
      "Total carbs": 62.300000000000004,
      "Fiber": 15.3,
      "Sugar": 20.18,
      "Protein": 20.549999999999997
    }
  },
  {
    "keyword": "Soup",
    "title": "Emeril's Onion Soup",
    "ingredients": "3 tb Unsalted butter, 4 c Yellow julienned, Salt, Freshly ground black pepper, 1 tb Chopped garlic, 1 ds Dry sherry, 1 ds Worcestershire sauce, 8 c Beef stock, 8 sl Toasted french bread (about 1-inch thick), 2 c Duck rillette recipe follows, 8 sl Gruyere cheese, 2 ts Chopped fresh parsley leaves",
    "servings": "8 Servings",
    "instructions": "Preheat the oven to 400 degrees F. In a large saucepan, over medium-heat, melt the butter. Add the onions. Season with salt and pepper. Sauté the onions until slightly caramelized, about 8 to 10 minutes. Add the garlic, sherry, Worcestershire sauce and stock. Season with salt and pepper. Bring the liquid to a boil and reduce to a simmer. Cook the soup for 15 minutes. Ladle the soup into oven-proof deep bowls. Spread the each piece of bread with 1/4 cup of the rillette. Float the croutons on top of the soup. Cover each crouton with a piece of cheese. Sprinkle the cheese with parsley. Place the bowls on a sheet pan and place in the oven. Bake until the cheese is bubbly and golden, about 6 to 8 minutes. Remove from the oven and serve. Yield: 8 servings",
    "nutrition": {
      "Calories": 5839.18,
      "Total fat": 400.09,
      "Saturated fat": 213.85,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1277.15,
      "Sodium": 418187.52,
      "Total carbs": 176.52,
      "Fiber": 8.04,
      "Sugar": 23.959999999999997,
      "Protein": 379.54
    }
  },
  {
    "keyword": "Soup",
    "title": "End-Of-Month Vegetable Soup",
    "ingredients": "1/2 Chinese cabbage, 1/2 Carrot, 1/2 Red bell pepper, 1 Yellow onion, 4 sm Potatoes, 1/8 lb Bacon pieces (for seasoning), 4 Prosciutto end bits (for seasoning, optional), 5 Stalks celery, 1 Bouquet garni (e.g., about 1 t each parsley and thyme, 1 or 2 bay leaves), 2 Chicken or beef bouillon cubes, 2 Garlic cloves, Pepper (to taste), 1 c White wine (optional)",
    "servings": "6 Servings",
    "instructions": "Make the bouquet garni by tying the herbs up in a cheesecloth or coffee filter. Put a quart of water to boil with about 1/2 t salt (I don't like to use too much salt if I use bouillon), the bouquet garni and the bouillon. Dice the onion, mince the garlic, and add these to the soup together with the bacon and/or prosciutto ends. Bring this to a boil. Simmer 5 minutes. If scum forms on the surface, skim it off. Dice the potatoes and add to the boiling pot. Cut up everything else and add it. Add the wine. Adjust the liquid so that it covers the vegetables. After it boils again, adjust the seasoning and simmer for about an hour, or until it is done (this is quite subjective). NOTES: * Soup with a mixture of vegetables -- I had an eclectic mixture of vegetables going bad in the refrigerator, so I collected them and came up with this soup. It was very good, so I would like to share it with you all. Caveat: I rarely measure anything, so be careful of quantities. * This will serve 6 people at once, or 2 people for three days. It ages well in the refrigerator. : Difficulty: easy. : Time: 10 minutes preparation, 1 hour simmering. : Precision: no need to measure.",
    "nutrition": {
      "Calories": 1818.2799999999997,
      "Total fat": 52.970000000000006,
      "Saturated fat": 16.43,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 293.33,
      "Sodium": 5242.52,
      "Total carbs": 181.67000000000002,
      "Fiber": 23.209999999999997,
      "Sugar": 21.830000000000005,
      "Protein": 113.65
    }
  },
  {
    "keyword": "Salad",
    "title": "Electronic Gourmet's Garlic and Herb Salad Dr",
    "ingredients": "2 cl Garlic, peeled and crushed, 1 ts Tarragon, 1 ts Marjoram, 1 ts Powdered Mustard, 1/2 ts Salt, 1/4 ts Pepper, 1/2 c Olive Oil, 4 tb Red Wine Vinegar",
    "servings": "1 Jar",
    "instructions": "1) Shake all ingredients in a small jar with a tight fitting lid. Let stand at room temperature for at least 1 hour. The longer the better. 2) Shake again and use to dress any crisp green salad. Hint: ~---- Store in jar and refrigerate 4-5 days. Always shake before using.",
    "nutrition": {
      "Calories": 986.4000000000001,
      "Total fat": 108.39,
      "Saturated fat": 14.97,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 355.55,
      "Total carbs": 4.06,
      "Fiber": 0.85,
      "Sugar": 0.13,
      "Protein": 1.1400000000000001
    }
  },
  {
    "keyword": "Salad",
    "title": "Electronic Gourmet's Herb Salad Dressing",
    "ingredients": "1/2 c Olive Oil, 1 tb Fresh Dill, minced, 1 tb Tarragon, minced, 1 tb Chervil or Fennel, minced, 1 tb Chives, minced, 1/4 ts Fresh Marjoram, minced, 1/2 ts Salt, 8 ts Pepper, 1/4 c Tarragon Vinegar",
    "servings": "1 Cups",
    "instructions": "1) Place oil, herbs, salt and pepper in a shaker bottle or large glass measuring cup. Let stand at room temperature for 3 to 4 hours. The longer the better. 2) Add vinegar and shake or stir well to blend.",
    "nutrition": {
      "Calories": 1084.9500000000003,
      "Total fat": 110.06999999999998,
      "Saturated fat": 15.56,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 354.29,
      "Total carbs": 27.55,
      "Fiber": 8.91,
      "Sugar": 3.61,
      "Protein": 7.31
    }
  },
  {
    "keyword": "Salad",
    "title": "Elegant Chicken Salad",
    "ingredients": "1/4 c Olive oil, 2 Chicken breasts, 3 c Chicken broth or water, 1/4 c Balsamic vinegar, 2 tb Orange juice, 1 tb Dijon mustard, 1/4 c Chives, 2 tb Tarragon chopped, Salt and pepper, 3 c Rice (wild or white)",
    "servings": "6 Servings",
    "instructions": "Poach chicken in broth or water for about 20 minutes. In salad bowl combine vinegar, juice, and mustard. Gradually whisk in oil. Stir in chives and tarragon and season with salt and pepper. Cut chicken into bite sized pieces. Add chicken and rice to dressing. Toss well.",
    "nutrition": {
      "Calories": 1637.6100000000001,
      "Total fat": 66.63000000000001,
      "Saturated fat": 10.519999999999996,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 218.94,
      "Sodium": 3684.0,
      "Total carbs": 155.82,
      "Fiber": 3.44,
      "Sugar": 15.950000000000001,
      "Protein": 95.01
    }
  },
  {
    "keyword": "Salad",
    "title": "Elegant Mushroom and Olive Salad",
    "ingredients": "Bibb Lettuce, Romaine Lettuce, 1 c Black Olives, pitted, 1/2 lb Fresh Mushrooms, 4 oz Roquefort Cheese, or less if desired, Juice Of 1 Lemon, 1 tb Olive Oil, Salt And Cracked Pepper, to taste",
    "servings": "8 Servings",
    "instructions": "Break up enough lettuce into bite-sized pieces to make 2 quarts. Slice the olives and mushrooms. Crumble the cheese and toss lightly. Add lemon juice and olive oil. Do *not* substitute other oils. Add salt and cracked pepper to taste, and toss again.",
    "nutrition": {
      "Calories": 788.5099999999999,
      "Total fat": 64.17999999999999,
      "Saturated fat": 25.84,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 102.06,
      "Sodium": 3636.0999999999995,
      "Total carbs": 30.569999999999997,
      "Fiber": 11.99,
      "Sugar": 7.6499999999999995,
      "Protein": 32.050000000000004
    }
  },
  {
    "keyword": "Salad",
    "title": "Elizabeth Burris' Broccoli Salad",
    "ingredients": "1 1/2 lb Broccoli, 1/2 Red onion chopped, 1 c Sunflower seeds, 1/2 c Raisins, 1 c Sliced fresh mushrooms, 1 c Mayonnaise, 2 tb Red wine vinegar, 1/4 c Sugar (optional), 1/2 lb Bacon cooked crisp & crumbled",
    "servings": "6 Servings",
    "instructions": "CLEAN AND CUT the whole broccoli into small pieces. Use all of the broccoli except the end chunks. Mix together the broccoli, onion, sunflower seeds, raisins and mushrooms. Make the dressing by mixing the mayonnaise, vinegar and sugar. Twenty minutes before serving, toss the salad. Toss with the bacon and the dressing.",
    "nutrition": {
      "Calories": 4162.94,
      "Total fat": 321.87,
      "Saturated fat": 61.260000000000005,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 317.1,
      "Sodium": 13352.909999999998,
      "Total carbs": 218.08000000000004,
      "Fiber": 42.46999999999999,
      "Sugar": 118.38,
      "Protein": 128.83
    }
  },
  {
    "keyword": "Stew",
    "title": "Eliopulos Stew",
    "ingredients": "2 tb Oil, 3 lg Onions -- thinly sliced, 16 oz Canned tomatoes --, Undrained, 1 c Dry red wine, 6 oz Tomato paste, 3 ts Brown sugar, 1/4 c Dried currants, 2 Bay leaves, 3/4 ts Ground cinnamon -- or to, Taste, 3/4 ts Ground cumin, 1 pn Ground cloves, 4 1/4 lb Lean beef -- cut into 1-inch, Cube, Salt and freshly ground, Pepper -- to taste, 1/2 lb Muenster or jack cheese --, Cut into 1/2\" cubes, 1 c Broken walnut pieces --, Toasted",
    "servings": "6 Servings",
    "instructions": "1. In a large, flameproof casserole over medium heat, heat oil. Saute onions in oil over medium heat until soft, about 5 minutes. 2. Break up tomatoes into small pieces. Stir together tomatoes and their juice, wine, tomato paste, brown sugar, currants, bay leaves, cinnamon, cumin, and cloves; add to casserole. 3. Add beef and simmer, covered, about 2 hours, or until meat is fork-tender. Season to taste with salt and pepper, and adjust other seasonings to taste. If stew is too liquid, uncover pan the last 30 minutes of cooking so that excess liquid will evaporate. 4. To serve immediately: Preheat oven to 350 degrees F. Remove casserole from heat and scatter cheese and nuts over top. Bake at 350 degrees F until cheese melts (about 5 minutes). * Timesaver Tip: Stew can be made up to 2 days ahead. Cool to room temperature, cover, and refrigerate or freeze. If you plan to defrost and reheat it in microwave oven, prepare stew in microwave-safe casserole or individual serving dishes. Wrap in heavy-duty foil; seal with freezer tape. Label; freeze at 0 degrees F up to 3 months. To serve, remove foil and cover loosely with waxed paper. Microwave 15 to 20 minutes on Defrost setting. Reheat on 50% power until hot, 3 to 5 minutes. If you plan to defrost and reheat stew in the oven, prepare recipe in an ovenproof casserole or individual heat-and-serve dishes. Wrap in heavy-duty foil; seal with freezer tape. Label; freeze up to 3 months. Remove tape, but not foil. Place dish in cold oven. Turn oven to 375 degrees F and heat 30 to 60 minutes, until mixture is hot. : the California Culinary Academy",
    "nutrition": {
      "Calories": 7001.5,
      "Total fat": 408.78999999999996,
      "Saturated fat": 148.22,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1961.15,
      "Sodium": 4235.89,
      "Total carbs": 140.0,
      "Fiber": 31.07,
      "Sugar": 85.56000000000002,
      "Protein": 640.78
    }
  },
  {
    "keyword": "Stew",
    "title": "Ella's Brunswick Stew",
    "ingredients": "1 lb Chicken boiled, remove bones, reserve broth, 1 lb Ground beef see notes, 3 md Potatoes cut up, 1 md Onion cut up, 1 sm Catsup bottled, 2 c English peas small cans, 2 c Green lima beans small cans, 1 cn Corn cream-style, large can, 16 oz Tomatoes canned, 1 tb Sugar, 1 tb Vinegar, Salt and pepper to taste",
    "servings": "1 Servings",
    "instructions": "Pan fry ground beef until all red is gone. Cook the potatoes and onions in chicken broth until tender. add cooked bround beef. Add all other ingredients and simmer for about 30 minites or slow cook for 3 hours. Can be frozen. NOTES : May use 1 pound pork butt steak, boiled and chopped, instead of ground beef.",
    "nutrition": {
      "Calories": 3870.8700000000003,
      "Total fat": 157.13,
      "Saturated fat": 54.91,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 870.9499999999999,
      "Sodium": 2130.53,
      "Total carbs": 309.0,
      "Fiber": 67.48,
      "Sugar": 76.85,
      "Protein": 305.5499999999999
    }
  },
  {
    "keyword": "Stew",
    "title": "Ellen's Beef Stew",
    "ingredients": "1 3/4 lb Chuck or round, cubed, 1/3 c Flour, 1/4 ts Pepper, 1/2 ts Salt, 3 tb Oil, 1/2 Onion chopped, 1 cl Garlic minced, 2 3/4 c Boiling water, 28 oz Tomatoes canned, 1/2 ts Salt, 1/2 ts Worcestershire, 1 pn Basil, 1 pn Dill, 1 pn Thyme, 4 md Potatoes quartered, 2 Onions quartered, 1 lb Carrots 2 inch pieces, 1 c Peas",
    "servings": "1 Servings",
    "instructions": "Combine flour, pepper, and salt in bag. Add meat and shake til coated. Heat oil in Dutch oven. Brown meat on all sides. Add onion, garlic, water, tomatoes, salt, and worcestershire. Cover, reduce heat to low and simmer 2 hours, until meat begins to get tender. Add potatoes, onions, and carrots. Cook 30-45 mins, until vegetables are done. Add peas. Cook until heated. By Ellen Cleary",
    "nutrition": {
      "Calories": 3415.2599999999998,
      "Total fat": 101.75000000000001,
      "Saturated fat": 25.93,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 785.86,
      "Sodium": 2503.71,
      "Total carbs": 338.47,
      "Fiber": 60.22,
      "Sugar": 66.97,
      "Protein": 309.05999999999995
    }
  },
  {
    "keyword": "Stew",
    "title": "Endive and Apple Salad - Martha Stewart Living",
    "ingredients": "3 Canned anchovy fillets, rinsed, 1/2 ts Dijon mustard, 1 tb Plus 1/4 t lemon juice, Freshly ground pepper, 2 tb Extra-virgin olive oil, 3 Stalks celery, 1 Granny Smith apple, 2 Heads Belgian endive, leaves separated, Salt",
    "servings": "4 Servings",
    "instructions": "1. Chop anchovies and place in a bowl with mustard. Add 1 T of the lemon juice and pepper to taste, and mix well. Slowly whisk in the olive oil. The dressing can be made a day ahead of time, 2. Peel the celery to remove the strings. Cut each stalk into thirds and julienne. Set aside. Quarter and core the apple, but do not peel. Thinly slice each quarter and place in a serving bowl. Sprinkle remaining 3/4 t lemon juice over apples and toss to coat. 3. Julienne endive leaves. Add celery and endive to the apples and toss with dressing. Season to taste with salt and pepper. Serve immediately.",
    "nutrition": {
      "Calories": 372.02,
      "Total fat": 28.86,
      "Saturated fat": 4.11,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 10.2,
      "Sodium": 1190.3600000000001,
      "Total carbs": 24.35,
      "Fiber": 8.969999999999999,
      "Sugar": 12.12,
      "Protein": 6.080000000000001
    }
  },
  {
    "keyword": "Stew",
    "title": "Fresh Vegetable and Chicken Stew",
    "ingredients": "1 (4-5 pound) chicken (up to), 3 tb Shortening, 2 c Hot water, 1 tb Salt, 3/4 ts Black pepper, 12 sm White onions, 1 c Sliced carrots, 1 c Fresh peas lima beans, or snapbeans, 1 c Diced potatoes, 1/3 c All-purpose flour, 1/2 c Water",
    "servings": "6 Servings",
    "instructions": "Cut chicken into serving-size pieces and brown on all sides in hot shortening. Place in Dutch oven or saucepan with water, salt, and pepper. Cover and cook for 1 hour, or until chicken is tender. Add vegetables about 30 minutes before cooking time is up. Combine flour with the 1/2 cup water and stir into stew. Cook until medium thickness. Yield: 6 servings.",
    "nutrition": {
      "Calories": 2491.01,
      "Total fat": 98.13,
      "Saturated fat": 31.81,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 421.01,
      "Sodium": 6820.530000000001,
      "Total carbs": 259.44,
      "Fiber": 47.62,
      "Sugar": 75.74,
      "Protein": 150.18
    }
  },
  {
    "keyword": "Stir-fry",
    "title": "Green Bean Stir-Fry with Feta",
    "ingredients": "2 ts Olive oil, 40 g Pine kernels (1 1/2oz), 1 500 gram pac frozen green beans sliced, 1 Clove garlic crushed, 75 g Black olives stoned (3oz), 1 420 gram can red kidney beans rinsed and drained, 2 tb Dry white wine, 1 tb Lemon juice, 2 ts Chopped fresh thyme, 2 ts Honey, 200 g Feta cheese cubed",
    "servings": "6 servings",
    "instructions": "Heat the oil in a wok, or large frying pan. Add the nuts and stir-fry until lightly browned, remove them from the wok. Add the garlic to the wok and stir-fry. Add the olives, kidney beans, wine, juice, thyme, honey and green beans, stir until hot. Stir in the nuts and cheese, then serve. NOTES : A quick easy stir-fry using green beans.",
    "nutrition": {
      "Calories": 1193.7899999999997,
      "Total fat": 38.57,
      "Saturated fat": 5.429999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 568.43,
      "Total carbs": 177.45999999999998,
      "Fiber": 45.74999999999999,
      "Sugar": 54.52,
      "Protein": 46.99
    }
  },
  {
    "keyword": "Stir-fry",
    "title": "Green Vegetable Stir-Fry",
    "ingredients": "1 tb Oil, 1 Onion sliced, 1 tb John West Ginger Garlic &, Shallots Stir-Fry Mix, 2 ts John West Green Curry Paste, 6 c Assorted sliced green vegetables, For example broccoli snowpeas,, Beans spinach, 1 tb Thai fish sauce, 2 ts John West Coriander, 2 tb Finely shredded kaffir lime leaves optional",
    "servings": "6 servings",
    "instructions": "Heat oil in a wok or large frying pan over a medium heat. Add onion, stir-fry mix and curry paste and fry for 2 to 3 minutes. Add green vegetables and toss over the heat for 2 to 3 minutes, until bright green. Add fish sauce and coriander, mix well and toss over the heat for I to 2 minutes. Serve with rice, stir-fries, or simple meat dishes.",
    "nutrition": {
      "Calories": 1693.2299999999998,
      "Total fat": 42.519999999999996,
      "Saturated fat": 8.24,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 89.37,
      "Sodium": 4421.18,
      "Total carbs": 255.68999999999997,
      "Fiber": 76.17999999999999,
      "Sugar": 74.36999999999999,
      "Protein": 88.58999999999997
    }
  },
  {
    "keyword": "Stir-fry",
    "title": "Melting Pot Beef (Beef Stir-Fry with Couscous)",
    "ingredients": "One 1 1/4 pound boneless beef top sirloin 1 inch thick, steak, trimmed, 1 cn Ready-to-use beef broth (14 1/2 ounces), 1 c Couscous, 1 tb Olive oil, 1 md Red bell pepper cut into 1/4-inch-thick strips, 1/2 c Coarsely chopped Vidalia or other sweet onion, 1/2 c Honey-Dijon barbecue sauce, 1 tb Chopped fresh parsley, Parsley sprigs for garnish",
    "servings": "1 servings",
    "instructions": "Cut the steak lengthwise in half then crosswise into 1/4-inch-thick strips; set aside. In a medium saucepan, bring the beef broth to a boil. Stir in the couscous, cover, and remove from the heat. in a large nonstick skillet, heat the oil over medium-high heat until hot. Add half the beef at a time and stir-fry for 1 to 2 minutes, or until no pink remains. Remove from the skillet with a slotted spoon; keep warm. In the same skillet, stir-fry the pepper and onion for 2 to 3 minutes, or until crisp-tender. Return the beef to the skillet; stir in the barbecue sauce. Cook for 1 to 2 minutes, or until heated through, stirring constantly. Arrange the beef mixture over the couscous, sprinkle with the chopped parsley, and garnish with the parsley springs. NOTE: Couscous is available near the rice and pasta in the supermarket. NOTES : 4 servings",
    "nutrition": {
      "Calories": 3005.2799999999997,
      "Total fat": 185.36,
      "Saturated fat": 56.05,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 770.8,
      "Sodium": 2316.25,
      "Total carbs": 98.61999999999999,
      "Fiber": 6.05,
      "Sugar": 43.56,
      "Protein": 223.23000000000005
    }
  },
  {
    "keyword": "Stir-fry",
    "title": "Honey-Butternut Stir-Fry",
    "ingredients": "1 lb Squash, butternut, 2 tb Vegetable oil, 1 ts Sesame oil, 1/2 c Celery bias- cut, 1 Garlic clove minced, 1/2 ts Gingerroot grated, 1 c Broccoli flowerets, 1/2 sm Onion thinly sliced, -separated into rings, 1 tb Lemon juice, 2 ts Honey (or substitute or -eliminate for those who -object to honey), 2 tb Sunflower nuts",
    "servings": "6 Servings",
    "instructions": "Peel, seed, and slice squash into 1/4-inch slices. Cut slices into small pie-shaped wedges (should have about 2 cups total). In a 10-inch skillet or wok heat oils. Add squash, celery, garlic and gingerroot; stir-fry 3 minutes. Add broccoli and onion; stir-fry 3 to 4 minutes more or until vegetables are crisp-tender. Combine lemon juice and honey; toss with vegetables. Top with nuts. Serve immediately. Makes 5 to 6 servings. Per serving: 127 cal, 2 g pro, 14 g carb, 8 g fat, 0 mg chol, 19 mg sod, 387 mg pot, 4 g fiber, 124% USRDA Vitamin A, 40% USRDA Vitamin C",
    "nutrition": {
      "Calories": 803.4399999999999,
      "Total fat": 54.120000000000005,
      "Saturated fat": 5.89,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 165.70000000000002,
      "Total carbs": 75.14,
      "Fiber": 13.239999999999998,
      "Sugar": 51.830000000000005,
      "Protein": 13.950000000000001
    }
  },
  {
    "keyword": "Stir-fry",
    "title": "Chicken, Tofu, and Vegetable Stir-Fry",
    "ingredients": "1 tb Vegetable oil, 1/2 lb Skinned and boned chicken breasts cut in bite size pcs, 1 c Sliced carrot 1/2 inch thick, 2 c Cubed zucchini, 1 1/4 c Quartered mushrooms, 1 c Cubed red bell pepper 3/4 inch cubes, 1/2 lb Firm tofu drained, cut into 1 inch cubes, 2/3 c Oyster sauce, 6 c Hot cooked rice",
    "servings": "6 Servings",
    "instructions": "1. Heat oil in a large nonstick skillet over medium-high heat. Add chicken; stir-fry 3 minutes or until browned. Add carrot; stir-fry 3 minutes. Gently stir in tofu and oyster sauce; cook until thoroughly heated. Serve over rice. Yield: 6 servings (serving size: 1 cup stir-fry and 1 cup rice). Points: 7; Exchanges 1 lean meat, 3 1/2 starch, 1 vegetable. Per serving: CAL 348 (13 % from fat); PRO 16.9 g; FAT 5 g (SAT 0.8 g); CARB 59.2 g; FIB 2.8 g; CHOL 22 mg; IRON 4.8 mg; SOD 854 mg; CALC 78 mg.",
    "nutrition": {
      "Calories": 2570.8,
      "Total fat": 47.09,
      "Saturated fat": 8.840000000000002,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 385.55,
      "Sodium": 5731.31,
      "Total carbs": 329.78000000000003,
      "Fiber": 19.54,
      "Sugar": 22.29,
      "Protein": 200.64
    }
  },
  {
    "keyword": "Casserole",
    "title": "Elegant Potato Spam Casserole",
    "ingredients": "1 cn Condensed cream of potato soup (10 3/4 oz), 1/4 c Grated Parmesan cheese, divided, 2 tb Sherry, 4 c Hot, prepared mashed potatoes, Vegetable cooking spray, 1 cn SPAM Luncheon Meat, cut into small pieces (12 oz), 1/4 ts Paprika",
    "servings": "8 Servings",
    "instructions": "Heat oven to 425'F. Combine soup, 2 tablespoons cheese, and sherry; stir until smooth. Spoon mashed potatoes into 1 1/2 quart casserole coated with cooking spray. Sprinkle SPAM on top of potatoes. Spread soup mixture over SPAM. Sprinle remaining 2 tablespoons cheese and paprika over soup mixture. Bake 20 minutes or until thoroughly heated.",
    "nutrition": {
      "Calories": 1446.0000000000002,
      "Total fat": 62.56,
      "Saturated fat": 18.419999999999998,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 94.41999999999999,
      "Sodium": 4971.15,
      "Total carbs": 178.64000000000001,
      "Fiber": 17.3,
      "Sugar": 15.200000000000001,
      "Protein": 41.260000000000005
    }
  },
  {
    "keyword": "Casserole",
    "title": "Elegant Seafood Casserole",
    "ingredients": "1 1/2 lb Scrod fillet* (about 1 inch thick), cut into 4 pieces, 1 tb Lemon juice, 1/2 ts Dried tarragon leaves, 4 sl Tomato, 1/2 c Dry white wine, clam juice or chicken broth, 1/2 c Half and half, 5 1/2 tb Cornstarch, 1 cn (about 6 ounces) cooked peeled shrimp, drained, 4 Servings Idaho instant mashed potato flakes**",
    "servings": "1 Servings",
    "instructions": "In microwave-safe 9-inch deep dish, pie plate or shallow casserole. arrange scrod in single layer. Sprinkle with lemon juice, salt, pepper and tarragon. Top each with tomato, onion and mushrooms; add wine. Cover loosely with plastic wrap; cook on High 11 to 13 minutes or until fish flakes easily with fork, rotating dish once. Meanwhile, in microwave-safe 4-cup measure, combine half and half and cornstarch until smooth; stir in shrimp. Drain liquid from scrod into measure. Cook on High 3 to 4 minutes or unti l thickened, stirring once. Pour sauce over scrod. Spread or decoratively pipe potatoes over sauce. Sprinkle with paprika. Cook on High 2 minutes to heat through. Makes 4 servings * Or substitute for any white fleshed fish filet ** Mashed Potatoes: In microwave-safe bowl combine 1 1/4 cups hot water, 1/2 cup milk, 2 tablespoons margarine or butter and 1/2 teaspoon salt. Stir in 1 1/3 cups mashed potato flakes Cover loosely with plastic wrap; cook on High 2 to 3 minutes or until bubbly. Stir before using.",
    "nutrition": {
      "Calories": 2171.1000000000004,
      "Total fat": 88.75,
      "Saturated fat": 23.919999999999998,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 668.76,
      "Sodium": 2464.4799999999996,
      "Total carbs": 108.77000000000001,
      "Fiber": 9.940000000000001,
      "Sugar": 24.01,
      "Protein": 204.94000000000005
    }
  },
  {
    "keyword": "Casserole",
    "title": "Elegant Spinach and Artichoke Casserole",
    "ingredients": "2 pk Frozen chopped spinach, 2 Jars, Artichokes, 1 1/2 c Grated cheddar cheese, 1/2 ts Savory, 1/2 ts Thyme, 1 Onion -- grated, 1/3 c Chopped fresh parsley, 5 Eggs -- well beaten, Salt, pepper and garlic salt, To taste, (6 1/2 oz) marinated",
    "servings": "6 Servings",
    "instructions": "Cook spinach according to package directions, drain. Chop artichokes and put in bottom of 2 quart dish with marinade. Mix everything else together except for 1/2 cup cheese and put in dish over artichokes. Sprinkle with remaining cheese. Bake at 350 for 35 minutes. : DLGREAT",
    "nutrition": {
      "Calories": 1268.7399999999998,
      "Total fat": 81.98999999999998,
      "Saturated fat": 40.18000000000001,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1097.81,
      "Sodium": 2724.83,
      "Total carbs": 55.589999999999996,
      "Fiber": 20.97,
      "Sugar": 9.53,
      "Protein": 84.69
    }
  },
  {
    "keyword": "Casserole",
    "title": "Elegant Tuna Casserole",
    "ingredients": "3 tb Butter or margarine, 4 Green onions chopped, Plus tops, 1 c Fresh mushrooms sliced, 1 tb Parsley chopped, 1 cn Cream of mushroom soup, 1/2 c Dry white wine, 1/4 c Shredded jack cheese, 2 cn (7 Oz) Tuna, Drained, 2 tb Parmesan cheese, 1/2 c Crushed tortilla chips",
    "servings": "6 Servings",
    "instructions": "Place butter, onions, mushrooms and parsley in a 2 quart casserole. Cover. Microwave at high (100%) until onions are tender crisp, 2 to 3 minutes. Add remaining ingredients, except Parmesan cheese and tortilla chips. Microwave at medium high (70%) until hot and bubbly, 8 to 10 minutes. Sprinkle cheese and chips over top. Microwave at medium high (70%) until heated, 1 to 2 minutes. Makes 6 servings.",
    "nutrition": {
      "Calories": 1232.5900000000001,
      "Total fat": 75.11,
      "Saturated fat": 37.150000000000006,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 196.7,
      "Sodium": 3044.93,
      "Total carbs": 65.64,
      "Fiber": 7.87,
      "Sugar": 24.3,
      "Protein": 56.03
    }
  },
  {
    "keyword": "Casserole",
    "title": "Enchalada Casserole",
    "ingredients": "1 cn Refried beans (can use no fat), 1 lg Can red enchalada sauce, 1 Container sliced mushrooms (fresh), 2 Carrots, 1 Zucchini, 1 sm Can corn, 1 pk Flour tortillas (can use no fat), 4 tb White wine, 1 pn Fajita seasoning",
    "servings": "1 Servings",
    "instructions": "Saute mushrooms in 2Tbs white wine. While waiting for mushrooms, cut carrots and zucchini into small 1/4 inch chunks (or smaller depending on preference). When mushrooms are finished, remove to bowel and place remaining wine in saucepan with carrots. Saute carrots for about 5 minutes then add zucchini. You may need to add more wine (and pour a glass for yourself while you're at it!). Saute carrots and zucchini until tender, but not mushy. Remove to bowel with mushrooms. Take a 12 inch (or so) (you can tell I don't measure things well when they're my own recipes) and place 1/4 cup of the sauce in the bottom. Layer two tortillas over sauce and spread refried beans on tortillas. At this point, if you want to sprinkle some grated cheese on the beans, go for it. Then layer with two more tortillas and spoon mushroom, carrot, zucchini mixture on top. Sprinkle corn on to this mixture and cover with two more tortillas. Pour remaining sauce over top and bake for about 20-30 minutes in a 350 degree oven. It sounds complicated, but it's really easy and really good!",
    "nutrition": {
      "Calories": 748.23,
      "Total fat": 14.56,
      "Saturated fat": 3.48,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 2.64,
      "Sodium": 2705.25,
      "Total carbs": 125.52000000000001,
      "Fiber": 23.860000000000003,
      "Sugar": 27.53,
      "Protein": 27.52
    }
  },
  {
    "keyword": "Pasta",
    "title": "Emerald Pea Pasta",
    "ingredients": "1 c Frozen green peas, defrosted, 2 tb Chopped fresh mint, 1 1/2 c All purpose flour, 1 pn Salt, 1 pn Pepper",
    "servings": "2 Servings",
    "instructions": "Place peas & mint in a food processor & puree. Add remaining ingredients & pulse until a ball of dough forms. Turn out onto a floured surface & knead until smooth & pliable like a firm bread dough. Place dough in a bowl, cover with plastic wrap & let rest for at least 30 minutes. Shape & cook dough as desired.",
    "nutrition": {
      "Calories": 825.22,
      "Total fat": 2.3,
      "Saturated fat": 0.39,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 592.12,
      "Total carbs": 170.05,
      "Fiber": 14.83,
      "Sugar": 10.01,
      "Protein": 28.38
    }
  },
  {
    "keyword": "Pasta",
    "title": "Emeril's Cream Sauce over Angel Hair Pasta",
    "ingredients": "1 tb Olive oil, 1/2 c Small diced Tasso sausage, 2 tb Minced shallots, 1 lb Crawfish tails, 1 tb Minced garlic, 1/2 c Peeled seeded, and chopped Italian Plum tomatoes, 1/2 c Chopped green onions, 1 1/2 c Heavy cream, 2 tb Butter, 1 lb Angel hair pasta cooked al denta, 1/2 c Parmesan Cheese, 2 tb Chopped chives, Salt and pepper",
    "servings": "1 Servings",
    "instructions": "1. In a large saute pan, heat the olive oil. 2. When the oil is hot, render the Tasso for 2 minutes. 3. Add the shallots and crawfish and saute for 1 minute. 4. Stir in the garlic, tomatoes, and green onions, saute for 1 minute. 5. Season the mixture with salt and pepper. 6. Stir in the cream and bring up to a boil. 7. Reduce the heat to a simmer and cook for 4-6 minutes or until the sauce has reduced enough to coat the back of a spoon. 8. Season the sauce with salt and pepper. 9. Stir the butter into the sauce. 10. Add the pasta to the pan and gently toss the pasta into the sauce. 11. Garnish the pasta with the grated cheese and chives. Note: Yields: 4 appetizer servings.",
    "nutrition": {
      "Calories": 3161.99,
      "Total fat": 210.94,
      "Saturated fat": 115.37,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1100.0000000000002,
      "Sodium": 3148.7299999999996,
      "Total carbs": 172.82,
      "Fiber": 10.190000000000001,
      "Sugar": 23.31,
      "Protein": 144.26999999999998
    }
  },
  {
    "keyword": "Pasta",
    "title": "Fresh Homemade Pasta with Wild Mushrooms",
    "ingredients": "2 tb Extra virgin olive oil, 2 tb Chopped shallots, 1 tb Chopped garlic, 1/4 ts Red pepper flakes, 2 oz Dried porcini mushrooms, washed and rehydrated, 1/2 lb Cremini mushrooms, cleaned and sliced, Salt and freshly ground pepper to taste, 1/2 c Heavy cream, 6 qt Water, (up to 8), 2 tb Salt, 1 lb Pasta, such as fettucine, 2 tb Shredded fresh basil leaves, 3 tb Pine nuts, toasted, 1/4 c Freshly grated Parmesan cheese",
    "servings": "4 Servings",
    "instructions": "In a saute pan, heat the olive oil over medium heat. Add the shallots, garlic, red pepper and quickly saute being careful to avoid browning or burning. Add the mushrooms, season with salt and pepper and saute together for 5 minutes. Add the cream, reduce the heat to prevent the cream from scorching and cook for several minutes while the pasta cooks. Bring the water to a rolling boil in a large pot and add the salt. Add the pasta to the boiling water. To the mushrooms, add the basil, pine nuts and Parmesan cheese. The pasta will cook in several minutes after returning to the boil. Add the cooked pasta to the sauce and serve.",
    "nutrition": {
      "Calories": 1721.8700000000001,
      "Total fat": 98.53000000000002,
      "Saturated fat": 36.8,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 154.22,
      "Sodium": 13504.340000000002,
      "Total carbs": 169.13,
      "Fiber": 12.79,
      "Sugar": 13.9,
      "Protein": 47.71
    }
  },
  {
    "keyword": "Pasta",
    "title": "Fresh Pasta",
    "ingredients": "3 c Flour, 3 Eggs, 3 tb Vegetable oil, 1 ts Salt, 6 tb Water",
    "servings": "4 Servings",
    "instructions": "Put flour in food processor bowl and add eggs. Blend for a few seconds. Scrape sides of work bowl and blend a few more seconds. Add vegetable oil and salt. Blend into flour mixture. While processor is running, add water in a slow stream. When dough forms a ball, it is ready. If a ball does not form, add 1 Tablespoon of water at a time until it does form a ball. (Do not let the dough get too gummy. If this does happen, take the dough out of the processor and lnead in a little more flour.) When the dough forms a ball, take it out of the processor and knead a few minutes in flour, form into a ball, cover with a bowl and let rest at least 20 minutes. Cut small fistfulls of dough off, pound out with your fist, and run through the pasta machine. Yield: 4 to 6 servings. BECKY MC KINNEY (MRS. RICHARD H., JR.)",
    "nutrition": {
      "Calories": 1939.51,
      "Total fat": 58.67999999999999,
      "Saturated fat": 8.3,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 558.0,
      "Sodium": 805.42,
      "Total carbs": 287.24,
      "Fiber": 10.13,
      "Sugar": 1.57,
      "Protein": 57.58
    }
  },
  {
    "keyword": "Pasta",
    "title": "Fresh Pasta",
    "ingredients": "1 1/2 c All-purpose flour, 2 Eggs",
    "servings": "6 Servings",
    "instructions": "Place flour in work bowl of food processor fitted with steel blade. Add eggs and process until dough comes together and forms ball that rides around on top of blade. If mixture is too dry and fails to form ball, slowly add just enough water to bring ball together, no more than 1 tablespoon. Dough ball should be slightly sticky. If too sticky and soft, add flour 1 teaspoon at time until texture is correct. Knead dough by running processor. Ball with ride around on top of blade, becoming more and more smooth. When smooht enough, remove from processor. Wrap in plastic wrap. Let stand at least 45 minutes. Roll dough out in pasta machine. Divide in quarters and work with 1 portion at time, keeping remainder wrapped in plastic wrap. Flatten dough, then run through machine on widest setting. Fold double and run through again, folded edge first. Repeat 2 or 3 times. Fold double again, and run through sideways. Repeat 2 or 3 more times. Dough will change from fairly sticky and possibly slightly dimpled on 1 side to satiny and smooth. Sheet should be as wide as baking dish (if not, layer dish with 2 sheets rather than 1). Change pasta machine to next-narrower setting. Run dough through machine once. Repeat until next-to-last setting. Before rolling out at next-to-last setting, cut pasta sheet in half. After rolling out at next-to-last setting, lay pasta sheet on lightly floured dish towel and cover with another dish towel. Repeat until all dough has been rolled out.",
    "nutrition": {
      "Calories": 825.5,
      "Total fat": 11.35,
      "Saturated fat": 3.42,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 372.0,
      "Sodium": 145.75,
      "Total carbs": 143.8,
      "Fiber": 5.06,
      "Sugar": 0.88,
      "Protein": 31.93
    }
  },
  {
    "keyword": "Sandwich",
    "title": "Elvis Presley's Fried Peanut Butter and Banana Sandwich",
    "ingredients": "1 sm Ripe banana, 2 sl White bread, 3 tb Peanut butter, 2 tb Butter",
    "servings": "1 Servings",
    "instructions": "In a small bowl, mash to banana with the back of a spoon. Toast the bread lightly. Spread the peanut butter on one slice of toast and the mashed banana on the other. Fry the sandwich in melted butter until each side is golden brown. Cut diagonally and serve hot. NOTES : Elvis loved his \"peanut butter and nanner\" sandwiches. At a hefty 36 grams of fat, they probably helped do him in.",
    "nutrition": {
      "Calories": 787.68,
      "Total fat": 49.74,
      "Saturated fat": 19.81,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 61.03,
      "Sodium": 773.72,
      "Total carbs": 74.89999999999999,
      "Fiber": 7.81,
      "Sugar": 21.75,
      "Protein": 18.61
    }
  },
  {
    "keyword": "Sandwich",
    "title": "Emeril's Favorite Pastrami Sandwich",
    "ingredients": "6 oz Sliced pastrami, 2 tb Whole-grain mustard, 4 oz Beer, 3 sl Onion rings intact, 1 tb Oil, Salt and pepper, 2 sl Rye bread or thick crusty brown bread",
    "servings": "1 Servings",
    "instructions": "Preheat a grill. Season onions with salt and pepper and brush with oil. In a small saucepan combine beer and mustard and bring to a boil. Add pastrami and simmer for 3 minutes. Grill onions on both sides and toast bread on a cooler part of the grill. When all ingredients are heated, prepare sandwich. : ESSENCE OF EMERIL SHOW",
    "nutrition": {
      "Calories": 3698.9,
      "Total fat": 191.09,
      "Saturated fat": 35.059999999999995,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 115.67,
      "Sodium": 8858.89,
      "Total carbs": 396.31000000000006,
      "Fiber": 28.16,
      "Sugar": 44.21000000000001,
      "Protein": 88.71999999999998
    }
  },
  {
    "keyword": "Sandwich",
    "title": "Fried Chick-Pea Sandwiches with Coriander Yogurt",
    "ingredients": "1 cn (19-ounce) chick-peas rinsed well and patted dry, 1 lg Garlic clove chopped, 1/2 ts Ground cumin, 1 ts Salt, 1/4 c Thinly sliced scallion, 4 tb Chopped fresh coriander, 2 ts Sesame seeds, All-purpose flour for dredging the patties, 2 tb Vegetable oil, 2 Pita loaves warmed, halved crosswise, and opened into pockets, 4 sl Tomato, 1/4 c Plain yogurt",
    "servings": "1 Servings",
    "instructions": "Can be prepared in 45 minutes or less. In a food processor purée the chick-peas with the garlic, the cumin, the salt, and pepper to taste until the mixture is smooth. Transfer the mixture to a bowl, stir in the scallion, 3 tablespoons of the coriander, and the sesame seeds, and form the mixture into four 1/2-inch-thick patties. Dredge the patties in the flour and freeze them on a wax paper-lined plate for 10 minutes. In a heavy skillet heat the oil over moderartely high heat until it is hot but not smoking and in it sauté the patties, turning them carefully with a spatula, for 3 minutes on each side, or until they are golden brown. (The patties will be very soft.) Transfer each patty to a pita pocket and insert a tomato slice in each pocket. In a small bowl stir together the yogurt, the remaining 1 tablespoon coriander, and salt and pepper to taste and divide the sauce among the sandwiches. Makes 4 sandwiches, serving 2 as a main course.",
    "nutrition": {
      "Calories": 1755.78,
      "Total fat": 63.46999999999999,
      "Saturated fat": 7.4,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 3.4,
      "Sodium": 1317.1100000000001,
      "Total carbs": 248.32,
      "Fiber": 33.24,
      "Sugar": 27.35,
      "Protein": 56.209999999999994
    }
  },
  {
    "keyword": "Sandwich",
    "title": "Fried Eggplant Sandwiches",
    "ingredients": "1 Eggplant, Salt, 6 oz Mozzarella cheese, (not grated), 1/2 ts Yeast, 1 1/2 c Warm water, (105-115 degrees), 2 c Plain flour, Pepper to taste, 4 1/2 tb Oil, 1 lg Egg white, Oil for frying",
    "servings": "4 Servings",
    "instructions": "Slice the eggplant into 1/4\" rounds. Sprinkle with salt and let drain in a colandar for about an hour. Slice the mozzarella into thin slices and trim to the shape of the eggplant slices. Sprinkle the yeast over the warm water abd stir until is dissolved. Whisk in 1 1/2 cups flour and the pepper until smooth. Keep at room temp for 30 min. Rinse and pat dry the eggplant slices. Fry them in batches using 1 T oil per batch over medium heat about 2 min per side. Remove to paper towels to drain while you finish the other slices. Place a cheese slice between each two eggplant slices (like a sandwich). Press firmly together and dip in the remaining flour to coat both sides. Beat the egg white until stiff (but not dry) peaks form. Fold into the yeast mixture. Heat oil (about 1 inch deep) in a large frying pan. Dip 1 eggplant sandwich into the batter at a time and place in the hot oil. Fry 4-6 at a time for 1-2 minutes per side until light brown. Place on paper towels to drain oil until all are done. Serve hot. These are great with a horseradish type dressing on top! Depending on the size of the eggplant, this could make 6-12 sandwiches. Walt MM",
    "nutrition": {
      "Calories": 106068.51,
      "Total fat": 398.35,
      "Saturated fat": 72.24,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 134.38,
      "Sodium": 2299.02,
      "Total carbs": 21994.800000000003,
      "Fiber": 791.5200000000001,
      "Sugar": 97.73,
      "Protein": 3016.9399999999996
    }
  },
  {
    "keyword": "Sandwich",
    "title": "Grand-Ma-Ma's Spaghetti Sandwiches",
    "ingredients": "1 c Leftover cold spaghetti (with the sauce mixed in it), 2 tb Olive oil, 2 Whole eggs beaten with salt and pepper, 1/4 c Grated Parmesan cheese, Sandwich bread and butter",
    "servings": "1 servings",
    "instructions": "Turn on the oven broiler to high. Put the rack (10cm) from the heat. Put the olive oil in a non-stick fry-pan on medium heat. Add the leftover spaghetti. Turn with a wooden spoon until the spaghetti is warmed. Pour on the eggs and cook for 30 seconds. Sprinkle the cheese over and slide the pan under the broiler. Broil until the eggs are firm and the frittata is lightly browned on top. Slice out onto on to a plate. To serve pile a few slices of the frittata on your favorite bread. Per serving: 461 Calories (kcal); 42g Total Fat; (81% calories from fat); 19g Protein; 2g Carbohydrate; 390mg Cholesterol; 483mg Sodium Food Exchanges: 0 Grain(Starch); 2 1/2 Lean Meat; 0 Vegetable; 0 Fruit; 6 1/2 Fat; 0 Other Carbohydrates",
    "nutrition": {
      "Calories": 1076.34,
      "Total fat": 59.989999999999995,
      "Saturated fat": 18.68,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 424.49,
      "Sodium": 1935.87,
      "Total carbs": 96.77000000000001,
      "Fiber": 7.26,
      "Sugar": 13.239999999999998,
      "Protein": 36.75
    }
  },
  {
    "keyword": "Wrap",
    "title": "Emeril's Beggar Purses Wrapped in a Truffle Crepe",
    "ingredients": "1 1/2 c Milk, 1 c Truffle flour, 2 Eggs, Salt to taste, Freshly-ground white pepper to taste, 2 tb Olive oil, 12 Quail eggs, 12 lg Fresh scallops cleaned, 1 c Truffle Mashed Potatoes hot, see * Note, 12 Whole Chives, 1 Recipe Truffle Salsify Relish, 1 Recipe Spinach And Black Truffle Reduction hot, see * Note, Chopped fresh parsley for garnish",
    "servings": "4 Servings",
    "instructions": "* Note: See the \"Truffle Mashed Potatoes\", \"Truffle Salsify Relish\", and \"Spinach And Black Truffle Reduction\" recipes which are included in this collection. For the crepes: In a mixing bowl, combine the milk, truffle flour, and eggs together. Whisk until smooth. Season the batter with salt and white pepper. Heat a lightly-greased 6-inch pan. Remove from the heat and add 2 tablespoons of the batter. Lift and tilt the pan to spread the batter evenly. Return to the heat; brown on one side only. Flip the crepe, remove from the pan onto parchment paper. Crack the quail eggs into individual ramekins. In a non-stick pan, heat 1 tablespoon of olive oil. When the oil is hot, carefully slide the ramekins with the quail eggs, into the pan. Season the eggs with salt and pepper. Fry the eggs for about 1 minute and remove from the pan and set aside. Season the scallops with salt and pepper. In a large saute pan, heat 1 tablespoon of olive oil. When the oil is hot, add the scallops and sear for 2 to 3 minutes on each side. Remove the scallops and set aside. Place the scallops in the center of each crepe. Place a tablespoon of the Truffle Mashed Potatoes on top of the scallops. Lay a fried quail egg on top of the mashed potatoes. Pull the edges of the crepe together and tie with a long chive, forming a purse-like shape. To serve, spoon the Spinach And Black Truffle Reduction sauce in the center of four plates. Place three scallop purees in the center of the sauce. Spoon the Truffle Salsify Relish around the scallops. Garnish with parsley. This recipe yields 4 main course servings or 12 appetizer servings. Comments: The original recipe title as listed is \"Emeril's Beggar Purses Consisting Of Seared Scallops, Truffle Mash, And Fried Quail Eggs Wrapped In A Truffle Crepe\".",
    "nutrition": {
      "Calories": 4122.03,
      "Total fat": 221.76999999999995,
      "Saturated fat": 101.43000000000002,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1614.6399999999999,
      "Sodium": 3371.4399999999996,
      "Total carbs": 404.66,
      "Fiber": 28.86,
      "Sugar": 211.35000000000002,
      "Protein": 128.0
    }
  },
  {
    "keyword": "Wrap",
    "title": "Fresh Rice Sheets for Noodles or Wrappers",
    "ingredients": "1 c Rice flour, 5 tb Tapioca starch *, 4 tb Wheat starch *, 1 ts Kosher salt, 2 c Water plus, 2 tb Water, 5 ts Oil, x Oil to grease pans",
    "servings": "8 Sheets",
    "instructions": "* Tapioca starch and wheat starch are both pure white, silky textured powders, available in 1-pound bags in well-stocked Asian Markets. 1. Combine rice flour, tapioca starch, wheat starch, salt and water and stir until smooth. Strain batter through a fine strainer and stir in 5 teaspoons oil. Let batter rest 30 minutes. 2. Lightly oil a baking sheet and two 8x8 inch or 9x9 inch square cake pans. Place a steaming rack in a wok and add water to just below rack. Bring to a boil and have additional boiling water ready to replenish steamer. 3. Stir batter very well and pour enough into one of the cake pans to cover bottom, about 1/2 cup. Set pan on steaming rack, cover wok, and steam 5 minutes. Remove lid, being careful not to let condensed water drip on rice sheet. (A tea towel can be placed over pan before covering wok - K.F.) Remove cake pan; cool in a sink or lager pan filled with 1/2 inch cold water. Meanwhile, fill and steam the other cake pan. 4. Loosen the cooled rice sheet from the first pan and roll it out onto the oiled baking sheet. Turn over rice sheet to lightly oil both sides, then transfer to a platter. Repeat cooking, cooling, and oiling steps with remaining batter. 5. Stack rice sheets on a plate, cover with plastic wrap, and refrigerate at least 2 hours before cutting into noodles or adding stuffings. ISBN 0-89721-098-0",
    "nutrition": {
      "Calories": 1600.6899999999998,
      "Total fat": 86.64,
      "Saturated fat": 6.14,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 335.24,
      "Total carbs": 190.39000000000001,
      "Fiber": 5.21,
      "Sugar": 1.56,
      "Protein": 13.600000000000001
    }
  },
  {
    "keyword": "Wrap",
    "title": "Goats' Cheese-Stuffed Pear Wrapped in Parma Ham",
    "ingredients": "1 Pear peeled and cored, 3/4 Bottle red wine, 1 pn Coriander seeds cumin seeds, mixed spice, ground cinnamon, 25 g Goats' cheese, 2 sl Parma ham, 2 ts Olive oil, 1 ds Balsamic vinegar, 1 tb Snipped chives, 50 g French beans topped and tailed, blanched and cut into four, 2 ts Chopped hazelnuts to garnish",
    "servings": "1 servings",
    "instructions": "Preheat the oven to 200c/400f. 1 Place the pear in a pan with the red wine and spices. Poach for about 15 minutes, or until tender. 2 Stuff the base of the pear with the goats' cheese, then wrap the Parma ham around the pear. Place in an ovenproof dish, drizzle with olive oil, and bake in the oven for five minutes. 3 Drizzle with the balsamic vinegar, and serve garnished with the chives, beans and hazelnuts. Per serving: 365 Calories (kcal); 11g Total Fat; (26% calories from fat); 10g Protein; 58g Carbohydrate; 0mg Cholesterol; 23mg Sodium Food Exchanges: 2 Grain(Starch); 1/2 Lean Meat; 0 Vegetable; 1 1/2 Fruit; 2 Fat; 0 Other Carbohydrates",
    "nutrition": {
      "Calories": 7250.21,
      "Total fat": 621.25,
      "Saturated fat": 51.55,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 183.02,
      "Sodium": 2766.53,
      "Total carbs": 217.29999999999998,
      "Fiber": 96.03,
      "Sugar": 73.03999999999999,
      "Protein": 205.2
    }
  },
  {
    "keyword": "Wrap",
    "title": "Golden Tofu Wrap with Warm Asian Slaw",
    "ingredients": "1 tb Peanut oil, 1 lb Low-fat extra-firm tofu OR firm drained and cut into 1-inch cubes, blotted dry, 2 md Garlic cloves minced, 1 sm Jalapeno OR other fresh chile stemmed seeded if desired, minced, 1 1/2 lb Red cabbage shredded as directed, 2 tb Rice wine vinegar, 2 tb Soy sauce, 2 tb Minced fresh cilantro leaves, 4 lg Whole-wheat tortillas (12-inch)",
    "servings": "4 servings",
    "instructions": "INTRO: Golden brown pieces of sauteed tofu are a good foil for a cabbage slaw with Asian seasonings. Serve any extra slaw on the side. For less heat, remove the seeds from the Chile before mincing. 1. Prepare the cabbage. Remove tough outer leaves; quarter. Trim: remove tough white stem/parts. Slice crosswise into very thin strips. 2. Heat 1 tablespoon oil until almost smoking in large nonstick skillet set over medium-high heat. Add tofu and cook, turning pieces every minute or so, until golden brown, about 5 minutes. Transfer tofu to medium bowl. 3. Add garlic and jalapeno to empty skillet and stir-fry over high heat until fragrant, about 20 seconds. Add cabbage and stir-fry until slightly wilted, about 2 minutes. Add vinegar and soy sauce, cover, and cook until cabbage is crisp-tender, about 5 minutes. Stir in cilantro and remove pan from heat. Allow slaw to cool slightly. 4. Meanwhile, heat each tortilla until warm in clean skillet set over medium heat. Lay tortillas flat on work surface. Spread about 3/4 cup slaw down center of each and top with several pieces of tofu. Roll up, tucking sides toward center to form bundle. Slice each roll in half and serve immediately. PER SERVING: 200 calories, 25 percent from fat. 14g protein, 6g fat, 32g carbs, 6g fiber, 672 mg sodium. Good source vitamin C. mc by kitpath 4/27/99",
    "nutrition": {
      "Calories": 1255.2600000000002,
      "Total fat": 54.45,
      "Saturated fat": 14.579999999999998,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 2807.15,
      "Total carbs": 136.33,
      "Fiber": 39.82,
      "Sugar": 32.989999999999995,
      "Protein": 75.54000000000002
    }
  },
  {
    "keyword": "Wrap",
    "title": "Miami Beach Black Bean Wrap",
    "ingredients": "1 cn Black beans drained and rinsed, 19-oz. size, 1/2 c Salsa, 2 tb Fresh lime juice, 1 Red bell pepper diced, 1 sm Jicama (3/4 pound) peeled, diced, 1/2 c Red onion diced, 1/2 c Cilantro packed, 1 Jalapeno pepper seeded, minced, 1/4 ts Salt, 4 lg Flour tortillas burrito size, 1/4 c Sour cream",
    "servings": "1 servings",
    "instructions": "1. Briefly pulse the beans, salsa, and 1 T. lime juice in a food processor, just until combined (but not smooth), about 7 times. Set aside. 2. Combine the pepper, jicama, onion, cilantro, jalapeno, and salt in a large bowl with the remaining lime juice. Toss to combine. 3. To assemble: Heat the tortillas, one at a time, directly on a gas flame, one a grill, or in a hot skillet, turning frequently, until hot and pliable, 5 to 15 seconds each. Or heat stacked, in the microwave. Lay a rounded one-fourth of the black bean salsa in a thick horizontal strip cross the bottom third of the tortilla, making sure the ingredients don't quite touch the edges. Top with a quarter of the salad. Spread 1 T. sour cream lightly over the top. Fold in the two sides and roll the wrap away from you. Complete the wraps with the remaining ingredients. Or, if you prefer, prepare all at once, assembly-line style. Cut in half on the bias. Makes 4 wraps This is a low-fat wrap. Make the black bean salsa and pepper-jicama salad up to a day before serving and refrigerate, but assemble the wraps right before eating. Serve cold or at room temperature.",
    "nutrition": {
      "Calories": 1582.97,
      "Total fat": 42.35,
      "Saturated fat": 15.74,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 60.040000000000006,
      "Sodium": 3158.7400000000002,
      "Total carbs": 251.12,
      "Fiber": 42.5,
      "Sugar": 26.569999999999997,
      "Protein": 56.46
    }
  },
  {
    "keyword": "Curry",
    "title": "Elu Mus (Mutton Curry)",
    "ingredients": "900 g Mutton, 50 ml Vinegar, 1 Onion, 3 Cloves garlic, 4 sl Ginger, 50 ml Oil, 1/2 ts Chilli powder, 2 ts Paprika, 1/2 ts Turmeric, 1/4 ts Black pepper, 3 ts Coriander, 1 ts Cumin, 1/4 ts Fenugreek sprig curry leaves, 500 ml Coconut milk, 1/4 ts Curry powder, 1 ts Salt",
    "servings": "1 Servings",
    "instructions": "Cut the mutton into bite size pieces and place in a bowl. Pour on the vinegar and leave to marinade for 30 minutes. Chop the onion, then grind in a pestle and mortar with the garlic and ginger. Heat the oil and fry the onion, garlic and ginger. Add the chilli powder, paprika powder, turmeric, black pepper, coriander powder, cumin powder, fenugreek and curry leaves and stir fry for 3 minutes. Drain and remove the mutton from the marinade and add to the pan. Fry for 5 minutes, then pour in the coconut milk together with the marinade and bring to the boil. Cover the pan, reduce the heat and simmer for I hour, or until mutton is cooked. Just prior to serving sprinkle with the curry powder and add salt to taste. From \"A taste of Sri Lanka\" by Indra Jayasekera, ISBN #962 224 010 0",
    "nutrition": {
      "Calories": 4130.74,
      "Total fat": 341.08000000000004,
      "Saturated fat": 174.57,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 873.0,
      "Sodium": 1349.4099999999999,
      "Total carbs": 34.82000000000001,
      "Fiber": 5.16,
      "Sugar": 5.519999999999999,
      "Protein": 234.58000000000004
    }
  },
  {
    "keyword": "Curry",
    "title": "Emince De Veau Au Curry Girardet",
    "ingredients": "1 1/8 lb Veal -- rump or filet, 1 1/3 tb Curry powder, Oil, 1 1/8 oz Butter -- unsalted, 5/8 c Dry white wine, 1 1/4 c Heavy cream, Lemon juice, Salt, Pepper, TO GARNISH THE VEAL, OPTIONAL-----, Roasted almonds, Fried onion rings",
    "servings": "1 Servings",
    "instructions": "Cut the veal into slices about 5 mm (1/4 in) thick, then cut it into pieces measuring 1 x 2 cm (3/8 x 3/4 in). Put the meat into a bowl. Sprinkle the meat with the curry powder. Add salt and pepper and mix well with your hands to make sure that all the pices of meat are well seasoned. Using a non-stick pan, make a little splash of oil very, very hot. Add the veal and - without delay - separate the pieces as they cook. After 30 seconds, add the butter, and let the meat colour lightly for 1 minute. The meat should cover the pan in one layer. Take the meat out of the pan with a slotted spoon and put it aside on a plate. Deglaze the pan with the white wine and reduce it by two-thirds over a brisk heat. Add the cream and continue the reduction, boiling fast until the sauce thickens enough to coat the back of a spoon. Set it aside. Put the meat back into the sauce for longh enough to reheat it, but do not let it cook any more. Taste for seasoning, add a dash of lemon juice and serve immediately. Serving: garnish the veal with roasted almonds and fried onion rings. Accompany this curry with a rice pilaff, embellished with little dice of raw sweet pepper, soaked raisins and cooked peas.",
    "nutrition": {
      "Calories": 3168.0699999999997,
      "Total fat": 233.82000000000002,
      "Saturated fat": 117.69,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1163.93,
      "Sodium": 1534.7400000000002,
      "Total carbs": 23.709999999999997,
      "Fiber": 5.4399999999999995,
      "Sugar": 11.100000000000001,
      "Protein": 212.15000000000003
    }
  },
  {
    "keyword": "Curry",
    "title": "English Curry Powder",
    "ingredients": "1 1/4 c Coriander seeds, 2/3 c Cumin seeds, 1/3 c Fenugreek seeds, 1/2 c Besan (gram flour), 1/2 c Garlic powder, 1/3 c Paprika, 1/3 c Turmeric, 1/3 c Garam masala, 1 ts Dried powdered curry leaves, 1 ts Asafoetida, 1 ts Ground ginger, 1 ts Red chile powder such as New Mexican, 1 ts Dry mustard, 1 ts Black pepper freshly ground",
    "servings": "4 Cups",
    "instructions": "In a dry skillet, toast the coriander, cumin and fenugreek seeds, then grind them together in a spice mill. combine with remaining ingredients and mix well. This powder improves as it becomes better blended, the longer it is stored, It is best in about a month, but don't store it longer than 18 months. A World of Curries by Dave DeWitt and Arthur Pais ISBN 0-316-18224-9 pg 212",
    "nutrition": {
      "Calories": 1609.3,
      "Total fat": 53.17999999999999,
      "Saturated fat": 6.469999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 340.14,
      "Total carbs": 287.8,
      "Fiber": 112.9,
      "Sugar": 16.960000000000004,
      "Protein": 77.46999999999998
    }
  },
  {
    "keyword": "Curry",
    "title": "Fried Apples with Curry",
    "ingredients": "4 Apples (Granny Smith are best but any can do.), 1 md Yellow onion sliced thin, 3 tb Butter, 1 tb Curry powder, Salt & pepper to taste",
    "servings": "5 Servings",
    "instructions": "This is a great side dish or relish for any kind of meat course. The flavor is mild but sweet, and the curry sets the natural sugar of the apples. Core and wedge the apples with an apple/pear corer-cutter, or do the same by hand. Heat a frying pan and saut\u0082 the onions with the butter until they are clear. Add the apples and saut\u0082 until the apples are not quite tender. Add the seasonings and toss.",
    "nutrition": {
      "Calories": 745.94,
      "Total fat": 36.83,
      "Saturated fat": 22.200000000000003,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 91.55,
      "Sodium": 582.59,
      "Total carbs": 113.72000000000003,
      "Fiber": 22.13,
      "Sugar": 80.29,
      "Protein": 4.44
    }
  },
  {
    "keyword": "Curry",
    "title": "Goan Creamy Curry",
    "ingredients": "500 g Panir cheese cubed, 200 g Mushrooms, 200 g Peas, 100 g Spinach, 50 ml Groundnut oil, 2 ts Garam masala, 2 ts Ground coriander, 1 ts Ground cumin, 100 ml Coconut milk, 100 ml Double cream, 1 ts Salt, 2 Fresh red chillies, 1 ts Turmeric, 2 Cm root ginger grated, 2 Cloves garlic crushed, 100 ml Water",
    "servings": "1 servings",
    "instructions": "Shallow fry the panir. Add the salt, garam masala, coriander, cumin, turmeric, ginger, chillies and garlic and saut\u0082 lightly. Add the water and bring to the boil. Add the peas and mushrooms and simmer for 10 minutes. Add the spinach, coconut milk and cream and simmer for 5 minutes. Serve with rice.",
    "nutrition": {
      "Calories": 1284.98,
      "Total fat": 107.89000000000001,
      "Saturated fat": 45.17,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 114.01,
      "Sodium": 721.1499999999999,
      "Total carbs": 68.9,
      "Fiber": 22.49,
      "Sugar": 24.84,
      "Protein": 26.55
    }
  },
  {
    "keyword": "Bowl",
    "title": "Greek Lamb Salad in Tortilla Bowls",
    "ingredients": "4 Tortillas, 1 tb Olive oil, 1 lb Lean ground lamb, 1 ts Cumin, 1/2 c Plain yogurt, 1 ts Minced garlic, 3 tb Lime juice, 3 tb Chopped cilantro, 8 Cherry tomatoes - quartered, 1 c Diced cucumber, 1 Head romaine lettuce - shredded",
    "servings": "1 servings",
    "instructions": "Directions: To make the tortilla bowls, form aluminum foil molds and place them open side down on a baking sheet. Spray each tortilla with cooking spray and place over the mold. Bake at 425 degrees for 8-10 minutes until golden. To make the salad, heat the olive oil in a large skillet. Add the lamb and cumin and cook until crumbly and no longer pink. Drain and set aside. Combine the yogurt, garlic, lime juice, cilantro, tomatoes, and cucumber in a mixing bowl. Fill each tortilla bowl with a small handful of shredded romaine. Top with the cooked lamb and a spoonful of dressing.",
    "nutrition": {
      "Calories": 2282.5300000000007,
      "Total fat": 121.19999999999999,
      "Saturated fat": 43.57000000000001,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 446.78000000000003,
      "Sodium": 1449.79,
      "Total carbs": 151.56000000000003,
      "Fiber": 22.72,
      "Sugar": 21.74,
      "Protein": 145.73999999999998
    }
  },
  {
    "keyword": "Bowl",
    "title": "Champagne Fruit Bowl",
    "ingredients": "4 Apples and/or pears, cored, cut up, 1/4 c Orange juice, 2 tb Lemon juice, 4 c Assorted summer fruits such as:, Strawberries, halved, Melon balls, Nectarines, sliced, Peaches, Plums, Seedless grapes, 3 tb Sugar, 2 ts Finely shredded orange peel, 1 187 ml bottle champagne, chilled, 1/3 c Sliced almonds, toasted",
    "servings": "12 Servings",
    "instructions": "In a large bowl combine cut-up apples and/or pears withthe orange juice and lemon juice; toss gently to prevent fruit from discoloring. Add remaining fruit, the sugar and shredded orange peel; toss again. Cover and refrigerate fruit mixture for up to 2 hours. Just before serving, stir in chilled champagne; sprinkle with toasted almonds, if desired.",
    "nutrition": {
      "Calories": 1689.55,
      "Total fat": 23.39,
      "Saturated fat": 2.1100000000000003,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 66.96,
      "Total carbs": 357.28000000000003,
      "Fiber": 52.17,
      "Sugar": 264.63,
      "Protein": 22.59
    }
  },
  {
    "keyword": "Bowl",
    "title": "Vlf: Super Bowl Brownies",
    "ingredients": "1 c Flour, 1 c Cocoa, 1 pn Salt, 1 ts Baking powder, 1/2 c Packed brown sugar, 1 1/2 ts Vanilla, 1/2 ts Almond extract, 4 Egg whites at room temp, 1 c Honey",
    "servings": "1 Servings",
    "instructions": "These are extremely low in fat, and the taste is more slightly bitter dark chocolate than the milk-chocolate sweet of most brownies, however if you love chocolate, they're a great treat! In a large bowl sift flour, cocoa, salt, baking powder and packed brown sugar. In small bowl beat until creamy vanilla, almond extract, egg whites and honey. Combine and mix well. Pour into a 13 x 9 baking pan sprayed with non-stick spray. Bake at 375 (350 glass) 15-20 minutes. Poke with a toothpick and if it comes out with fudgy crumbs, it's done. Do not overbake! Cool completely before cutting into pieces. You can add chopped nuts, however it will raise the fat content substantially.",
    "nutrition": {
      "Calories": 2239.96,
      "Total fat": 9.450000000000001,
      "Saturated fat": 0.19,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 0.0,
      "Sodium": 1329.5900000000001,
      "Total carbs": 511.44000000000005,
      "Fiber": 20.07,
      "Sugar": 365.21,
      "Protein": 44.419999999999995
    }
  },
  {
    "keyword": "Bowl",
    "title": "Ginger Bread Cookies in a Ginger Bread Bowl",
    "ingredients": "1 c Butter, 3/4 c Brown sugar packed, 1/2 c Sugar, 1/3 c Light molasses, 3/4 c Dark corn syrup, 3 Eggs, 8 1/2 c All-purpose flour, 1 tb Baking soda, 1 ts Salt, 1 ts Each: ginger cloves, cinnamon, allspice, ground",
    "servings": "1 Servings",
    "instructions": "Cream butter and sugars. Beat in molasses. corn syrup, and eggs until smooth. In a separate bowl combine remaining ingredients and blend. Stir the flour mixture into the creamed mixture. Dough will be stiff. Divide dough into fourths and wrap each in plastic wrap. Chill at least 2 hours. Preheat oven to 350. Smoothly cover the outside of an oven proof glass bowl with aluminum foil.On a lightly floured surface roll out one of the fourths with a floured rolling pin into a 1/4\" thick circle.Transfer dough to the outside of the bowl, pressing firmly onto bowl.Make a nice fluted bowl edge. Use a small 1\" cookie cutter any shape desired, (hearts, holly) and cut out shapes around bowl edge. (Remember the bowl is going to be turned over when pressing in design.)Place inverted bowl on a baking sheet and bake at 350 for 25-30 minutes or til firm to the touch. Allow to cool on glass bowl. CAREFULLY loosen foil and remove foil and gingerbread bowl from glass bowl. Roll out remaining dough 1/8\" thick and cut out shapes. Place on a lightly greased baking sheet and bake 8-10 minutes or till lightly browned, cool on rack. Makes 1 bowl and 3 dozen cookies. I weave a red ribbon through the shapes I cut in the bowl, and tie into a bow. Fill with cookies and cover in colored cellophane.",
    "nutrition": {
      "Calories": 7638.66,
      "Total fat": 209.48000000000002,
      "Saturated fat": 123.16,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1046.27,
      "Sodium": 6515.25,
      "Total carbs": 1319.2299999999998,
      "Fiber": 31.23,
      "Sugar": 504.10999999999996,
      "Protein": 131.07999999999998
    }
  },
  {
    "keyword": "Bowl",
    "title": "Chocolate-Peppermint One-Bowl Brownies",
    "ingredients": "4 oz Unsweetened baking chocolate (4 squares), 3/4 c Butter or margarine (1 1/2 sticks), 2 c Granulated sugar, 3 Eggs, 1 ts Vanilla, 1 c All-purpose flour, 1 c Coarsely chopped nuts optional, 4 White baking chocolate (1-oz) melted, Crushed peppermint candies",
    "servings": "36 Servings",
    "instructions": "Microwave unsweetened chocolate and butter in large microwavable bowl on High power 2 minutes or until butter is melted. Stir until chocolate is completely melted. Stir sugar into chocolate until well-blended. Mix in eggs and vanilla. Stir in flour and nuts until well-blended. Spread in pan. Bake 30 to 35 minutes or until toothpick inserted in center comes out with fudgy crumbs. Do not overbake. Let cool in pan. Cut into 36 (2 3/4-by-1-inch) sticks. Drizzle with melted white chocolate. Sprinkle with crushed peppermint candies. Yield: 3 dozen. These recipes are from Baker's.",
    "nutrition": {
      "Calories": 8092.920000000001,
      "Total fat": 714.58,
      "Saturated fat": 412.28000000000003,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 2025.6399999999999,
      "Sodium": 5001.76,
      "Total carbs": 373.03,
      "Fiber": 36.55,
      "Sugar": 212.86,
      "Protein": 84.81
    }
  },
  {
    "keyword": "Pizza",
    "title": "Emeril's Pizza",
    "ingredients": "1 tb Yeast, 1 c Warm water (110 degrees), 1/4 c Olive oil, 4 c Flour, 2 ts Salt, 1 lb New potatoes, thinly sliced, blanched, 1 c Julienned red onions, 2 tb Extra virgin olive oil, Salt and white pepper, 1/2 c Grated Parmigiano-Reggiano cheese, Drizzle of truffle oil, 2 tb Chopped chives",
    "servings": "1 Servings",
    "instructions": "Preheat the oven 400 degrees. In an electric mixer, whisk the yeast, water, and oil, together, to form a paste. Using a dough hook, add the flour and salt to the paste, mix the dough until the dough comes away from the sides and crawls up the sides of the hook. Remove the dough from the bowl and turn the dough into a greased bowl, cover. Let the dough rise until double in size, about 1 hour. Turn the dough out onto a floured surface and divide into 4 (4-ounce) balls, cover. Let the dough rest for 10-15 minutes. Press each dough out into a 10-inch circle about 1/2 -1-inch thick. Lightly brush the dough with olive oil. Divide the potatoes into four portions and season with salt and pepper. Cover the each dough with the potatoes, leaving a 1-inch border. In a small mixing bowl, toss the red onions with the extra virgin olive oil. Season with salt and pepper. Place a layer of the red onions on top of the potatoes. Sprinkle each pizza with the grated cheese. Drizzle each pizza with the truffle oil. Bake for 15-20 minutes or until the crust is crispy and golden brown. Garnish the pizza with chives.",
    "nutrition": {
      "Calories": 3415.32,
      "Total fat": 113.96000000000001,
      "Saturated fat": 21.12,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 38.7,
      "Sodium": 2635.95,
      "Total carbs": 513.95,
      "Fiber": 30.709999999999997,
      "Sugar": 17.72,
      "Protein": 84.21
    }
  },
  {
    "keyword": "Pizza",
    "title": "English Muffin Pizza",
    "ingredients": "Englesh muffen, Sause, Cheese, Parsoly",
    "servings": "1 Servings",
    "instructions": "Take an englesh muffin and Put some sause and any kind of cheese and parsaly. Put in the oven for 375 degreze. Cook for about 10 or 15 minets. Then take out of the oven, let it cool. And it is ready to eat. And in the meantime, here's my recipe (I think I had the most spelling errors of the whole class!).",
    "nutrition": {
      "Calories": 113.12,
      "Total fat": 9.33,
      "Saturated fat": 5.28,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 27.72,
      "Sodium": 182.84,
      "Total carbs": 0.87,
      "Fiber": 0.0,
      "Sugar": 0.13,
      "Protein": 6.4
    }
  },
  {
    "keyword": "Pizza",
    "title": "English Muffin Pizza Melt",
    "ingredients": "1 lb Lean ground beef, 1/4 c Onion chopped, Nonstick vegetable cooking spray, 1 cn Pizza sauce (8-oz), 1 ts Dried parsley flakes, 1/2 ts Basil, 1/4 ts Garlic powder, 2 tb Mozzarella cheese shredded, 3 English muffins split",
    "servings": "1 Servings",
    "instructions": "Preheat oven to 350 degrees. Cook beef and onion in skillet coated with vegetable spray. Cook until meat is no longer pink. Drain and dry with paper towels to reduce fat. Stir in pizza sauce and seasonings. Top each muffin with 1/6 cup beef mixture. You may toast muffins before adding meat and cheese. Top with 1 teaspoon cheese. Place in oven and bake for 10 to 15 minutes or until heated thoroughly and cheese is melted. Exchanges: All lunch menus this week have about 450 calories total and include: 2-3 Starch servings 1-2 Meat or Meat Substitute servings 0-2 Vegetable servings 1 Fruit serving 1 Fat serving Total Fat -- 15g Total Carbohydrate -- 50g Protein -- 22g Some menus have 1 Skim Milk serving instead of 1 Meat or 1 Starch serving. Or 1 Starch serving instead of the Fruit serving. Lunch: 1 cup chicken noodle soup 1 English Muffin Pizza Melt Tossed salad with 2 Tbsp reduced-calorie dressing 1 pear NOTES : 6 servings/Serving size: 1/2 muffin plus 1/6 topping",
    "nutrition": {
      "Calories": 1612.0500000000002,
      "Total fat": 62.07,
      "Saturated fat": 24.020000000000003,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 414.76,
      "Sodium": 1531.5900000000001,
      "Total carbs": 103.06,
      "Fiber": 10.89,
      "Sugar": 8.14,
      "Protein": 150.33999999999997
    }
  },
  {
    "keyword": "Pizza",
    "title": "English Muffin Pizzas",
    "ingredients": "4 English muffins split, 1/2 lb Extra lean ground beef, 1/4 ts Salt, 1/4 ts Oregano, 1/8 ts Black pepper, 1/8 ts Garlic salt, 1/2 c Tomato sauce, 1/2 c Mozzarella cheese shredded, 1 ts Grated Parmesan cheese",
    "servings": "4 Servings",
    "instructions": "Preheat oven to 375-degrees F. Brown ground beef in skillet. Drain excess fat. Add salt. In a small mixing bowl, combine tomato sauce, oregano, pepper, and garlic salt. Arrange muffin halves on a baking sheet. Spread tomato mixture over each muffin half. Top tomato mixture with browned ground beef. Top beef with mozzarella and Parmesan cheeses. Bake for 10 to 15 minutes or until cheese melts.",
    "nutrition": {
      "Calories": 1152.59,
      "Total fat": 30.780000000000005,
      "Saturated fat": 14.87,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 250.39000000000001,
      "Sodium": 2463.45,
      "Total carbs": 113.69000000000001,
      "Fiber": 8.180000000000001,
      "Sugar": 4.95,
      "Protein": 99.74000000000001
    }
  },
  {
    "keyword": "Pizza",
    "title": "English Muffin Pizzas",
    "ingredients": "4 English muffins, 1 Jar pizza quick sauce, Mozzarella cheese",
    "servings": "4 Servings",
    "instructions": "spread sauce on muffins. top with cheese. Bake at 350 for about 8-10 minutes.",
    "nutrition": {
      "Calories": 971.4699999999999,
      "Total fat": 22.939999999999998,
      "Saturated fat": 9.39,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 43.230000000000004,
      "Sodium": 2452.3700000000003,
      "Total carbs": 150.97,
      "Fiber": 11.0,
      "Sugar": 10.6,
      "Protein": 37.87
    }
  },
  {
    "keyword": "Tacos",
    "title": "Hot 'n Spicy Chicken Soft Tacos",
    "ingredients": "1 1/2 lb Skinless, boneless chicken breasts, (cut in strips, no more than 1/4\" wide), 1 Whole med. size white onion, cut into strips or diced, 2 tb Red chile powder, 1 ts Curry powder, 1/2 ts Ground cumin (optional), 1 Pressed garlic clove (or 3/4 tsp. garlic powder), 1 ts Salt (salt to taste if desired), 1 ts Lemon and pepper, or 1 tsp. grated lemon peel (optional), 3/4 c Water (or wine), 2 tb Olive oil, 1 tb Vegetable oil",
    "servings": "4 Servings",
    "instructions": "Recommended Fillings & Wrapper: Flour Tortillas, Cheddar Cheese, Tomatoes Lettuce, Onion, Salsa. Preparation: In glass or stainless steel bowl combine all ingredients except olive oil and vegetable oil. Mix thoroughly to spread spices over chicken, water should be completely absorbed, refrigerate for 1 hour. After refrigeration add Olive oil, and stir until chicken is well coated with oil, spice aromas will be noticeably lighter. Heat Vegetable oil in non-stick pan, and add mixture, frying on medium heat. Cover until water has separated from chicken, and is boiling. Leave uncovered, on low heat, to simmer until almost all water has evaporated. Total cook time is less than ten minutes, do not overcook. Place prepared mixture in center of flour tortillas, add cheese and other fillings as desired (suggestions above). Fold in half, or roll like burrito. Top with beans or spanish rice. Serves 4-6.",
    "nutrition": {
      "Calories": 1550.1600000000003,
      "Total fat": 65.69,
      "Saturated fat": 11.709999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 578.33,
      "Sodium": 1314.0499999999997,
      "Total carbs": 15.03,
      "Fiber": 3.18,
      "Sugar": 5.6499999999999995,
      "Protein": 213.55999999999997
    }
  },
  {
    "keyword": "Tacos",
    "title": "Beef Tacos",
    "ingredients": "1 lb Lean Ground Beef, 1 pk Taco Seasoning Mix, 2 c Sharp Cheddar Cheese grated, 2 Tomatoes chopped, 1 Or 2 cups Lettuce shredded, 1 md Onion diced, 12 Corn Tortillas soft or hard, Sour Cream and Salsa (optional garnishes)",
    "servings": "6 servings",
    "instructions": "Brown the ground beef in a skillet over medium heat setting. If desired, add half the onions now and brown with the ground beef. Drain any excess fat and add the taco seasoning mix, making sure to blend well. To prepare and serve the tacos, simply place a layer of the meat in the bottom of the tortilla, cover with a layer of cheese, a few diced tomatoes, lettuce, and raw diced onion as desired. Serve with optional garnishes or enjoy as is. Kitchen Staff Tip: Looking for a Chili Con Queso that's easy to prepare and serve? Try sautéing about 1/2 cup of minced onions with 1/4 cup butter in a skillet over medium heat. Stir in 1 cup of chopped tomatoes, 4-ounces of green chilies and about 1/2 teaspoon of salt. Simmer the mixture for about 15 minutes, then start adding 1/2 pound of cubed cheddar cheese to the mixture a few pieces at a time, melting and stirring as you go. Pour the prepared queso into a chafing dish or fondue pot to keep warm while serving with plain tortilla chips. You can add a little milk to the mixture if it's too thick. Dip the chips and enjoy.",
    "nutrition": {
      "Calories": 2162.7900000000004,
      "Total fat": 133.9,
      "Saturated fat": 65.49000000000001,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 634.5200000000001,
      "Sodium": 2574.1000000000004,
      "Total carbs": 46.15,
      "Fiber": 9.19,
      "Sugar": 15.799999999999999,
      "Protein": 187.81
    }
  },
  {
    "keyword": "Tacos",
    "title": "Ceviche Tacos",
    "ingredients": "1 1/2 lb Red snapper fillets in 1/2\" chunks, Juice of 10 limes, 1 Onion finely chopped, 1 Jalapeno pepper seeded/finely choppd, 14 1/2 oz Can tomatoes, 1/2 c Corn kernels, 1/4 c Chopped cilantro, 2 tb Olive oil, 2 tb Catsup, 1 tb Worcestershire sauce, 1/2 ts Dried oregano, Salt to taste, 8 Corn tortillas, 1 Red onion thinly sliced, 1 Avocado peeled/sliced",
    "servings": "4 Servings",
    "instructions": "NOTES : Fish is marinated in lime juice overnight.*",
    "nutrition": {
      "Calories": 2414.0599999999995,
      "Total fat": 78.03999999999999,
      "Saturated fat": 11.92,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 319.78,
      "Sodium": 2095.4500000000003,
      "Total carbs": 257.52000000000004,
      "Fiber": 58.18,
      "Sugar": 61.900000000000006,
      "Protein": 208.66000000000003
    }
  },
  {
    "keyword": "Tacos",
    "title": "Change- Of-Pace Tacos",
    "ingredients": "1/2 lb Fresh white or brown (crimini) Monterey Mushrooms, 1/4 c Taco sauce, 1/4 c Chopped onion, 1 tb Chopped green pepper, 1/4 ts Salt, 2 ts Cornstarch, 3 Ready-to-heat taco shells, 3 oz Finely shredded pasteurized process cheese product, Shredded lettuce, Diced tomato salted",
    "servings": "4 Servings",
    "instructions": "Combine taco sauce, onion, green pepper and salt in medium-sized saucepan. Bring to boil. Reduce heat. Cover and simmer about 5 minutes, stirring occasionally. Toss cornstarch with mushrooms. Stir into sauce. Simmer uncovered, 8 minutes or until mushrooms are tender and sauce is thick. Stir occasionally. Meanwhile, heat taco shells according to package directions. Spoon 2 tablespoons mushroom mixture into shell. Top with 2 tablespoons cheese product. Repeat for remaining tacos. Add lettuce and tomato as desired. Makes 4 servings. Try a mushroom filling instead of meat.",
    "nutrition": {
      "Calories": 685.12,
      "Total fat": 33.89,
      "Saturated fat": 17.34,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 84.2,
      "Sodium": 1286.4800000000002,
      "Total carbs": 70.51,
      "Fiber": 14.410000000000002,
      "Sugar": 22.049999999999997,
      "Protein": 32.709999999999994
    }
  },
  {
    "keyword": "Tacos",
    "title": "Crockpot Tacos or Burritos",
    "ingredients": "8 Boneless skinless chicken breast halves -OR-, 3 lb Sirloin, stew beef, or whatever is lean and on sale, 1 pk Taco seasoning mix, Water to cover, Cheddar cheese shredded, Sour cream, Refried beans, Sliced black olives, Sliced green onions, Chopped fresh tomatoes, Salsa, Shredded lettuce, Sliced jalapenos, Tortillas, corn or flour",
    "servings": "8 Servings",
    "instructions": "Leave meat in whole pieces; you may even put it in frozen. In the morning, put the meat into the crockpot, add taco seasoning mix, and water. Plug it in and turn it on simmer according to manufacturer's directions. If you have time in the morning, shred the cheese and lettuce and chop the tomatoes and store in ziplock or Rubbermaid containers in the refrigerator. : Brenda Beach (Rooby) NOTES : You probably won't see this done on a fancy cooking show, but this is a really easy dinner to make that my family really enjoys, and there are always leftovers for easy after-school grazing the next day, or even another meal.",
    "nutrition": {
      "Calories": 4331.25,
      "Total fat": 156.25,
      "Saturated fat": 58.66999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1561.16,
      "Sodium": 2947.1300000000006,
      "Total carbs": 154.06,
      "Fiber": 18.51,
      "Sugar": 9.170000000000002,
      "Protein": 544.55
    }
  },
  {
    "keyword": "Burrito",
    "title": "Mexican Burritos",
    "ingredients": "1 Mexican pancake (tortilla), 1 c Cooked mixed beans, 1 c Mixed colour peppers sliced, 1 Clove garlic chopped, Coriander, 1 Handful leeks chopped very small, 1 Handful mushrooms, 1 Spoonful plum tomatoes, 1/2 c Salsa sauce, Spoonful sour cream, 1 Handful grated cheese",
    "servings": "1 servings",
    "instructions": "Fry the beans, leeks, peppers and garlic until just soft, adding the mushrooms and tomatoes in the last few minutes. Spoon the mixture into your burrito. Fold over and cover with salsa sauce, the sour cream and the cheese.",
    "nutrition": {
      "Calories": 803.9000000000001,
      "Total fat": 31.240000000000002,
      "Saturated fat": 13.66,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 90.15,
      "Sodium": 2681.02,
      "Total carbs": 97.78000000000002,
      "Fiber": 20.86,
      "Sugar": 24.319999999999997,
      "Protein": 39.57
    }
  },
  {
    "keyword": "Burrito",
    "title": "Best Burritos",
    "ingredients": "16 oz Canned fat-free refried beans, 1 3/4 c Medium to hot salsa, 5 ts White wine or cooking liquid of your choice, 14 oz Gimme Lean! meatless sausage, 3 lg Onions chopped, 2 lg Potatoes diced (3 cups), 1/8 ts Paprika, 6 Flour tortillas low fat, (8-to 9-inch)",
    "servings": "6 servings",
    "instructions": "6 SERVINGS DAIRY-FREE You can assemble these healthful treats as directed, wrap airtight in foil and freeze for up to three months. Thaw overnight in the refrigerator before heating as directed. Preheat oven to 425=F8 F. In small saucepan, stir together beans and 3/4 cup salsa. Cook, stirring occasionally, over very low heat just until warmed through. Meanwhile, in large nonstick skillet, heat 2 1/2 teaspoons wine over medium heat. Add \"sausage\" and cook, stirring occasionally and breaking up large pieces with fork, until browned, about 5 minutes. Transfer to bowl; set aside. Add remaining 2 1/2 teaspoons wine to skillet and heat over medium heat. Add onions and cook, stirring often, until softened, about 4 minutes. Stir in potatoes, paprika and freshly ground pepper to taste. Cook, stirring often, until potatoes are almost tender, 17 to 20 minutes. Return \"sausage\" to skillet and mix well. Cook until potatoes are tender, about 3 minutes more. Remove from heat. Tear six large pieces of foil. Place tortillas flat on foil and thinly spread each with about 1/4 cup bean mixture. Spoon heaping 1/2 cup potato mixture down center of each tortilla. Top potato mixture with remaining salsa (use about 2 1/2 tablespoons salsa for each tortilla). Fold bottom of each tortilla up to cover filling. Fold sides toward center, then roll up from bottom. Wrap in foil and bake until hot, about 10 minutes.",
    "nutrition": {
      "Calories": 3726.1200000000003,
      "Total fat": 136.78000000000003,
      "Saturated fat": 42.830000000000005,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 242.11,
      "Sodium": 10101.48,
      "Total carbs": 380.75,
      "Fiber": 51.620000000000005,
      "Sugar": 49.89,
      "Protein": 117.55000000000001
    }
  },
  {
    "keyword": "Burrito",
    "title": "Best Burritos",
    "ingredients": "1 lb Lean ground beef, 1 pk Frozen chopped spinach thawed and drained well (10 ounces), 1 sm Onion chopped, 1 1/2 c Shredded Monterey Jack cheese (6 ounces), 1 Clove garlic crushed, Four 10-inch or eight 8-inch flour warmed tortillas, 1/2 ts Chili powder, Lime slices optional, 1/4 ts Ground cumin, Jalapeno pepper slices optional, 1/2 ts Salt, 1 c Prepared chunky salsa, 1/4 ts Black pepper",
    "servings": "1 servings",
    "instructions": "In a large nonstick skillet, brown the ground beef, onion, and garlic over medium heat for 8 to 10 minutes, or until the beef is no longer pink, stirring occasionally. Pour off the drippings and stir in the chili powder, cumin, salt, and pepper. Stir in the spinach and heat through. Remove from the heat and stir in the cheese. Spoon equal amounts of the mixture into the center of the warmed tortillas; fold each bottom edge over the filling, then fold each side into the center, overlapping the edges. Garnish with the lime and jalapeno slices, if desired, and serve with the salsa. NOTE: If using fresh jalapeno peppers, here's a tip to protect you from the sting of the juices and seeds: Rub your hands well with vegetable oil before handling the peppers. Be careful not to rub your eyes or the corners of your mouth with your hands until you wash them well, because the pepper oil stings your eyes and mouths, too! Coating your hands with oil will make them slippery, so be extra careful when handling a knife or other kitchen utensils! NOTES : 4 servings",
    "nutrition": {
      "Calories": 5671.370000000001,
      "Total fat": 120.84999999999998,
      "Saturated fat": 56.33999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 554.56,
      "Sodium": 4039.92,
      "Total carbs": 835.8699999999999,
      "Fiber": 42.38,
      "Sugar": 21.41,
      "Protein": 289.94
    }
  },
  {
    "keyword": "Burrito",
    "title": "Giant Burrito",
    "ingredients": "8 Flour tortillas (med-large sized), 1/2 lb Ground beef browned, with:, Taco seasoning (follow directions on seasoning pkg.), 1 c Refried beans, 1 c Cheddar or jack cheese shredded, 2 c Iceberg lettuce chopped or shredded, 1/4 c Green onions chopped, 1/4 c Black olives chopped or sliced, 1/3 c Sour cream, 1/3 c Salsa, 1 Avocado sliced (or 1/3 cup guacamole)",
    "servings": "1 Servings",
    "instructions": "(The measurements are not at all precise -- use as much or as little as you like. Also, you can vary these ingredients as you like -- for example, omit the meat and just due vegetarian; or use a different meat; etc. ALSO...this version makes about a 2-3 foot burrito but you can use more tortillas and make as large a burrito as you need.) Soften tortillas by putting them in the microwave for 25-45 seconds. Arrange tortillas on a sheet of aluminum foil in a 2 x 4 arrangement (4 tortillas overlapping in one row, then the other four overlapping in a row below the first four -- picture the Olympic Rings for an idea of what I'm talking about!). Begin adding your fillings, first spreading the sour cream, salsa and beans along the center of your line of tortillas, next adding the avocados, cheese, and other ingredients. Then, use the foil to help you wrap the tortillas over the fillings to create a giant burrito. Wrap as tightly as possible, then seal the foil (you might have to use 2 sheets of foil) to hold the burrito shape. Secure with toothpicks. Refrigerate for 1 hour or more to mold the shape. When you are ready to serve, unwrap the burrito on a large cutting board, remoing the foil but leaving the toothpicks (the shape will hold very well). Just before serving, slice into 2\" wide slices. Serve with a little dipping bowl of salsa and sour cream. YUM!",
    "nutrition": {
      "Calories": 3282.9299999999994,
      "Total fat": 169.13,
      "Saturated fat": 63.5,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 392.18,
      "Sodium": 5666.7699999999995,
      "Total carbs": 292.31,
      "Fiber": 41.02,
      "Sugar": 13.02,
      "Protein": 150.89999999999998
    }
  },
  {
    "keyword": "Burrito",
    "title": "Corn, Black Bean and Rice Burritos",
    "ingredients": "4 oz Cooked rice *see note, 16 oz Canned black beans rinsed and drained, 15 oz Canned whole kernel corn drained, 4 oz Canned chopped mild green chiles drained, 2/3 c Shredded Monterey Jack or Cheddar cheese, 1/4 c Chopped fresh cilantro, 8 Flour tortillas (6 to 7-inch), 12 oz Mild salsa fatfree (one jar)",
    "servings": "4 Servings",
    "instructions": "1. Preheat oven to 425 degrees F. Prepare rice as label directs. 2. Meanwhile, in large bowl, combine black beans, corn, chiles, cheese, and cilantro. 3. When rice is done, stir into bean mixture. Spoon rounded 1/2 cup rice mixture along center of each tortilla. Spoon 1 tablespoon salsa on top of rice filling. Fold sides of tortilla over filling, overlapping slightly. 4. Spray 13\" by 9\" glass or ceramic baking dish with nonstick cooking spray. Place burritos, seam-side down, in dish. Spoon any remaining rice mixture in a row down center of burritos; top rice with remaining salsa. Cover loosely with foil and bake 15 minutes. Notes: While these burritos are baking, make a salad of sliced cucumbers tossed with Honey-Lime Vinaigrette (see recipe). Work Time: 15 minutes; Total Time: 30 minutes. *RICE: 1/4 14-ounce package precooked long-grain rice (1 boil-in-bag) Measures for canned goods are approximate because cans vary.",
    "nutrition": {
      "Calories": 3376.2599999999998,
      "Total fat": 72.51,
      "Saturated fat": 28.41,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 95.44999999999999,
      "Sodium": 21201.88,
      "Total carbs": 584.5699999999999,
      "Fiber": 101.96000000000001,
      "Sugar": 122.22999999999999,
      "Protein": 142.57000000000005
    }
  },
  {
    "keyword": "Pie",
    "title": "Elvis' Hush Puppies",
    "ingredients": "2 c Cornmeal, 1/2 c Onion chopped, 1 tb All-purpose flour, 1 ts Baking powder, 1 ts Baking soda, 1 ts Salt, 1 Egg well beaten, 1 1/2 c Buttermilk, Vegetable oil for frying",
    "servings": "1 Servings",
    "instructions": "Heat oil in a large saucepan or deep fryer to 375 degrees. Combine cornmeal, chopped onion, flour baking powder, baking soda and salt. Make a well in center of dry ingredients; add well beaten eggs and buttermilk at the same time. Mix until blended. Form into small cakes, about 1 tablespoon each. Drop hush puppies into deep fryer, a few at a time.",
    "nutrition": {
      "Calories": 1303.4200000000003,
      "Total fat": 30.65,
      "Saturated fat": 5.859999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 200.69,
      "Sodium": 3185.51,
      "Total carbs": 224.47000000000003,
      "Fiber": 19.64,
      "Sugar": 24.810000000000002,
      "Protein": 40.62
    }
  },
  {
    "keyword": "Pie",
    "title": "Emeril's Banana Cream Pie",
    "ingredients": "5 lg Egg yolks, 3/4 c Cornstarch, 3 c Heavy cream 3-3 1/2, 1 1/2 c Sugar, 1 Vanilla beans split & scraped, 3 c Graham cracker crumbs, 1/2 Ripe banana mashed, 1/4 lb Unsalted butter melted, 3 lb Bananas cut crosswise into 1/2\" slices, 3/4 c Caramel sauce, 1 c Chocolate sauce, 2 c Heavy cream whipped to stiff peaks with, 1/2 ts Vanilla extract and, 2 ts Granulated sugar, Shaved chocolate, Powdered sugar",
    "servings": "10 Servings",
    "instructions": "In a mixing bowl, combine the egg yolks, cornstarch and 1 cup of the heavy cream. Whisk to blend well. Set aside. Combine the remaining 2 cups cream, 1 1/2 cups of the sugar, and the vanilla bean in a large heavy-bottom saucepan over medium heat. Whisk to dissolve the sugar and bring to a gentle boil, about 10 minutes. Slowly add the egg yolk mixture, whisking constantly until it thickens, about 5 minutes. Be forewarned: the mixture will break. Don't be alarmed. Pour it into a glass bowl. Press a piece of plastic wrap down over the surface of the mixture to prevent a skin from forming. Let cool completely at room temperature. When cooled, remove the vanilla bean and pour the mixture into the bowl of an electric mixer fitted with a wire whip. Beat at medium-speed to combine the mixture. If it will not combine, warm another 1/2 cup heavy cream and slowly add it to the mixture. Whip until you have a thick and creamy custard. Preheat the oven to 350°F. In a mixing bowl, combine the graham cracker crumbs, the remaining sugar and the mashed banana. Mix thoroughly. Add the butter and mix well. Press the mixture into a 9\" pie pan. Bake until browned, about 25 minutes. Remove the pan from the oven and cool, for about 10 minutes. To assemble, spread about 1/2 cup of the custard on the bottom of the crust. Arrange about a third of the banana slices, crowding them close together, over the custard. Next, spread 1 cup of the custard over the bananas. Arrange another third of the banana slices close together over the custard. Top with 1 cup of the custard and the banana slices. Top with the remaining custard, covering the bananas completely to prevent them from turning brown. After this pie is assembled it will come about 2-3\" above the pie tin; it is a very high pie. Cover with plastic wrap and chill for at least 4 hours. Cut the pie into wedges and serve with a drizzle of caramel and chocolate sauce. Top with the whipped cream and saved chocolate. Sprinkle with powdered sugar. Yields: One 9\" pie, 8-10 servings.",
    "nutrition": {
      "Calories": 13671.439999999999,
      "Total fat": 584.4900000000001,
      "Saturated fat": 349.20000000000005,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 2516.32,
      "Sodium": 2313.88,
      "Total carbs": 2110.3499999999995,
      "Fiber": 55.15,
      "Sugar": 1675.3799999999997,
      "Protein": 90.77000000000001
    }
  },
  {
    "keyword": "Pie",
    "title": "Emeril's Chocolate Chip Pie",
    "ingredients": "8 tb Unsalted butter, 1 1/2 c Sugar, 3 lg Eggs, 2 c Flour, 2 ts Bourbon, 1 c Chopped walnuts, 8 oz Bittersweet chocolate chopped, 1 Unbaked pie crust - 9-inch, 3 c Bourbon Cream see * Note",
    "servings": "8 Servings",
    "instructions": "* Note: See the \"Bourbon Cream\" recipe which is included in this collection. Preheat the oven to 350 degrees. In a bowl cream together the butter, sugar and eggs. Stir in the flour and bourbon, and fold in the walnuts and chocolate. Pour into the pie shell. Bake until golden brown, for about 1 hour. Remove from the oven and allow to cool. Serve each piece of the pie with the Bourbon Cream.",
    "nutrition": {
      "Calories": 9650.529999999999,
      "Total fat": 500.09000000000003,
      "Saturated fat": 185.2,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 806.67,
      "Sodium": 3601.54,
      "Total carbs": 1181.59,
      "Fiber": 66.77,
      "Sugar": 574.5,
      "Protein": 133.82
    }
  },
  {
    "keyword": "Pie",
    "title": "Emeril's Shrimp Pie",
    "ingredients": "4 tb Butter, 1 c Chopped onions, 1/2 c Chopped bell peppers, Salt to taste, Cayenne to taste, 1/4 c Tomatoes chopped seeded and peeled or 1/2 cup chopped canned tomatoes, 1 lb Medium shrimp peeled and de-veined, 2 tb Chopped parsley, 2 tb Flour, 1 c Water, 1/2 c Recipe basic savory pie crust see recipe, 1/4 c Parmigrano grated cheese",
    "servings": "1 Servings",
    "instructions": "1. Preheat the oven to 400 degrees Fahrenheit. 2. Melt the butter in a large skillet over medium-high heat. Add the onions, bell peppers, celery, salt, cayenne, and black pepper. Saut\u0082 for about 8 minutes, or until golden and wilted. Add the tomatoes and cook for about 6 minutes, stirring occasionally. Add the shrimp and parsley. Cook, stirring occasionally. Add the shrimp and parsley. Cook, stirring occasionally for about 4 minutes. Dissolve the flour in the water and add to the pan. Stir for about 2 minutes, or until the mixture thickens. Remove from the heat. Let cool for at least 30 minutes. 3. Place the crust in the bottom of a 9-inch pie pan and crimp the edges. Pour the shrimp mixture into the pie crust. Sprinkle cheese on top. Place the pie on a baking sheet and bake for about 45 minutes, or until the edges of the pie crust are golden. Cool for several minutes. 4. Cut into wedges to serve. Notes: Good Morning America's Food Correspondent Emeril Lagasse serves up some shrimp pie at this year's New Orleans Jazz Fest.",
    "nutrition": {
      "Calories": 2148.67,
      "Total fat": 110.71,
      "Saturated fat": 52.489999999999995,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1107.1200000000001,
      "Sodium": 6316.720000000001,
      "Total carbs": 165.01,
      "Fiber": 28.689999999999998,
      "Sugar": 23.699999999999996,
      "Protein": 129.73
    }
  },
  {
    "keyword": "Pie",
    "title": "Empanadas (Brazilian Meat Pies)",
    "ingredients": "4 c Flour, 1 tb Butter, 1 c Shortening, 2 Whole eggs, 1 Egg yolk, 2 ts Salt, 1 1/2 c Cold water, For the filling:, 1 tb Oil, 1 sm Onion, finely chopped (about 1/4 cup), 1 Clove garlic, minced, 3 Chicken legs, 1 Bay leaf, 2 tb Tomato paste, Salt & pepper, Water, as needed, 3 tb Flour, 1/4 c Cooked peas, 8 Pitted green olives, chopped, Cayenne pepper, 1 Egg beaten with a pinch of salt for glaze",
    "servings": "50 Servings",
    "instructions": "Servings: Makes 50 1/2-inch empanadas Notes: Empanadas are Brazil's national appetizer, tiny pies filled with chicken olives, and peas. Belita's are famous all over Brazil. Empanadas are traditionally made in special molds that are almost as deep as they are wide. If they are unavailable, any small tartlet molds will do. \"The secret to making good dough,\" says Belita, \"is to massage it, not knead it.\" It may look as if she's making mud pies, but the results are truly superb. For the dough: To prepare the dough: Place the flour in a large mixing bowl and make a well in the center. Place the butter, shortening, eggs, salt, and 1 cup water in the well. Using one hand to mix, squeeze these ingredients through your fingers to make a paste. Gradually work in the flour, squeezing the dough between your fingers to mix it. Add water as necessary; the dough should be quite soft. Let the dough rest for 30 minutes while you prepare the filling. Heat the oil in a large saucepan. Saute the onion and garlic over medium heat for 2 to 3 minutes or until soft but not brown. Add the chicken, bay leaf, tomato paste, salt, and pepper, plus water just to cover. Bring to a boil, reduce heat, and simmer for 20 minutes, or until the chicken is cooked. Skim off the fat that rises to the surface. Remove the chicken, then strain and reserve the broth. When the chicken is cool enough to handle, discard the skin and remove the meat from the bone. Finely shred the meat with your fingers or in a food processor. Stir in the flour, peas, and olives. Stir in 3 to 4 Tbsp broth; the filling should be moist but not runny. Add enough cayenne to give the chicken a little bite. Pinch off cherry-sized pieces of dough and use them to line the tartlet molds. Belita pushes the dough in with her thumb. The dough should just reach over the top of the mold. Place a spoonful of filling in each crust. Roll out the remaining dough and cut out tops for the empanadas. Try to capture an air bubble when you place the top over the filling; according to Belita, this is what makes the pies light. Seal the tartlets by pinching together the top and bottom crust. Note: The empanadas can be prepared ahead to this stage and frozen. Preheat the oven to 350-F. Brush the tops with egg glaze. Bake for 30 minutes or until golden brown. Unmold and serve.",
    "nutrition": {
      "Calories": 6075.19,
      "Total fat": 328.59,
      "Saturated fat": 117.60000000000001,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1871.47,
      "Sodium": 3070.55,
      "Total carbs": 483.1,
      "Fiber": 27.62,
      "Sugar": 47.52,
      "Protein": 275.97
    }
  },
  {
    "keyword": "Cake",
    "title": "Elegant Southern Seafood Cake",
    "ingredients": "1 pk Cornbread mix, prepared, 1 Red onion, small, 1 Red bell pepper, small, 1 Green bell pepper, small, 2 Garlic cloves, 2 tb Olive oil, 1 lb Lump crabmeat, 1/2 lb Shrimp, 1/2 lb Flounder fillets, 1/4 lb Scallops, 1/2 c Mayonnaise, 2 tb Lime juice, 1/8 ts Cayenne, Salt to taste, White pepper to taste, 6 tb Clarified butter",
    "servings": "8 Servings",
    "instructions": "ell in advance, prepare cornbread according to package directions. ool and process in food processor or blender to make fine crumbs. et aside. Finely chop Onion. Remove seeds and veins from Peppers and hop into approximately 1/2 inch pieces. Peel, chop, and finely crush arlic. aute Onion in 10 inch frying pan in hot olive Oil until soft, about 4 inutes. Add Peppers and Garlic and continue cooking until Peppers re almost tender. Meanwhile, peel shrimp. Coarsely chop shrimp, callops and flounder. Remove Onion/Pepper mixture from heat and add eafood, mayonnaise and lime juice. Stir gently to prevent breaking p crab. Season to taste with Salt, Pepper and cayenne. Shape into atties and coat both sides with cornbread crumbs. (May now be placed n a plate and refrigerated for up to an hour) When ready to serve, eat 2 tablespoons of the clarified Butter in the frying pan over a oderately high flame. Saute 3 cakes at a time until golden on both ides, about 2 minutes. Add more Butter as necessary. May be served ith Creamy Corn Sauce. Spoon warm corn Sauce on plate and place eafood cake on top.",
    "nutrition": {
      "Calories": 2876.5,
      "Total fat": 203.71,
      "Saturated fat": 68.78999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1335.5700000000002,
      "Sodium": 7043.11,
      "Total carbs": 61.059999999999995,
      "Fiber": 6.84,
      "Sugar": 20.089999999999996,
      "Protein": 198.04
    }
  },
  {
    "keyword": "Cake",
    "title": "Elegant Tea Cakes",
    "ingredients": "1/2 c Butter, 1 c Granulated sugar, 1 Egg, 1 tb Cream, 1 ts Vanilla, 2 c Flour, 1/2 ts Baking powder",
    "servings": "1 Servings",
    "instructions": "Serve these not-too-sweet cookies in the traditional English fashion with your favorite cup of tea. They are delicious with a dab of jam or marmalade and hold up well when dunking. In a bowl, cream butter with sugar until very light. Add well beaten egg, cream and vanilla. In a separate bowl, sift flour with baking powder; add creamed mixture and blend well. Roll dough into a log and wrap in aluminum foil. Chill overnight, or in freezer for 2 hours if rushed for time. Preheat oven to 350ø. Remove dough from refrigerator, slice very thin and place on greased cookie sheet. Bake 5-8 minutes at 350ø. Variations: For various holidays decorate with colored sugar, beads or icing. Or substitute almond or lemon extract for the vanilla to vary the flavor. Yield: 10 dozen. Suzanne J. Brown, owner SBJ Communications, Skillman, NJ Randy Shearer",
    "nutrition": {
      "Calories": 2636.7899999999995,
      "Total fat": 104.69,
      "Saturated fat": 63.72,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 446.99,
      "Sodium": 1056.35,
      "Total carbs": 393.54999999999995,
      "Fiber": 6.75,
      "Sugar": 202.31,
      "Protein": 33.5
    }
  },
  {
    "keyword": "Cake",
    "title": "Elegant White Cake",
    "ingredients": "3 1/2 c Basic Cake Mix, 3/4 c Milk, 3 Egg whites, 1 ts Vanilla",
    "servings": "10 Servings",
    "instructions": "Preheat oven to 375F. Grease and flour two 8\" round pans. Combine Basic Cake Mix and milk in a large bowl. Beat at medium speed 2 minutes. Scrape bowl and beaters. Add egg whites and vanilla. Beat 2 more minutes. Pour into prepared pans. Bake 20 to 25 minutes, till a toothpick inserted in center comes out clean. Cool in pans 10 minutes, then cool on wire racks. Frost as desired.",
    "nutrition": {
      "Calories": 1732.4299999999998,
      "Total fat": 18.55,
      "Saturated fat": 9.129999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 14.64,
      "Sodium": 3321.0700000000006,
      "Total carbs": 355.53,
      "Fiber": 5.06,
      "Sugar": 193.07,
      "Protein": 32.43
    }
  },
  {
    "keyword": "Cake",
    "title": "Elise's Orange Chiffon Cake",
    "ingredients": "2 1/4 c Cake flour, 1 1/2 c Sugar, 3 ts Baking powder, 1 ts Salt, 1/2 c Vegetable oil, 5 Unbeaten egg yolks, Juice of 2 oranges -- plus, Water to make 3/4 cup, Grated rind of 2 oranges --, 2 Tablespoons, 1 c Egg whites -- 7 to 8 eggs, 1/2 ts Cream of tartar",
    "servings": "1 Servings",
    "instructions": "Mix first 4 ingredients (the dry ingredients) in a large bowl. Make a well in dry ingredients and add 1/2 cup vegetable oil then the 5 unbeaten egg yolks, then the orange juice and orange rind. Beat with a spoon until smooth. In another large mixing bowl, whip the 1 cup egg whites and 1/2 teaspoon cream of tartar until very stiff. Pour the egg yolk mixture gradually over whipped egg whites. Gently fold into egg whites; DO NOT STIR. Pour into ungreased 10 inch x 4 inch deep tube pan. Bake in preheated 325 degree oven for 65-70 minutes. Upon removing cake from oven, immediately turn pan upside down, placing tube part over the neck of a funnel or bottle if your pan does not have legs. Let hang free until cold. Loosen from sides with a spatula and turn out onto serving plate. Spread with Orange Butter Cooked Icing. Orange Butter Cooked Icing Melt 1/2 cup butter or shortening (should be at least 1/2 butter for flavor) in a large saucepan and blend in 4 Tablespoons cake flour and 1/4 teaspoon salt. Slowly stir in 1/2 cup orange juice. Bring to a boil and boil 1 minute. Mixture may appear curdled, but do not despair. Remove from heat and stir in 3 cups powdered sugar. Beat until of spreading consistency. (If this is taking a long time, set saucepan into a larger pan of cold water. Stir in 1 Tablespoon grated orange rind. Spread on cooled cake. Variation: Use frozen strawberries that you have pureed in a blender instead of orange juice and rind. (Great for Valentine's Day or Sweet Sixteen parties.) : Rosilyn",
    "nutrition": {
      "Calories": 4738.8,
      "Total fat": 173.47,
      "Saturated fat": 29.169999999999998,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 2410.25,
      "Sodium": 3632.890000000001,
      "Total carbs": 653.2399999999999,
      "Fiber": 17.12,
      "Sugar": 380.5300000000001,
      "Protein": 147.34
    }
  },
  {
    "keyword": "Cake",
    "title": "Ellen's Cheese Cake",
    "ingredients": "1 1/2 c Graham cracker crumbs, 2 tb Sugar, 1/2 Stick butter, melted, 1 lb Cream cheese, softened, 1 c Sugar, 5 Eggs, separated, 1 pt Sour cream, 1 ts Vanilla, 1/2 ts Lemon extract",
    "servings": "1 Servings",
    "instructions": "CRUST: Mix together crumbs, sugar, and butter. Press into a 9\" spring pan FILLING: Cream together cream cheese and sugar. Add 1 egg yolk at a time, then add sour cream and extracts. Beat egg whites stiffly and fold into mixture. Bake in a 325 degree pre-heated oven for 1 hour. Turn oven off and leave cake in the oven another hour. Open oven door and leave cake in oven a half hour longer. Remove from oven and cool.",
    "nutrition": {
      "Calories": 3857.1500000000005,
      "Total fat": 242.71,
      "Saturated fat": 131.98,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1516.69,
      "Sodium": 2779.8,
      "Total carbs": 360.78,
      "Fiber": 4.67,
      "Sugar": 278.82,
      "Protein": 69.26
    }
  },
  {
    "keyword": "Baked",
    "title": "Elegant Baked Fish",
    "ingredients": "8 Fish fillets, 1 1/2 c Hellmann's® Mayonnaise, 1 tb Creole mustard, 1 tb Lemon juice, 1 tb Tabasco, 1 tb Worcestershire sauce, 2 ts Garlic powder, 3/4 ts Curry powder, Ritz crackers",
    "servings": "8 Servings",
    "instructions": "Mix well and spread over fish fillets. Sprinkle with crumbled Ritz crackers and bake at 400°F for about 20 minutes uncovered. Fish is done when it flakes easily with a fork.",
    "nutrition": {
      "Calories": 3702.85,
      "Total fat": 260.49999999999994,
      "Saturated fat": 42.02,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1334.53,
      "Sodium": 4286.78,
      "Total carbs": 14.65,
      "Fiber": 2.2,
      "Sugar": 4.600000000000001,
      "Protein": 307.08
    }
  }
]