[
  {
    "keyword": "Chicken",
    "title": "Elegant Chicken in Sour Cream",
    "ingredients": "** Package Together **, 2 oz Freeze-Dried Chicken, Or, 4 oz Chicken-Flavored T.V.P., 4 Chicken Bouillon Cube, Or, 1/4 c Chicken Bouillon Granules, 8 oz Pasta, Enriched, 1 ts Dill Weed, ** Package Sepatately **, 1 Env Cream Of Onion Soup Mix, To make 2 1/2 cups, 8 oz Sour Cream Mix, 1/2 c Sliced Almonds, 2 oz Freeze-Dried Peas, 8 c Water",
    "servings": "4 Servings",
    "instructions": "1. Bring 7 cups of water to boiling, add pasta-chicken package, and simmer for 10 minutes, stirring occasionally. Add peas, at the end, for the amount of time recommended on their package. 2. Mix soup mix with 1/2 cup of water. Pour into pot while stirring, and simmer 5-10 minutes more, or until pasta and chicken are tender. 3. Reconstitute sour cream mix with cold water, stir into the pot. Serve sprinkled with almonds on top. Makes about 8 cups.",
    "nutrition": {
      "Calories": 1842.9,
      "Total fat": 105.73,
      "Saturated fat": 34.32,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 312.89,
      "Sodium": 9321.15,
      "Total carbs": 133.13,
      "Fiber": 19.240000000000002,
      "Sugar": 29.179999999999996,
      "Protein": 95.05000000000001
    }
  },
  {
    "keyword": "Chicken",
    "title": "Elegant Chicken Salad",
    "ingredients": "1/4 c Olive oil, 2 Chicken breasts, 3 c Chicken broth or water, 1/4 c Balsamic vinegar, 2 tb Orange juice, 1 tb Dijon mustard, 1/4 c Chives, 2 tb Tarragon chopped, Salt and pepper, 3 c Rice (wild or white)",
    "servings": "6 Servings",
    "instructions": "Poach chicken in broth or water for about 20 minutes. In salad bowl combine vinegar, juice, and mustard. Gradually whisk in oil. Stir in chives and tarragon and season with salt and pepper. Cut chicken into bite sized pieces. Add chicken and rice to dressing. Toss well.",
    "nutrition": {
      "Calories": 1637.6100000000001,
      "Total fat": 66.63000000000001,
      "Saturated fat": 10.519999999999996,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 218.94,
      "Sodium": 3684.0,
      "Total carbs": 155.82,
      "Fiber": 3.44,
      "Sugar": 15.950000000000001,
      "Protein": 95.01
    }
  },
  {
    "keyword": "Chicken",
    "title": "Elegant Rice and Chicken",
    "ingredients": "2 c Minute rice, 2 c Water, 1 Envelope dry onion soup mix, 6 Chicken breasts - boneless & skinless, Flour, Salt, Paprika, 1 cn Cream of mushroom soup, 1/2 lb Fresh mushrooms\\, 1 tb Butter",
    "servings": "1 Servings",
    "instructions": "Bring water to boil, stir in the dry onion soup mix & then add rice. Turn off heat & let stand. Meanwhile, shake chicken in enough flour, salt & paprika to coat. Fry until golden brown. Put cooked rice mixture in large casserole. Arrange cooked chicken breasts on top. Coverf with the mushroom soup. Top with the mushrooms that have been sauteed in the 1 tablespoon butter. Dust with paprika. Bake uncovered in 350 degree oven for 30 minutes until thoroughly heated.",
    "nutrition": {
      "Calories": 2593.5399999999995,
      "Total fat": 62.199999999999996,
      "Saturated fat": 22.08,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 667.72,
      "Sodium": 4083.0299999999997,
      "Total carbs": 226.82999999999998,
      "Fiber": 7.829999999999999,
      "Sugar": 18.87,
      "Protein": 260.63
    }
  },
  {
    "keyword": "Chicken",
    "title": "Emeril's Cheesy Chicken Shortcake",
    "ingredients": "2 tb Butter, 1 lb Chicken breast skinless, boneless and small diced, ESSENCE, 1 c Minced onions, 1 lb Smoked sausage cut into 1/4-inch slices, Salt, Freshly ground black pepper, 1 tb Chopped garlic, 2 c Heavy cream, 1 ds Worcestershire Sauce, 1 ds Crystal Hot Sauce, 1/4 c Chopped green onions, 8 Cheesy Biscuits see recipe, 1/2 c Grated Parmesan Reggiano cheese",
    "servings": "8 Servings",
    "instructions": "In a large saut\u0082 pan, melt one tablespoon of the butter. Season the chicken with Essence. Add the chicken to the melted butter and quickly saut\u0082 for 2 minutes. Add the remaining butter and melt. Add the onions. Season with salt and pepper. Saut\u0082 the onions for 2 minutes. Add the sausage and continue to saut\u0082 for 2 minutes. Add the garlic and cream. Season the mixture with salt, pepper, Worcestershire Sauce and hot sauce. Bring the liquid to a boil and reduce to a simmer. Simmer the mixture for 4 to 6 minutes, stirring occasionally. Add the green onions. To serve, slice the biscuits in half and spoon the chicken mixture over the top. Garnish with parsley and cheese. NOTES : Air date 3/6/98",
    "nutrition": {
      "Calories": 5879.74,
      "Total fat": 460.37999999999994,
      "Saturated fat": 235.10999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1540.0800000000002,
      "Sodium": 9107.25,
      "Total carbs": 166.41,
      "Fiber": 8.190000000000001,
      "Sugar": 50.92,
      "Protein": 267.90999999999997
    }
  },
  {
    "keyword": "Chicken",
    "title": "Emerilized Chicken Cordon Bleu",
    "ingredients": "2 6-ounce chicken breasts cut in half and pounded into thin scallops, 8 Thin slices of prosciutto, 8 Thin slices of Desoto Cheese (2 inches by 2 inches by 1/4 inch), 1 c Flour, 2 Eggs slightly beaten with 2 tablespoons milk, 1 c Herbed bread crumbs, Oil for sauteeing, Salt and pepper, 1 c Smoked tomato butter sauce hot, recipe follows, 2 c Mashed potatoes hot, 2 tb Chiffonade of basil, 2 tb Grated St. John's Cheese, Essence",
    "servings": "1 Servings",
    "instructions": "For the chicken: Season each side of the chicken scallops with salt and pepper. Lay on scallop flat and layer 2 pieces of the prosciutto, 2 pieces of the Desoto cheese and top with a meat scallop. Carefully dredge the chicken in flour. Dip the chicken in the egg mixture, letting any excess drip off. Finally dredge the chicken in the herb crumbs, coating each side completely. In a saute pan, heat the olive oil. When the pan is smoking hot, add the chicken. Saute for 2 to 3 minutes on each side or until golden brown. Remove from the pan and drain on a paper-lined plate. Season with Essence. Spoon the smoked tomato butter sauce in the center and around the edges of the plate. Mound the potatoes in the center of the sauce. Lay the chicken across the potatoes. Garnish with the basil, grated cheese and Essence. Yield: 2 servings",
    "nutrition": {
      "Calories": 1834.33,
      "Total fat": 76.74999999999999,
      "Saturated fat": 24.25,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 572.12,
      "Sodium": 3518.14,
      "Total carbs": 126.65,
      "Fiber": 10.68,
      "Sugar": 13.83,
      "Protein": 149.85999999999999
    }
  },
  {
    "keyword": "Chicken",
    "title": "Enchilada Sauce/chicken Enchiladas",
    "ingredients": "1 tb Flour, 1 1/2 tb Olive oil, 1/2 ts Thyme, 1/2 ts Oregano, 1/4 ts Cayenne, 1/2 ts Cumin, 1 Clove garlic minced, 1 cn Chicken broth 14 oz, 1 cn Tomatoe sauce 8 oz, 1 tb Lime juice fresh",
    "servings": "1 Servings",
    "instructions": "In large pan saute flour in oil for one minute, add spices and cook for an additional minute. Add broth, tomatoe sauce and lime juice and bring to a boil stirring constantly till thickened. Assemble tortillas with chicken and cooked onion, laying side by side in pan that has been coated with sauce. When pan is full, pour additional sauce over top, add grated cheddar cheese. Bake in oven til warmed through and cheese has melted. Serve on a bed of lettuce and serve with sour cream, salsa and jalapeno peppers to the side.",
    "nutrition": {
      "Calories": 340.67,
      "Total fat": 22.509999999999998,
      "Saturated fat": 3.059999999999999,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 4.98,
      "Sodium": 2959.19,
      "Total carbs": 33.25,
      "Fiber": 7.259999999999999,
      "Sugar": 16.73,
      "Protein": 8.1
    }
  },
  {
    "keyword": "Chicken",
    "title": "Enchiladas De Pollo (Chicken Enchiladas)",
    "ingredients": "1 cn (16-ounce) tomatoes, 1 cn (4-ounce) green chili peppers, rinsed and seeded, 1/2 ts Coriander seed, 1/2 ts Salt, 1 c Dairy sour cream, 2 c Finely chopped cooked chicken or turkey, 1 pk (3-ounce) cream cheese, softened, 1/4 c Finely chopped onion, 3/4 ts Salt, 2 tb Cooking oil, 12 6-inch tortillas, 1 c Shredded omterey jack cheese (4 ounces)",
    "servings": "1 Servings",
    "instructions": "Place undrained tomatoes, chili peppers, coriander seed, and the 1/2 teaspoon salt in blender container. Cover; blend till mixture is smooth. Add sour cream; cover and blend just till combined. Set aside. Combine chicken or turkey, cream cheese, onion, and 3/4 teaspoon salt. In skillet heat cooking oil. Dip tortillas, one at a time, into hot oil for 10 seconds or just till limp. Drain on paper toweling. Spoon chicken mixture on tortillas; roll up. Place seam side down in 12x7 1/2 x2-inch baking dish. Pour tomato mixture atop. cover with foil; bake in 350 degree oven about 30 minutes or till heated through. Remove foil; sprinkle with shredded cheese. Return to oven till cheese melts. Makes 6 servings.",
    "nutrition": {
      "Calories": 3315.35,
      "Total fat": 135.88000000000002,
      "Saturated fat": 36.85,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 441.5,
      "Sodium": 4142.18,
      "Total carbs": 355.47,
      "Fiber": 24.32,
      "Sugar": 15.230000000000002,
      "Protein": 161.67000000000002
    }
  },
  {
    "keyword": "Chicken",
    "title": "Enchiladas De Pollo Y Queso (Chicken Enchilada Casserole)",
    "ingredients": "1 c Chopped onion, 1/2 c Chopped green bell pepper, 2 tb Butter or margarine, 2 c Chopped cooked chicken or turkey, 1 cn (4-ounce) green chili peppers, rinsed, seeded, and chopped, 3 tb Butter or margarine, 1/4 c All-purpose flour, 1 ts Ground coriander seed, 3/4 ts Salt, 2 1/2 c Chicken broth, 1 c Dairy sour cream, 1 1/2 c Shredded monterey jack cheese (6 ounces), 12 6-inch tortillas",
    "servings": "1 Servings",
    "instructions": "from Better Homes & Garden Mexican Cooking In large saucepan cook onion and green pepper in the 2 tablespoons butter or margarine till tender. Combine in a bowl with chopped chicken and green chili peppers; set aside. In same saucepan melt the 3 tablespoons butter or margarine. Blend in flour, coriander, and salt. Stir in chicken broth all at once; cook and stir till thickened and bubbly. Remove from heat; stir in sour cream and 1/2 cup of cheese. Stir 1/2 cup of the sauce into the shicken. Dip each tortilla into remaining hot sauce to soften; fill each with about 1/4 cup of the chicken mixture. Roll up. Arrange rolls in a 13x9x2-inch baking dish; pour remaining sauce over. Sprinkle with remaining cheese. Bake, uncovered, in 350 degree oven about 25 minutes or till bubbly. serves 6.",
    "nutrition": {
      "Calories": 4224.28,
      "Total fat": 199.46999999999997,
      "Saturated fat": 92.84,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 700.3800000000001,
      "Sodium": 7361.709999999999,
      "Total carbs": 399.39,
      "Fiber": 27.419999999999998,
      "Sugar": 25.16,
      "Protein": 204.91000000000003
    }
  },
  {
    "keyword": "Chicken",
    "title": "Fresh Vegetable and Chicken Stew",
    "ingredients": "1 (4-5 pound) chicken (up to), 3 tb Shortening, 2 c Hot water, 1 tb Salt, 3/4 ts Black pepper, 12 sm White onions, 1 c Sliced carrots, 1 c Fresh peas lima beans, or snapbeans, 1 c Diced potatoes, 1/3 c All-purpose flour, 1/2 c Water",
    "servings": "6 Servings",
    "instructions": "Cut chicken into serving-size pieces and brown on all sides in hot shortening. Place in Dutch oven or saucepan with water, salt, and pepper. Cover and cook for 1 hour, or until chicken is tender. Add vegetables about 30 minutes before cooking time is up. Combine flour with the 1/2 cup water and stir into stew. Cook until medium thickness. Yield: 6 servings.",
    "nutrition": {
      "Calories": 2491.01,
      "Total fat": 98.13,
      "Saturated fat": 31.81,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 421.01,
      "Sodium": 6820.530000000001,
      "Total carbs": 259.44,
      "Fiber": 47.62,
      "Sugar": 75.74,
      "Protein": 150.18
    }
  },
  {
    "keyword": "Chicken",
    "title": "Fri-Dinner: Stirfry Noodles with Chicken,peanut-Orange Sau",
    "ingredients": "3/4 lb Spaghettini -- or, Egg noodles, 1 tb Vegetable oil -- approx, 1 lb Chicken breasts -- thin, Strips, Skinless, 2 Garlic cloves -- finely, Chop, 1 tb Gingerroot -- chopped, 1/4 ts Hot pepper flakes, 6 Green onions -- chopped, 2 Onions -- slivered, 2 Sweet green peppers -- cut, In strips, 1 Sweet red pepper -- in, Strips, 1/4 c Fresh coriander -- chopped, Parsley, PEANUT SAUCE-----, 1/2 c Warm water, 1/2 c Peanut butter, 2 tb Soy sauce, 2 tb Rice vinegar, 1 tb Frozen orange concentrate --, Thawed, 1 tb Sesame oil",
    "servings": "4 Servings",
    "instructions": "Both the pasta and sauce can be made ahead, then you can just stirfry the whole dish together at the last moment. If you dont have a large wok, a large nonstick pan works well. Garnish platter with green beans and decorative kale. In saucepan of boiling salted water, cook spaghettini for 8-10 minutes or until tender but firm; drain and rinse with cold water. Drain again. [Pasta can be tossed with 1 tb vegetable oil, covered and refrigerated for up to 12 hours.] Peanut Sauce: Meanwhile, in bowl, whisk together water, peanut butter, soy sauce, vinegar, orange juice concentrate and sesame oil. [Sauce can be covered and refrigerated for up to 12 hours.] Meanwhile, brush wok or large nonstick skillet with 1 tb oil; heat over medium-high heat until smoking. Stir-fry chicken until lightly browned. Add garlic, ginger, hot pepper flakes and onions; stir-fry for 3 minutes or until fragrant. Add slivered onions and sweet peppers; stir-fry for 5 minutes. Add peanut sauce and bring to boil; reduce heat and simmer for 5 minutes, adding a little water if sauce thickenes too much. Addf spaghettini; cook, until steaming hot. sprinkle with coriander. Per Serving: about 505 calories, 32 g protein, 17 g fat, 57 g carbohydrate Dinner Menu: : ",
    "nutrition": {
      "Calories": 2515.9500000000003,
      "Total fat": 118.52000000000001,
      "Saturated fat": 21.94,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 484.21000000000004,
      "Sodium": 2995.7099999999996,
      "Total carbs": 176.61,
      "Fiber": 22.080000000000005,
      "Sugar": 38.71000000000001,
      "Protein": 196.49
    }
  },
  {
    "keyword": "Beef",
    "title": "Ellen's Beef Stew",
    "ingredients": "1 3/4 lb Chuck or round, cubed, 1/3 c Flour, 1/4 ts Pepper, 1/2 ts Salt, 3 tb Oil, 1/2 Onion chopped, 1 cl Garlic minced, 2 3/4 c Boiling water, 28 oz Tomatoes canned, 1/2 ts Salt, 1/2 ts Worcestershire, 1 pn Basil, 1 pn Dill, 1 pn Thyme, 4 md Potatoes quartered, 2 Onions quartered, 1 lb Carrots 2 inch pieces, 1 c Peas",
    "servings": "1 Servings",
    "instructions": "Combine flour, pepper, and salt in bag. Add meat and shake til coated. Heat oil in Dutch oven. Brown meat on all sides. Add onion, garlic, water, tomatoes, salt, and worcestershire. Cover, reduce heat to low and simmer 2 hours, until meat begins to get tender. Add potatoes, onions, and carrots. Cook 30-45 mins, until vegetables are done. Add peas. Cook until heated. By Ellen Cleary",
    "nutrition": {
      "Calories": 3415.2599999999998,
      "Total fat": 101.75000000000001,
      "Saturated fat": 25.93,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 785.86,
      "Sodium": 2503.71,
      "Total carbs": 338.47,
      "Fiber": 60.22,
      "Sugar": 66.97,
      "Protein": 309.05999999999995
    }
  },
  {
    "keyword": "Beef",
    "title": "English Beef Pot Pie",
    "ingredients": "2 lb Beef round steak*, 3 tb Flour, 1 ts Salt, 1/4 ts Pepper, 2 Carrots pared & sliced, 3 Poetatoes peeled & sliced, 1 Onion large thinly sliced, 1 cn Whole tomatoes (16.oz), 1 *****BISCUIT TOPPING******",
    "servings": "4 Servings",
    "instructions": "* cut into 1-inch cubes PLace steak cubes in crock-pot. Combine flour, salt and pepper, toss with steak to coat thoroughly. Stir in remaining ingredients except Biscuit Topping and mix thoroughly. Cover and cook on LOW setting for 7 to 10 hours. One hour before serving, remove meat and vegetables from crock-pot and pour into shallow 2-1/2-quart baking dish. Preheat oven to 425 degrees. Cover meat mixture with Biscuit Topping. Bake for 20 to 25 minutes. 4 servings (about 2-1/2 quarts BISCUIT TOPPING: 2 cups flour, 1 teaspoon salt, 3 teaspoons baking powder, 1/4 cup shortening, 1/4 cup milk. Mix dry ingredients. Cut in shortening until mixture resembles coarse cornmeal. Add milk all at one time; stir well. Pat out on floured board; roll out to cover baking dish.",
    "nutrition": {
      "Calories": 2927.8800000000006,
      "Total fat": 168.89000000000001,
      "Saturated fat": 67.18000000000002,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 867.55,
      "Sodium": 1483.6799999999996,
      "Total carbs": 69.2,
      "Fiber": 7.940000000000001,
      "Sugar": 13.78,
      "Protein": 273.2
    }
  },
  {
    "keyword": "Beef",
    "title": "Fried Beef with Watercress Salad(Bo Luc Lac)",
    "ingredients": "1 lb Beef fillet(500g), 5 Cloves garlic crushed, 1/2 ts Black pepper, 1 1/2 ts Granulated sugar, 3 tb Oil, 1 Large onion, 2 tb Vinegar, 2 tb Salad oil, 1 Watercress (as required)",
    "servings": "4 Servings",
    "instructions": "Cut meat into 3/4\" cubes. Mixwith 2 cloves garlic, 1/2 tsp pepper,1/2 tsp sugar and 1 tbsp oil. Let meat stand in marinade for 1 hour. Cut onion lengthwise into very thin strips. Marinate onion in vinegar, 1/4 tsp salt, 1 tsp sugar, 1/4 tsp pepper and 2 tbsp oil. Rinse watercress, drain well and arrange on a platter. Heat 2 tbsp oil over high heat. Add a pinch of sugar and the remaining garlic. Fry until fragrant. Add meat and stir fry for 2 minutes, until just cooked. Top watercress with meat, then onion mixture.",
    "nutrition": {
      "Calories": 1891.6799999999998,
      "Total fat": 144.64000000000001,
      "Saturated fat": 37.3,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 394.63,
      "Sodium": 248.54,
      "Total carbs": 23.340000000000003,
      "Fiber": 2.57,
      "Sugar": 10.48,
      "Protein": 122.02000000000001
    }
  },
  {
    "keyword": "Beef",
    "title": "Fried Crispy Shredded Beef",
    "ingredients": "4 Eggs, 1/2 ts Salt, 100 g (4 oz) cornflour, 450 g (1 lb) topside of beef, cut into very thin strips, 600 ml Vegetable oil, 3 md Carrots, scraped and cut into julienne strips, 2 Spring onions, cut into 2.5 cm sections, 2 Chillies, shredded, 3 Garlic cloves, crushed, 6 ts Sugar, 2 tb Soy sauce, 4 tb Wine vinegar",
    "servings": "1 Servings",
    "instructions": "1. Mix together the eggs, salt and cornflour and toss the beef in this until well coated. Heat the oil in a wok to 180 degree C or 350 degree F, or until a cube of bread browns in 30 seconds, and stir-fry the beef for 1 1/2 minutes or until crispy. remove and drain on paper towels. 2. Reheat the oil and deep-fry the carrots for 1 1/2 minutes. Remove and drain on paper towels. 3. Pour off most of the oil, leaving about 1 1/2 tablespoons in the bottom of the wok. Reheat, then add the spring onions, chillis and garlic. Stir-fry together for about 30 seconds over the heat then add the sugar , soy sauce and vinegar. Return the meat and carrots to the sauce. toss over the heat and serve. TNT: Imran C.",
    "nutrition": {
      "Calories": 6593.970000000001,
      "Total fat": 645.2199999999998,
      "Saturated fat": 77.79,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1135.5,
      "Sodium": 2644.7200000000003,
      "Total carbs": 54.77,
      "Fiber": 6.72,
      "Sugar": 36.17,
      "Protein": 149.23000000000002
    }
  },
  {
    "keyword": "Beef",
    "title": "Good-For-You Beef Stew (4 Points)",
    "ingredients": "1/4 c All-purpose flour, 1 ts Dried thyme, 1/2 ts Salt, 1/2 ts Pepper, 1 lb Round steak (top)all visible fat removed, cut into 1\" cubes, 1 c Pearl onions fresh or frozen, 1/3 c Red wine, 2 Cloves garlic minced, 1 lb All-purpose potatoes about 2, cut into 3/4\" cubes, about 2 cups, 2 c Fat-free beef broth low sodium, 1 1/2 c Baby carrots frozen (10 Oz.), 2 Bay leaves, 1 c Peas frozen, 1 cn Sliced mushrooms drained",
    "servings": "6 servings",
    "instructions": "Combine flour, thyme, salt and pepper. Add meat; toss to coast. Coat large pot with cooking-spray; place over medium-high heat. Add meat; cook, turning occasionally, with any remaining flour mixture until meat is browned on all sides, about 6-8 minutes. Remove meat from pot; keep warm. To same pot add onions, wine and garlic, scraping up any browned bits; cook 3 minutes. Stir in potatoes, broth, carrots, bay leaves and reserved meat. Increase heat to high; bring to a boil. Reduce heat to medium; simmer, stirring occasionally, 20 minutes. Stir in peas and mushrooms; heat through, about 5 minutes. Remove bay leaves before serving. Serves 6. Per Serving: (Magazine Nutritional Info) 229 calories, 23g protein, 3g fat, 43 mg chol, 27g carbs, 510 mg sodium, 4g fiber. WW Points per serving 4",
    "nutrition": {
      "Calories": 1839.8300000000002,
      "Total fat": 43.110000000000014,
      "Saturated fat": 16.07,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 408.23,
      "Sodium": 1406.2399999999998,
      "Total carbs": 184.26,
      "Fiber": 28.250000000000004,
      "Sugar": 33.03,
      "Protein": 170.55000000000004
    }
  },
  {
    "keyword": "Beef",
    "title": "Griddled Fillet of Beef with Honey Roasted Beetroot",
    "ingredients": "1 kg Angus beef fillet trimmed of loose chain, skin and cartilage, but saved for stock (2 1/4lb), 8 Sprigs thyme, 1 tb Olive oil, Freshly ground salt and black pepper, 1 Glass red wine, 330 ml Beef stock (1/2 pint), 30 g Unsalted chilled butter (1oz), 8 sm Cooked beetroot cut into quarters, 4 sm Carrots peeled and cut into the same size as the beetroot and then blanched, 15 g Butter (1/2oz), A splash of olive oil, 1 tb Runny honey, Seasoning",
    "servings": "1 servings",
    "instructions": "Pre heat the oven to 220øC/425øF/gas mark 7. Salt beef trimmings, pour into a roasting tin and roast until brown. Then put the beef tin on the hob and pour a glass of red wine into it. De-glaze by scraping up the sediment in the tin into the wine. Add the beef stock and bring to the boil. Reduce to a simmer. Add a sprig of thyme, This is now your sauce - the flavour will develop as it simmers down. Make incisions in the fillet with the tip of a knife and insert tiny sprigs of thyme. Rub all over with the oil. Sear the fillet on a pre-heated griddle or cast pan until sealed and then roast in the hot oven for 12 minutes or so (longer if you like it medium to well) and then rest in a warm place for a further 10 minutes to relax the muscle and to settle the juices. Whilst beef is cooking, heat the butter and oil in a wide based pan, add the honey and then add the carrots and beetroot, shaking in the buttery honey to coat them. Season. Tip the whole lot into a baking dish and roast in the oven until golden brown and tender (about 10 minutes but it does depend on how big the pieces are) Serve the fillet cut into thick slices on a dollop of the mash with the beetroots and carrots round. Strain the sauce into a clean pan, pressing through all the meaty juices, and whisk in a little of the chilled butter to give it body and a bit of a gloss. Serve with the beef. 1/2 Fat; 0 Other Carbohydrates",
    "nutrition": {
      "Calories": 3765.2100000000005,
      "Total fat": 238.91,
      "Saturated fat": 95.35000000000001,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1073.95,
      "Sodium": 3158.1200000000003,
      "Total carbs": 82.68,
      "Fiber": 10.95,
      "Sugar": 60.09999999999999,
      "Protein": 286.06
    }
  },
  {
    "keyword": "Beef",
    "title": "Meat - Beef a la Will Moreland",
    "ingredients": "2 lb Filet or sirloin of beef, 2 tb Oil, 1 bn Spring onions chopped, 2 Cloves garlic chopped, 1 Pieces ginger root the size of your thumb chopped, 1 tb Soy sauce, 1 bn Fresh coriander chopped, 2 Fresh chilies chopped, 1 Piece lemon grass roughly chopped, 2 cn Coconut milk, 1 Lime Juice of",
    "servings": "1 servings",
    "instructions": "Heat a heavy frying pan and sear your piece of meat, remove. Heat the oil in the same pan and saute the spring onions, garlic and ginger until softened. Add the soy sauce, half of the coriander, and the chilies. Place the sealed meat in a roasting tin. Pour over the fried vegetable mixture. Add the lemongrass and pour the coconut milk and lime juice over the meat. Cook in a preheated oven at 350 degrees for 40 minutes. Place beef on a serving dish. Strain the sauce, add the rest of the chopped coriander and pour over the meat. Serve immediately.",
    "nutrition": {
      "Calories": 4132.88,
      "Total fat": 306.72,
      "Saturated fat": 159.15,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 1032.1200000000001,
      "Sodium": 1532.6599999999999,
      "Total carbs": 48.02,
      "Fiber": 2.5300000000000002,
      "Sugar": 6.03,
      "Protein": 299.74
    }
  },
  {
    "keyword": "Beef",
    "title": "Meat Free Beef Strogonoff",
    "ingredients": "300 ml Dry white wine ( 1/2 pint), 3 tb Corn oil, 25 g Butter (1oz), 1 300 gram pac Tivall beef strips, 6 Shallots peeled and halved, 1 150 gram pac button mushrooms wiped, 150 ml Vegetable stock ( 1/4 pint), 1 tb Tomato puree, 1 ts French mustard, 2 tb Fresh parsley finely chopped, 142 ml Pot soured cream, Salt and freshly ground black pepper, 1 lg Tomato peeled, deseeded and roughly chopped, Parsley to garnish",
    "servings": "1 servings",
    "instructions": "Place the wine in a saucepan and simmer until reduced by half. In a large frying pan heat the oil and butter and cook the beef for 5 minutes. Remove and put to one side. Add the shallots and mushrooms to the pan and saute for 10 minutes, or until softened. Return the beef to the pan and pour in the reduced wine and stock. Cook for a further 5 minutes. Remove from the heat and stir in the tomato puree, French mustard, parsley, cream and seasoning. Return back to the heat, then add the tomatoes and heat through thoroughly Transfer to a warmed serving dish and garnish with parsley. NOTES : A way of making a beef strogonoff using a meat free alternative.Ideal served with boiled rice or crusty bread.",
    "nutrition": {
      "Calories": 2136.6899999999996,
      "Total fat": 143.7,
      "Saturated fat": 69.06,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 476.64,
      "Sodium": 1184.88,
      "Total carbs": 70.25,
      "Fiber": 13.67,
      "Sugar": 35.01,
      "Protein": 94.47
    }
  },
  {
    "keyword": "Beef",
    "title": "Medallions of Beef W/iowa Blue Cheese Sauce",
    "ingredients": "2 4 oz medallions of beef tenderloin, 1 tb Butter, 1 tb Finely chopped onion, 1 oz Brandy (optional), 3 oz Beef gravy or brown sauce, 1 tb Blue cheese (softened) (Maytag blue cheese), Salt and pepper to taste, 1 tb Green onion sliced for garnishing, 2 tb Blue cheese for garnishing",
    "servings": "1 servings",
    "instructions": "Melt butter in saucepan. Saute beef medallions to desired doneness. Remove meat to a warm place. Add chopped onion to pan and flambe with brandy. Add brown sauce to pan and stir. Add blue cheese and whip til smooth. Season with salt and pepper. Pour sauce on plate, place meat over sauce. Garnish the top of each medallion with green onion and crumbled blue cheese.",
    "nutrition": {
      "Calories": 1106.27,
      "Total fat": 80.98000000000002,
      "Saturated fat": 37.300000000000004,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 253.46,
      "Sodium": 1706.8300000000002,
      "Total carbs": 9.069999999999999,
      "Fiber": 0.8300000000000002,
      "Sugar": 2.37,
      "Protein": 66.34
    }
  },
  {
    "keyword": "Beef",
    "title": "Mediterranean Ground Beef with Filo Crown",
    "ingredients": "2 tb Olive oil, 1 Onion chopped, 2 Cloves garlic crushed, 500 g Ground Tenderbeef*, 150 ml Red wine optional (or 100ml grape or apple juice), 200 ml Beef stock, 2 tb Tomato puree, 2 Zucchinis sliced, 1 Red and 1 yellow capsicum deseeded and sliced, 150 g Mushrooms quartered, 2 ts Greggs dried mint or 2 tbs of chopped fresh mint, 1 ts Greggs dried thyme or 2 tbs of chopped fresh thyme, 2 tb Flour, 1 200 gram pac filo pastry, Salt and ground black pepper, Seasonal vegetables or crisp salad to serve",
    "servings": "4 servings",
    "instructions": "NB: You can use ground lamb or ground pork for this recipe if you wish. Heat the olive oil in a saut\u0082 pan. Add the onion and ground Tenderbeef. Cook for 2-3 minutes until well browned. Add the garlic, stir in the wine, stock and tomato puree. Bring to a gentle simmer for 6-8 minutes, stirring occasionally. Add the peppers, mushrooms, zucchinis and herbs and cook for 15 minutes until the ground Tenderbeef is cooked. Sprinkle the flour over the meat. Stir in quickly to prevent lumps forming. Check the seasoning, then spoon into an ovenproof dish (or individual dishes). Brush the filo sheets with a little oil, then loosely scrunch up each sheet. Place onto the ground beef until it is covered. Bake at 180 C for 30 minutes until crisp and golden. Serve with seasonal vegetables or a crisp salad.",
    "nutrition": {
      "Calories": 1866.3700000000003,
      "Total fat": 84.92999999999999,
      "Saturated fat": 30.75,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 121.43,
      "Sodium": 2064.4199999999996,
      "Total carbs": 223.44,
      "Fiber": 29.800000000000004,
      "Sugar": 88.33000000000001,
      "Protein": 40.42999999999999
    }
  },
  {
    "keyword": "Pork",
    "title": "Empanadas of Pork, Prunes and Apples",
    "ingredients": "6 tb Extra virgin olive oil, 2 lb Boneless pork shoulder in 1/4\" cubes, 1 lg Spanish onion In 1/4\" Dice, 6 Cloves garlic thinly sliced, 2 Red Roma apples peeled and cored and cut into 1/4\" half moons, 8 Pitted prunes cut into quarters, 1/4 c Blanched almonds, 1 ts Cinnamon, 1 tb Fresh thyme leaves chopped, 2 c Dry red wine from Penedes, 1 Empanada dough (see basic recipe)",
    "servings": "4 Servings",
    "instructions": "Egg wash: 1 egg beaten with 1 tablespoon water To make filling: In a large 14inch saute pan, heat oil until smoking. Add pork pieces, onion and garlic and cook until pork is browned and onion has softened. Add apples, prunes, almonds, cinnamon and thyme leaves and continue to cook, about 20 minutes. Add red wine, bring to boil, lower heat and simmer 40 minutes. Check for seasoning and allow to cool. Preheat oven to 375 degrees F. Roll out empanada dough to 1/4inch thick and cut into 8inch circles. Place 4 tablespoons pork filling in each circle and then fold to form half moons. Crimp the closed edges with a fork. Brush with egg wash, puncture top with several holes and bake 25 to 30 minutes, until golden brown. Serve immediately.",
    "nutrition": {
      "Calories": 4752.340000000001,
      "Total fat": 319.77000000000004,
      "Saturated fat": 88.25999999999998,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 816.47,
      "Sodium": 1108.42,
      "Total carbs": 158.27,
      "Fiber": 25.59,
      "Sugar": 77.76,
      "Protein": 232.07999999999998
    }
  },
  {
    "keyword": "Pork",
    "title": "Empanaditas (Pork Turnovers)",
    "ingredients": "8 ts Chilled margarine, 3/4 c All-purpose flour, 3 tb Ice water, 2 oz Cooked ground pork, crumbled (OR finely chopped, Cooked ham), 2 oz Monterey Jack or Cheddar cheese, shredded, 1 ts Prepared spicy brown mustard, 1 ds Crushed red pepper, 1 Egg separated, 1 tb Skim milk",
    "servings": "8 Servings",
    "instructions": "Paprika Garnish: red bell pepper strips and cilantro leaves In small bowl, with pastry blender or 2 knives, cut margarine into flour until mixture resembles corn meal; sprinkle with ice water and, using fork, mix to form soft dough. Roll dough between 2 sheets of wax paper to form rectangle about 1/4 inch thick; remove paper and use 2-inch diameter plain or fluted cookie cutter to cut dough into rounds. Roll scraps of dough and continue cutting until all dough has been used (should yield 24 rounds). Combine pork (or ham), cheese, mustard, and red pepper in small bowl and set aside. Preheat oven to 375. Beat egg white lightly and brush an equal amount onto each pastry round. Spoon an equal amount of the meat mixture (about 1/2 rounded teaspoon) onto center of each round; fold pastry over, turnover-fashion, to enclose filling. Press edges of dough together to seal. Transfer turnovers to nonstick cookie sheet. Add milk to egg yolk and beat lightly; brush an equal amount of mixture over each turnover and sprinkle each with a dash of paprika. Bake until turnovers are golden brown, 15 to 20 minutes. Transfer to warmed serving tray; garnish with red pepper strips and cilantro. Chili sauce or salsa can be served as a dipping sauce. Makes 8 servings of 3 turnovers each.",
    "nutrition": {
      "Calories": 1735.2099999999998,
      "Total fat": 136.20999999999998,
      "Saturated fat": 39.55,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 318.01,
      "Sodium": 707.2099999999999,
      "Total carbs": 76.04,
      "Fiber": 3.2299999999999995,
      "Sugar": 1.8800000000000001,
      "Protein": 51.970000000000006
    }
  },
  {
    "keyword": "Pork",
    "title": "Fresh Pork Pot Roast with Dumplings",
    "ingredients": "1/2 Fresh pork leg or shoulder about 5 lbs., 2 ts Salt, 1/2 ts Dried thyme, 1 lg Bay leaf crushed, Dumplings",
    "servings": "6 Servings",
    "instructions": "Trim excess fat from the meat. Rub meat with mixture of salt, thyme and bayleaf. Refrigerate 2 hours. Brown meat in the fat trimmings in heavy deep pan or Dutch oven. Add water to depth of 2\". Cover, and simmer on top of the range until well done (20 to 25 minutes per pound). Add more water if needed. Remove meat from pan; set aside, keeping it warm. Makes 6 to 8 servings. GRAVY: Skim fat from drippings. Measure 3/4 c. drippings into pan; stir in 1/2 cup flour; cook until bubbly. Stir in 4 c. water to make thin gravy; season with salt and pepper; simmer about 5 minutes. DUMPLINGS: sift together 1 1/2 c. sifted flour, 2 tsp. baking powder, 3/4 tsp. salt and 1/8 tsp. ground sage. Cut in 3 tblsp shortening. Combine 1 egg, slightly beaten, and 2/3 c. milk; stir in dry ingredients until all are moistened. Drop by spoonfuls into boiling gravy. Cover; cook 15 minutes without lifting the lid. Serve with sliced meat and gravy.",
    "nutrition": {
      "Calories": 260.49,
      "Total fat": 13.680000000000001,
      "Saturated fat": 4.85,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 64.58,
      "Sodium": 1474.56,
      "Total carbs": 13.07,
      "Fiber": 0.7,
      "Sugar": 0.53,
      "Protein": 20.179999999999996
    }
  },
  {
    "keyword": "Pork",
    "title": "Fresh Rosemary and Honey Mustard Pork Roast",
    "ingredients": "3/4 c Beer, 1/2 c Dijon mustard, 6 tb Honey, 1/4 c Olive oil, 2 tb Chopped garlic, 2 tb Chopped fresh rosemary, 1 Two-pound boneless pork loin roast, 1/2 c Whipping cream",
    "servings": "4 To 6",
    "instructions": "Whisk first 5 ingredients and 1 tbsp of the rosemary together in a large bowl. Add pork and coat well. Let it marinate for three hours, stirring occasionally. Transfer pork to a plate, and reserve marinade. Position pork in a roasting pan and rub the remaining tbsp rosemary on top. Position pan on an middle rack in the oven. Roast until thermometer inserted into center registers 150× F (about 55 minutes), and reserve juices. Let stand 15 minutes before slicing for a moister roast. In a saucepan, add the reserved juices, marinade and cream. Boil this sauce until it thickens and reduces to about 1-1/2 cups (about 10 minutes). Slice the pork and arrange on plates. Spoon some of the sauce over each portion and serve. You can serve with rice and fresh vegetables. Nutritional Analysis Per Slice (8 to a pie): Calories: 445 Protein: 23g Carbohydrate: 22g Fat: 27g Cholesterol: 103mg Sodium: 210mg",
    "nutrition": {
      "Calories": 3191.3199999999997,
      "Total fat": 181.54000000000002,
      "Saturated fat": 61.099999999999994,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 860.62,
      "Sodium": 3707.5399999999995,
      "Total carbs": 127.54,
      "Fiber": 6.13,
      "Sugar": 108.74000000000001,
      "Protein": 250.40999999999997
    }
  },
  {
    "keyword": "Pork",
    "title": "Fried Creamed Salt Pork",
    "ingredients": "1 lb Salt pork cut in 1/3-inch thick strips, 1/3 c Flour, 2 1/2 c Milk, Salt & freshly ground black pepper to taste",
    "servings": "4 Servings",
    "instructions": "SERVES 4 I am sure that no matter how much you like a dish it can become tiring after many repeats. It must have been that way on the trail. Salt pork was a common commodity, and when milk was available this dish would appear . . . probably again and again. I like it very much and suggest you try it. Bring 2 quarts of water to a boil and throw in the salt pork. Cook for about 5 minutes, then remove from the heat and drain. Using a large black frying pan, fry the salt pork until lightly browned. Remove it from the pan, reserving the fat. Measure about 1/4 cup of the fat and return to the pan. Stir in the flour and cook for just a moment. Add the milk to the pan, stirring all the time to avoid lumps until the mixture thickens. Return the salt pork to the pan. This is great poured over hot biscuits or served with any dried vegetable, such as beans or hominy.",
    "nutrition": {
      "Calories": 3848.74,
      "Total fat": 377.62999999999994,
      "Saturated fat": 141.0,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 438.89,
      "Sodium": 12757.43,
      "Total carbs": 60.940000000000005,
      "Fiber": 1.1800000000000002,
      "Sugar": 30.98,
      "Protein": 47.33
    }
  },
  {
    "keyword": "Pork",
    "title": "Fried Eggplant and Ground Pork",
    "ingredients": "225 g Ground pork, 2 c Eggplant cut 1/2 inch thick, 1 ts Minced garlic, 1 tb Chiles shredded, 1 ts Soybean condiment * see note, 1 tb Fish sauce, 1 tb Soy sauce, 1 ts Sugar, 1/2 ts Sweet soy sauce, 20 Basil leaves, 3 tb Vegetable stock, 2 tb Olive oil",
    "servings": "4 Servings",
    "instructions": "1. Blanch eggplant in boiling water for 30sec. Remove. 2. Heat oil and stir-fry garlic, chili and soy condiment until fragrent. 3. Add pork and stir-fry until colour changes. 4. Add eggplant, then sauces and suger. Stir to mix. 5. Finally, add basil and stock and bring to boil. Serve immediately. NOTES : This is a favorite dish in my family, where eggplant is eaten in some form almost every day. The eggplant in this dish tends to be a bit \"crunchy.\" If you wish to have a softer feel (as in Chinese dishes) then simmer for a little longer - 5min max! Also, for fire-lovers, you can double the chili content without upsetting the flavor of this dish. (Just make sure you serve it with lots of rice and iced water!)",
    "nutrition": {
      "Calories": 1081.79,
      "Total fat": 78.06,
      "Saturated fat": 21.760000000000005,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 213.43,
      "Sodium": 3043.95,
      "Total carbs": 32.379999999999995,
      "Fiber": 5.709999999999999,
      "Sugar": 18.2,
      "Protein": 63.199999999999996
    }
  },
  {
    "keyword": "Pork",
    "title": "Green Curry of Pork And Choko",
    "ingredients": "2 tb Oil, 500 g Diced pork, 1 lg Onion chopped, 2 Cloves garlic crushed, 2 ts Green curry paste, 2 Chokoes peeled, seeds removed, roughly chopped, 1 400 g. can coconut milk, 1 ts Caster sugar, 2 ts Fish sauce (2 to 3)",
    "servings": "1 servings",
    "instructions": "1. Using a wok or large saucepan, heat half the oil and quickly seal the pork in batches and set aside in a bowl for later. 2. Heat the remaining oil in the wok and saute the onion and garlic. Add the curry paste and stir through before adding the choko, coconut milk, sugar and fish sauce. Bring to the boil, then reduce to a simmer and cook until the choko is almost tender. 3. Add pork to wok and continue cooking until pork is cooked through and choko is tender. Taste and adjust salt content with fish sauce. Serve with steamed jasmine rice. Per serving: 867 Calories (kcal); 86g Total Fat; (84% calories from fat); 7g Protein; 27g Carbohydrate; 1mg Cholesterol; 41mg Sodium Food Exchanges: 0 Grain(Starch); 0 Lean Meat; 2 Vegetable; 1/2 Fruit; 17 1/2 Fat; 0 Other Carbohydrates",
    "nutrition": {
      "Calories": 2337.43,
      "Total fat": 183.25,
      "Saturated fat": 102.12,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 440.0,
      "Sodium": 4177.99,
      "Total carbs": 35.57000000000001,
      "Fiber": 2.5200000000000005,
      "Sugar": 10.72,
      "Protein": 144.41000000000003
    }
  },
  {
    "keyword": "Pork",
    "title": "Green Curry with Pork (Gaeng Keow Waan Muu)",
    "ingredients": "Peanut oil, 1/4 c Shallots chopped fine, 1 tb Garlic chopped fine, 1 tb Galangal chopped fine, 1 tb Lemon Grass chopped fine, 1/4 c Coriander leaves chop fine, 1 1/2 lb Pork cut into 1\" cubes, 1 1/2 c Coconut milk, 2 tb Curry paste (Thai Green), 1 tb Lime zest, 1 tb Lime leaves shredded, 2 tb Thai basil shredded, 1 tb Fish sauce, 1 ts Chili paste (green), 2 c Peas",
    "servings": "1 servings",
    "instructions": "First, prepare the curry paste and coconut milk seperately. Add the paste with some of the 'cream' form the coconut milk and heat until the oil starts to separate. Then, in a separate pan, heat peanut oil, shallots, garlic, galangal and lemon grass. Stir fry 1 minute until oil is aromatic. Add pork, stir fry 3 minutes until browned and add the curry paste/coconut milk mixture. Add the rest of the coconut milk, coriander leaves, lime zest, lime leaves, basil, fish sauce and chili paste, bring to a boil, and reduce heat. Simmer 20 minutes until pork is tender. Add peas, simmer 5 minutes until tender. Yield - 4 cups",
    "nutrition": {
      "Calories": 2845.9500000000003,
      "Total fat": 183.04000000000002,
      "Saturated fat": 101.04000000000002,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 598.74,
      "Sodium": 3461.68,
      "Total carbs": 96.5,
      "Fiber": 21.590000000000003,
      "Sugar": 33.629999999999995,
      "Protein": 208.41999999999996
    }
  },
  {
    "keyword": "Pork",
    "title": "Medallions of Pork with Pear Sauce",
    "ingredients": "2 tb Vegetable oil, 4 Boneless pork loin chops (1/2-inch-thick), Dried rubbed sage, All purpose flour, 2 Pears peeled, cored, thinly sliced (about 1 pound), 1/3 c Dry white wine, 2 tb Sugar, 2 tb Chopped crystallized ginger",
    "servings": "1 servings",
    "instructions": "Heat oil in heavy large skillet over medium heat. Season pork with dried sage, salt and pepper. Coat pork with flour; shake off excess. Add pork to skillet and saute until brown, about 3 minutes per side. Transfer to platter. Drain fat from skillet. Add pears and saute over medium heat 2 minutes. Stir in wine, sugar and ginger, scraping up any browned bits. Increase heat to high and boil until pears are tender and syrup is thick, about 5 minutes. Return pork and any accumulated juices to skillet. Simmer just until cooked through, about 1 minute. Season to taste with salt and pepper. Arrange pork on plates. Spoon sauce over and serve. Serves 4.",
    "nutrition": {
      "Calories": 1789.8600000000001,
      "Total fat": 59.06,
      "Saturated fat": 12.05,
      "Trans fat": 0.0,
      "Polyunsaturated fat": 0.0,
      "Monounsaturated fat": 0.0,
      "Cholesterol": 272.0,
      "Sodium": 167.50000000000003,
      "Total carbs": 196.46000000000004,
      "Fiber": 15.04,
      "Sugar": 78.47,
      "Protein": 104.46
    }
  }
]